000100 IDENTIFICATION DIVISION.                                         00000100
000200 PROGRAM-ID.    CN860001.                                         00000200
000300 INSTALLATION.  HEALTH CARE SERVICE CORPORATION.                  00000300
000400 AUTHOR.        CHRIS SEIDL.                                      00000400
000500 DATE-WRITTEN.  12-23-13.                                         00000500
000600 DATE-COMPILED.                                                   00000600
003800****************************************************************  00002500
003900/                                                                 00002600
004000                                                                  00002700
004100 ENVIRONMENT DIVISION.                                            00002800
004200 CONFIGURATION SECTION.                                           00002900
071100 900-EXIT.                                                        00029600
071200     EXIT.                                                        00029700
                                                                        00029710
