00001 *      LAST MAINTENANCE TIME: 16.30.17  DATE: 01/11/88            11/06/01
00002 *      LAST MAINTENANCE TIME: 15.30.42  DATE: 11/28/87            CN871500
00003  IDENTIFICATION DIVISION.                                            LV001
00004                                                                   CN871500
00049  ENVIRONMENT DIVISION.                                            CN871500
00050  CONFIGURATION SECTION.                                           CN871500
00051  SOURCE-COMPUTER.   AMDAHL-5890.                                  CN871500
00052  OBJECT-COMPUTER.   AMDAHL-5890.                                  CN871500
00053  INPUT-OUTPUT SECTION.                                            CN871500
00755  5000-OUTPUT-EXIT.                                                CN871500
00756      EXIT.                                                        CN871500
