  SORT    FIELDS=(5,57,BI,A)                  AS.IN.GCWRK  (COMPLETE)           
  RECORD  TYPE=V,LENGTH=(7873,,110,200)     CONTR.FILE  PROC GCD03A             
