  SORT    FIELDS=(5,57,BI,A)                  AS.IN.GCWRK  (COMPLETE)   00010001
  RECORD  TYPE=V,LENGTH=(8217,,204)     CONTR.FILE  PROC GCD06A         00020006
