  SORT    FIELDS=(5,32,BI,A,47,10,BI,A,37,10,BI,A)     57 BYTE WRK KEY          
  RECORD  TYPE=V,LENGTH=(8217,,204)     FIRST 20 TAB ID  PROV ID PRO    C GCD06A
