      ******************************************************************        
      *                         COPYLIB Member                         *        
      ******************************************************************        
      *                                                                *        
      *    Member Name:   ELSBPTBL                                     *        
      *    Member Title:  Benefit Provision Master List                *        
      *    Date Created:  08-Dec-1992                                  *        
      *    Author:        Automated Procedure                          *        
      *                                                                *        
      *    Function:                                                   *        
      *       This is the master list of all benefit provisions        *        
      *       permitted within the English Contract Inquiry system and *        
      *       related special interfaces.                              *        
      *                                                                *        
      ******************************************************************        
      *                                                                *        
      *                       Maintenance History                      *        
      *                                                                *        
      *  Mod     Date      By               Action/Reason              *        
      * ----- ----------- ---- --------------------------------------- *        
      * 03.00  9-Dec-1992 AUTO Generated from new data.                *        
      *                                                                *        
      ******************************************************************        
                                                                                
       01  BPL-BENEFIT-PROVISION-LIST.                                          
           02 BPL-COUNTS.                                                       
              03 BPL-NBR-TBL-ENTRIES            PIC S9(04)       COMP           
                                                VALUE  +752.                    
              03 BPL-NBR-INST-ENTRIES           PIC S9(04)       COMP           
                                                VALUE  +322.                    
              03 BPL-NBR-PROF-ENTRIES           PIC S9(04)       COMP           
                                                VALUE  +430.                    
              03 BPL-NBR-IP-ENTRIES             PIC S9(04)       COMP           
                                                VALUE  +242.                    
              03 BPL-NBR-OP-ENTRIES             PIC S9(04)       COMP           
                                                VALUE  +406.                    
              03 BPL-NBR-BOTH-ENTRIES           PIC S9(04)       COMP           
                                                VALUE  +104.                    
              03 BPL-NBR-ALT-ENTRIES            PIC S9(04)       COMP           
                                                VALUE  +125.                    
              03 BPL-NBR-NON-STD-ENTRIES        PIC S9(04)       COMP           
                                                VALUE   +81.                    
                                                                                
           02 BPL-VLS.                                                          
              03 PIC  X(09)              VALUE 'ABUA WIYN'.                     
              03 PIC  X(09)              VALUE 'ABUB WOYN'.                     
              03 PIC  X(09)              VALUE 'ABUE WOYN'.                     
              03 PIC  X(09)              VALUE 'ABUF AOYN'.                     
              03 PIC  X(09)              VALUE 'ABUF WOYN'.                     
              03 PIC  X(09)              VALUE 'ABUI AINN'.                     
              03 PIC  X(09)              VALUE 'ABUI WINN'.                     
              03 PIC  X(09)              VALUE 'ABUJ WIYN'.                     
              03 PIC  X(09)              VALUE 'ABUO AONN'.                     
              03 PIC  X(09)              VALUE 'ABUO WONN'.                     
              03 PIC  X(09)              VALUE 'ABUP WOYN'.                     
              03 PIC  X(09)              VALUE 'ACAI CINN'.                     
              03 PIC  X(09)              VALUE 'ACAO CONN'.                     
              03 PIC  X(09)              VALUE 'ACCO BBNN'.                     
              03 PIC  X(09)              VALUE 'ACCO EBNN'.                     
              03 PIC  X(09)              VALUE 'ACTI BINN'.                     
              03 PIC  X(09)              VALUE 'ACTI EINN'.                     
              03 PIC  X(09)              VALUE 'ACTO BONN'.                     
              03 PIC  X(09)              VALUE 'ACTO EONN'.                     
              03 PIC  X(09)              VALUE 'ADOC BBNN'.                     
              03 PIC  X(09)              VALUE 'ADOC EBNN'.                     
              03 PIC  X(09)              VALUE 'ADXA WIYN'.                     
              03 PIC  X(09)              VALUE 'ADXF WOYN'.                     
              03 PIC  X(09)              VALUE 'ADXI WINN'.                     
              03 PIC  X(09)              VALUE 'ADXJ WIYN'.                     
              03 PIC  X(09)              VALUE 'ADXO WONN'.                     
              03 PIC  X(09)              VALUE 'AHI  DINN'.                     
              03 PIC  X(09)              VALUE 'AIDA BOYN'.                     
              03 PIC  X(09)              VALUE 'AIDE BONN'.                     
              03 PIC  X(09)              VALUE 'AIDE EONN'.                     
              03 PIC  X(09)              VALUE 'ALTI BINN'.                     
              03 PIC  X(09)              VALUE 'ALTI EINN'.                     
              03 PIC  X(09)              VALUE 'ALTO BONN'.                     
              03 PIC  X(09)              VALUE 'ALTO EONN'.                     
              03 PIC  X(09)              VALUE 'ALTW BOYN'.                     
              03 PIC  X(09)              VALUE 'ALTW EOYN'.                     
              03 PIC  X(09)              VALUE 'AMB  BBNN'.                     
              03 PIC  X(09)              VALUE 'AMB  EBNN'.                     
              03 PIC  X(09)              VALUE 'AMBM BBNN'.                     
              03 PIC  X(09)              VALUE 'AMBM EBNN'.                     
              03 PIC  X(09)              VALUE 'ANSI CINN'.                     
              03 PIC  X(09)              VALUE 'ANSL CBNN'.                     
              03 PIC  X(09)              VALUE 'ANSO CONN'.                     
              03 PIC  X(09)              VALUE 'APFI BINN'.                     
              03 PIC  X(09)              VALUE 'APFO BONN'.                     
              03 PIC  X(09)              VALUE 'ARPA WIYN'.                     
              03 PIC  X(09)              VALUE 'ARPB WOYN'.                     
              03 PIC  X(09)              VALUE 'ARPE WOYN'.                     
              03 PIC  X(09)              VALUE 'ARPF WOYN'.                     
              03 PIC  X(09)              VALUE 'ARPI WINN'.                     
              03 PIC  X(09)              VALUE 'ARPJ WIYN'.                     
              03 PIC  X(09)              VALUE 'ARPO WONN'.                     
              03 PIC  X(09)              VALUE 'ARPP WOYN'.                     
              03 PIC  X(09)              VALUE 'ASEM CBNN'.                     
              03 PIC  X(09)              VALUE 'ASOP EBNN'.                     
              03 PIC  X(09)              VALUE 'ASSI CINN'.                     
              03 PIC  X(09)              VALUE 'ASSO CONN'.                     
              03 PIC  X(09)              VALUE 'ATI  BINN'.                     
              03 PIC  X(09)              VALUE 'ATII EINN'.                     
              03 PIC  X(09)              VALUE 'ATO  BONN'.                     
              03 PIC  X(09)              VALUE 'ATO  EONN'.                     
              03 PIC  X(09)              VALUE 'ATOW BOYN'.                     
              03 PIC  X(09)              VALUE 'ATOW EOYN'.                     
              03 PIC  X(09)              VALUE 'ATSI EINN'.                     
              03 PIC  X(09)              VALUE 'AUTO CBNN'.                     
              03 PIC  X(09)              VALUE 'BAMI BINN'.                     
              03 PIC  X(09)              VALUE 'BAMI EINN'.                     
              03 PIC  X(09)              VALUE 'BAMO BONN'.                     
              03 PIC  X(09)              VALUE 'BAMO EONN'.                     
              03 PIC  X(09)              VALUE 'BCHI BINN'.                     
              03 PIC  X(09)              VALUE 'BCHI EINN'.                     
              03 PIC  X(09)              VALUE 'BCHO BONN'.                     
              03 PIC  X(09)              VALUE 'BCHO EONN'.                     
              03 PIC  X(09)              VALUE 'BDRI BINN'.                     
              03 PIC  X(09)              VALUE 'BDRI EINN'.                     
              03 PIC  X(09)              VALUE 'BDRO BONN'.                     
              03 PIC  X(09)              VALUE 'BDRO EONN'.                     
              03 PIC  X(09)              VALUE 'BIOI BINN'.                     
              03 PIC  X(09)              VALUE 'BIOI EINN'.                     
              03 PIC  X(09)              VALUE 'BIOO BONN'.                     
              03 PIC  X(09)              VALUE 'BIOO EONN'.                     
              03 PIC  X(09)              VALUE 'BIRD CIYN'.                     
              03 PIC  X(09)              VALUE 'BIRH WIYN'.                     
              03 PIC  X(09)              VALUE 'BIRM CIYN'.                     
              03 PIC  X(09)              VALUE 'BIRS CIYN'.                     
              03 PIC  X(09)              VALUE 'BLCI BINN'.                     
              03 PIC  X(09)              VALUE 'BLCI EINN'.                     
              03 PIC  X(09)              VALUE 'BLCO BONN'.                     
              03 PIC  X(09)              VALUE 'BLCO EONN'.                     
              03 PIC  X(09)              VALUE 'BLDI BINN'.                     
              03 PIC  X(09)              VALUE 'BLDI EINN'.                     
              03 PIC  X(09)              VALUE 'BLDO BONN'.                     
              03 PIC  X(09)              VALUE 'BLDO EONN'.                     
              03 PIC  X(09)              VALUE 'BPRI BINN'.                     
              03 PIC  X(09)              VALUE 'BPRI EINN'.                     
              03 PIC  X(09)              VALUE 'BPRO BONN'.                     
              03 PIC  X(09)              VALUE 'BPRO EONN'.                     
              03 PIC  X(09)              VALUE 'BRCI BINN'.                     
              03 PIC  X(09)              VALUE 'BRCI EINN'.                     
              03 PIC  X(09)              VALUE 'BRCO BONN'.                     
              03 PIC  X(09)              VALUE 'BRCO EONN'.                     
              03 PIC  X(09)              VALUE 'BRRI EINN'.                     
              03 PIC  X(09)              VALUE 'BRRO EONN'.                     
              03 PIC  X(09)              VALUE 'BRTI EINN'.                     
              03 PIC  X(09)              VALUE 'BRTO EONN'.                     
              03 PIC  X(09)              VALUE 'BRXI EINN'.                     
              03 PIC  X(09)              VALUE 'BRXO EONN'.                     
              03 PIC  X(09)              VALUE 'BXTI EINN'.                     
              03 PIC  X(09)              VALUE 'BXTO EONN'.                     
              03 PIC  X(09)              VALUE 'CDIS CIYN'.                     
              03 PIC  X(09)              VALUE 'CDMP EOYN'.                     
              03 PIC  X(09)              VALUE 'CDOS COYN'.                     
              03 PIC  X(09)              VALUE 'CDSI CINN'.                     
              03 PIC  X(09)              VALUE 'CDSO CONN'.                     
              03 PIC  X(09)              VALUE 'CFOV EONN'.                     
              03 PIC  X(09)              VALUE 'CFTI BINN'.                     
              03 PIC  X(09)              VALUE 'CFTO BONN'.                     
              03 PIC  X(09)              VALUE 'CHC  WBNN'.                     
              03 PIC  X(09)              VALUE 'CHCO EOYN'.                     
              03 PIC  X(09)              VALUE 'CHCS WBYN'.                     
              03 PIC  X(09)              VALUE 'CHCV DBNN'.                     
              03 PIC  X(09)              VALUE 'CHEM WOYN'.                     
              03 PIC  X(09)              VALUE 'CINJ EOYN'.                     
              03 PIC  X(09)              VALUE 'CIRC BINN'.                     
              03 PIC  X(09)              VALUE 'CLAB EOYN'.                     
              03 PIC  X(09)              VALUE 'CLED EONY'.                     
              03 PIC  X(09)              VALUE 'CLEM EONY'.                     
              03 PIC  X(09)              VALUE 'CLEN EONY'.                     
              03 PIC  X(09)              VALUE 'CLMD EONY'.                     
              03 PIC  X(09)              VALUE 'CMPT EOYN'.                     
              03 PIC  X(09)              VALUE 'CMS  EOYN'.                     
              03 PIC  X(09)              VALUE 'COIS CIYN'.                     
              03 PIC  X(09)              VALUE 'CONI EINN'.                     
              03 PIC  X(09)              VALUE 'CONO EONN'.                     
              03 PIC  X(09)              VALUE 'COOS COYN'.                     
              03 PIC  X(09)              VALUE 'COSI CINN'.                     
              03 PIC  X(09)              VALUE 'COSO CONN'.                     
              03 PIC  X(09)              VALUE 'CPAP EOYN'.                     
              03 PIC  X(09)              VALUE 'CPT  EOYN'.                     
              03 PIC  X(09)              VALUE 'CRIO EOYN'.                     
              03 PIC  X(09)              VALUE 'CRPI BINN'.                     
              03 PIC  X(09)              VALUE 'CRPO BONN'.                     
              03 PIC  X(09)              VALUE 'CSVI DINN'.                     
              03 PIC  X(09)              VALUE 'CSVO EONN'.                     
              03 PIC  X(09)              VALUE 'CVIS EOYN'.                     
              03 PIC  X(09)              VALUE 'CXRY EOYN'.                     
              03 PIC  X(09)              VALUE 'DDXA WIYN'.                     
              03 PIC  X(09)              VALUE 'DDXF WOYN'.                     
              03 PIC  X(09)              VALUE 'DDXI WINN'.                     
              03 PIC  X(09)              VALUE 'DDXJ WIYN'.                     
              03 PIC  X(09)              VALUE 'DDXO WONN'.                     
              03 PIC  X(09)              VALUE 'DEIS CIYN'.                     
              03 PIC  X(09)              VALUE 'DENI CINN'.                     
              03 PIC  X(09)              VALUE 'DENO CONN'.                     
              03 PIC  X(09)              VALUE 'DEOS COYN'.                     
              03 PIC  X(09)              VALUE 'DIAI BINN'.                     
              03 PIC  X(09)              VALUE 'DIAI DINN'.                     
              03 PIC  X(09)              VALUE 'DIAO AONN'.                     
              03 PIC  X(09)              VALUE 'DIAO EONN'.                     
              03 PIC  X(09)              VALUE 'DIET EBNN'.                     
              03 PIC  X(09)              VALUE 'DIET WBNN'.                     
              03 PIC  X(09)              VALUE 'DMEI BINN'.                     
              03 PIC  X(09)              VALUE 'DMEI EINN'.                     
              03 PIC  X(09)              VALUE 'DMEO BONN'.                     
              03 PIC  X(09)              VALUE 'DMEO EONN'.                     
              03 PIC  X(09)              VALUE 'DMPI BINN'.                     
              03 PIC  X(09)              VALUE 'DMPI EINN'.                     
              03 PIC  X(09)              VALUE 'DMPO BONN'.                     
              03 PIC  X(09)              VALUE 'DMPO EONN'.                     
              03 PIC  X(09)              VALUE 'DMRI BINN'.                     
              03 PIC  X(09)              VALUE 'DMRI EINN'.                     
              03 PIC  X(09)              VALUE 'DMRO BONN'.                     
              03 PIC  X(09)              VALUE 'DMRO EONN'.                     
              03 PIC  X(09)              VALUE 'DPSA AIYN'.                     
              03 PIC  X(09)              VALUE 'DPSY AINN'.                     
              03 PIC  X(09)              VALUE 'DPSZ AIYN'.                     
              03 PIC  X(09)              VALUE 'DPV  DINN'.                     
              03 PIC  X(09)              VALUE 'DRB  AINN'.                     
              03 PIC  X(09)              VALUE 'DRGI BINN'.                     
              03 PIC  X(09)              VALUE 'DRGI EINN'.                     
              03 PIC  X(09)              VALUE 'DRGO BONN'.                     
              03 PIC  X(09)              VALUE 'DRGO EONN'.                     
              03 PIC  X(09)              VALUE 'DRI  DINN'.                     
              03 PIC  X(09)              VALUE 'DRPA WIYN'.                     
              03 PIC  X(09)              VALUE 'DRPB WOYN'.                     
              03 PIC  X(09)              VALUE 'DRPE WOYN'.                     
              03 PIC  X(09)              VALUE 'DRPF WOYN'.                     
              03 PIC  X(09)              VALUE 'DRPI WINN'.                     
              03 PIC  X(09)              VALUE 'DRPJ WIYN'.                     
              03 PIC  X(09)              VALUE 'DRPO WONN'.                     
              03 PIC  X(09)              VALUE 'DRPP WOYN'.                     
              03 PIC  X(09)              VALUE 'DRTI BINN'.                     
              03 PIC  X(09)              VALUE 'DRTI EINN'.                     
              03 PIC  X(09)              VALUE 'DRTO BONN'.                     
              03 PIC  X(09)              VALUE 'DRTO EONN'.                     
              03 PIC  X(09)              VALUE 'DTI  BINN'.                     
              03 PIC  X(09)              VALUE 'DTI  EINN'.                     
              03 PIC  X(09)              VALUE 'DTO  BONN'.                     
              03 PIC  X(09)              VALUE 'DTO  EONN'.                     
              03 PIC  X(09)              VALUE 'DTOX AINN'.                     
              03 PIC  X(09)              VALUE 'DXTI BINN'.                     
              03 PIC  X(09)              VALUE 'DXTI EINN'.                     
              03 PIC  X(09)              VALUE 'DXTO BONN'.                     
              03 PIC  X(09)              VALUE 'DXTO EONN'.                     
              03 PIC  X(09)              VALUE 'EABA BONN'.                     
              03 PIC  X(09)              VALUE 'EABA EONN'.                     
              03 PIC  X(09)              VALUE 'EABC BONN'.                     
              03 PIC  X(09)              VALUE 'EABC EONN'.                     
              03 PIC  X(09)              VALUE 'EABD BONN'.                     
              03 PIC  X(09)              VALUE 'EABD EONN'.                     
              03 PIC  X(09)              VALUE 'EABI CINN'.                     
              03 PIC  X(09)              VALUE 'EABI WINN'.                     
              03 PIC  X(09)              VALUE 'EABO CBNN'.                     
              03 PIC  X(09)              VALUE 'EABO WBNN'.                     
              03 PIC  X(09)              VALUE 'EABP BONN'.                     
              03 PIC  X(09)              VALUE 'EABP EONN'.                     
              03 PIC  X(09)              VALUE 'EABR BONN'.                     
              03 PIC  X(09)              VALUE 'EABR EONN'.                     
              03 PIC  X(09)              VALUE 'EAC  EONN'.                     
              03 PIC  X(09)              VALUE 'EACF BONN'.                     
              03 PIC  X(09)              VALUE 'EACF EONN'.                     
              03 PIC  X(09)              VALUE 'EACI EONN'.                     
              03 PIC  X(09)              VALUE 'EACX BONN'.                     
              03 PIC  X(09)              VALUE 'EADM BOYN'.                     
              03 PIC  X(09)              VALUE 'EAER BONN'.                     
              03 PIC  X(09)              VALUE 'EAHM BONN'.                     
              03 PIC  X(09)              VALUE 'EAIH BONN'.                     
              03 PIC  X(09)              VALUE 'EAIH EONN'.                     
              03 PIC  X(09)              VALUE 'EAL  BONN'.                     
              03 PIC  X(09)              VALUE 'EAL  EONN'.                     
              03 PIC  X(09)              VALUE 'EAMP BONN'.                     
              03 PIC  X(09)              VALUE 'EAMP EONN'.                     
              03 PIC  X(09)              VALUE 'EAMS BONN'.                     
              03 PIC  X(09)              VALUE 'EAMS EONN'.                     
              03 PIC  X(09)              VALUE 'EAMV BONN'.                     
              03 PIC  X(09)              VALUE 'EAPL BONN'.                     
              03 PIC  X(09)              VALUE 'EAPL EONN'.                     
              03 PIC  X(09)              VALUE 'EAPT EONN'.                     
              03 PIC  X(09)              VALUE 'EARI BONN'.                     
              03 PIC  X(09)              VALUE 'EARI EONN'.                     
              03 PIC  X(09)              VALUE 'EARX BONN'.                     
              03 PIC  X(09)              VALUE 'EARX EONN'.                     
              03 PIC  X(09)              VALUE 'EASS BONN'.                     
              03 PIC  X(09)              VALUE 'EAX  BONN'.                     
              03 PIC  X(09)              VALUE 'EAX  EONN'.                     
              03 PIC  X(09)              VALUE 'ECFA DINN'.                     
              03 PIC  X(09)              VALUE 'ECFD DINN'.                     
              03 PIC  X(09)              VALUE 'ECFM DINN'.                     
              03 PIC  X(09)              VALUE 'ECFT DINN'.                     
              03 PIC  X(09)              VALUE 'ECFV DINN'.                     
              03 PIC  X(09)              VALUE 'EHV  DINN'.                     
              03 PIC  X(09)              VALUE 'EMBA BONN'.                     
              03 PIC  X(09)              VALUE 'EMBA EONN'.                     
              03 PIC  X(09)              VALUE 'EMBC BONN'.                     
              03 PIC  X(09)              VALUE 'EMBC EONN'.                     
              03 PIC  X(09)              VALUE 'EMBD BONN'.                     
              03 PIC  X(09)              VALUE 'EMBD EONN'.                     
              03 PIC  X(09)              VALUE 'EMBP BONN'.                     
              03 PIC  X(09)              VALUE 'EMBP EONN'.                     
              03 PIC  X(09)              VALUE 'EMBR BONN'.                     
              03 PIC  X(09)              VALUE 'EMBR EONN'.                     
              03 PIC  X(09)              VALUE 'EMC  EONN'.                     
              03 PIC  X(09)              VALUE 'EMCI EONN'.                     
              03 PIC  X(09)              VALUE 'EMCX BONN'.                     
              03 PIC  X(09)              VALUE 'EMER BONN'.                     
              03 PIC  X(09)              VALUE 'EMHM BONN'.                     
              03 PIC  X(09)              VALUE 'EMIH BONN'.                     
              03 PIC  X(09)              VALUE 'EMIH EONN'.                     
              03 PIC  X(09)              VALUE 'EML  BONN'.                     
              03 PIC  X(09)              VALUE 'EML  EONN'.                     
              03 PIC  X(09)              VALUE 'EMMP BONN'.                     
              03 PIC  X(09)              VALUE 'EMMP EONN'.                     
              03 PIC  X(09)              VALUE 'EMMS BONN'.                     
              03 PIC  X(09)              VALUE 'EMMS EONN'.                     
              03 PIC  X(09)              VALUE 'EMMV BONN'.                     
              03 PIC  X(09)              VALUE 'EMPL BONN'.                     
              03 PIC  X(09)              VALUE 'EMPL EONN'.                     
              03 PIC  X(09)              VALUE 'EMPT EONN'.                     
              03 PIC  X(09)              VALUE 'EMRI BONN'.                     
              03 PIC  X(09)              VALUE 'EMRI EONN'.                     
              03 PIC  X(09)              VALUE 'EMRX BONN'.                     
              03 PIC  X(09)              VALUE 'EMRX EONN'.                     
              03 PIC  X(09)              VALUE 'EMSS BONN'.                     
              03 PIC  X(09)              VALUE 'EMX  BONN'.                     
              03 PIC  X(09)              VALUE 'EMX  EONN'.                     
              03 PIC  X(09)              VALUE 'ERIS CIYN'.                     
              03 PIC  X(09)              VALUE 'EROS COYN'.                     
              03 PIC  X(09)              VALUE 'ERSI BINN'.                     
              03 PIC  X(09)              VALUE 'ERSO BONN'.                     
              03 PIC  X(09)              VALUE 'ESI  CINN'.                     
              03 PIC  X(09)              VALUE 'ESIS CIYN'.                     
              03 PIC  X(09)              VALUE 'ESO  CONN'.                     
              03 PIC  X(09)              VALUE 'ESOS COYN'.                     
              03 PIC  X(09)              VALUE 'ESRI CINN'.                     
              03 PIC  X(09)              VALUE 'ESRI WINN'.                     
              03 PIC  X(09)              VALUE 'ESRO CONN'.                     
              03 PIC  X(09)              VALUE 'ESRO WONN'.                     
              03 PIC  X(09)              VALUE 'ESTI EINN'.                     
              03 PIC  X(09)              VALUE 'ESTO EONN'.                     
              03 PIC  X(09)              VALUE 'ETAI CINN'.                     
              03 PIC  X(09)              VALUE 'ETAO CONN'.                     
              03 PIC  X(09)              VALUE 'EXPI BINN'.                     
              03 PIC  X(09)              VALUE 'EXPO BONN'.                     
              03 PIC  X(09)              VALUE 'FCAI BINN'.                     
              03 PIC  X(09)              VALUE 'FCAI DINN'.                     
              03 PIC  X(09)              VALUE 'FCAJ EOYN'.                     
              03 PIC  X(09)              VALUE 'FCAO BONN'.                     
              03 PIC  X(09)              VALUE 'FCAO EONN'.                     
              03 PIC  X(09)              VALUE 'FCCI BINN'.                     
              03 PIC  X(09)              VALUE 'FCCI DINN'.                     
              03 PIC  X(09)              VALUE 'FCCJ EOYN'.                     
              03 PIC  X(09)              VALUE 'FCCO BONN'.                     
              03 PIC  X(09)              VALUE 'FCCO EONN'.                     
              03 PIC  X(09)              VALUE 'FHI  BINN'.                     
              03 PIC  X(09)              VALUE 'FHI  DINN'.                     
              03 PIC  X(09)              VALUE 'FHO  BONN'.                     
              03 PIC  X(09)              VALUE 'FHO  EONN'.                     
              03 PIC  X(09)              VALUE 'FOTI BINN'.                     
              03 PIC  X(09)              VALUE 'FOTI EINN'.                     
              03 PIC  X(09)              VALUE 'FOTO BONN'.                     
              03 PIC  X(09)              VALUE 'FOTO EONN'.                     
              03 PIC  X(09)              VALUE 'FPO  BONN'.                     
              03 PIC  X(09)              VALUE 'FPO  EONN'.                     
              03 PIC  X(09)              VALUE 'FRAA EONY'.                     
              03 PIC  X(09)              VALUE 'FRAD EONY'.                     
              03 PIC  X(09)              VALUE 'FRAM EONY'.                     
              03 PIC  X(09)              VALUE 'FRAR EOYN'.                     
              03 PIC  X(09)              VALUE 'GPI  BINN'.                     
              03 PIC  X(09)              VALUE 'GPI  DINN'.                     
              03 PIC  X(09)              VALUE 'GPJ  EOYN'.                     
              03 PIC  X(09)              VALUE 'GPO  BONN'.                     
              03 PIC  X(09)              VALUE 'GPO  EONN'.                     
              03 PIC  X(09)              VALUE 'GREF BBNN'.                     
              03 PIC  X(09)              VALUE 'GREF EBNN'.                     
              03 PIC  X(09)              VALUE 'HAAC EONY'.                     
              03 PIC  X(09)              VALUE 'HADF EONY'.                     
              03 PIC  X(09)              VALUE 'HAEV EONY'.                     
              03 PIC  X(09)              VALUE 'HAID BONY'.                     
              03 PIC  X(09)              VALUE 'HAID EONY'.                     
              03 PIC  X(09)              VALUE 'HCPI EINY'.                     
              03 PIC  X(09)              VALUE 'HCPM BBNN'.                     
              03 PIC  X(09)              VALUE 'HCPM EBNN'.                     
              03 PIC  X(09)              VALUE 'HCPO EONY'.                     
              03 PIC  X(09)              VALUE 'HEAR EONY'.                     
              03 PIC  X(09)              VALUE 'HECO EONY'.                     
              03 PIC  X(09)              VALUE 'HHP  BONN'.                     
              03 PIC  X(09)              VALUE 'HHP  EONN'.                     
              03 PIC  X(09)              VALUE 'HHRX BONN'.                     
              03 PIC  X(09)              VALUE 'HHV  DONN'.                     
              03 PIC  X(09)              VALUE 'HMI  BINN'.                     
              03 PIC  X(09)              VALUE 'HMO  BONN'.                     
              03 PIC  X(09)              VALUE 'HOSP WBNN'.                     
              03 PIC  X(09)              VALUE 'HTEI BINN'.                     
              03 PIC  X(09)              VALUE 'HTEI EINN'.                     
              03 PIC  X(09)              VALUE 'HTEO BONN'.                     
              03 PIC  X(09)              VALUE 'HTEO EONN'.                     
              03 PIC  X(09)              VALUE 'HTI  BINN'.                     
              03 PIC  X(09)              VALUE 'HTI  EINN'.                     
              03 PIC  X(09)              VALUE 'HTO  BONN'.                     
              03 PIC  X(09)              VALUE 'HTO  EONN'.                     
              03 PIC  X(09)              VALUE 'HVD  DINN'.                     
              03 PIC  X(09)              VALUE 'HVIS EONN'.                     
              03 PIC  X(09)              VALUE 'HVO  EONN'.                     
              03 PIC  X(09)              VALUE 'HYPI BINN'.                     
              03 PIC  X(09)              VALUE 'HYPI DINN'.                     
              03 PIC  X(09)              VALUE 'HYPJ EOYN'.                     
              03 PIC  X(09)              VALUE 'HYPO BONN'.                     
              03 PIC  X(09)              VALUE 'HYPO EONN'.                     
              03 PIC  X(09)              VALUE 'ICUN AINN'.                     
              03 PIC  X(09)              VALUE 'ICUR AINN'.                     
              03 PIC  X(09)              VALUE 'ICUR BINN'.                     
              03 PIC  X(09)              VALUE 'ICV  DINN'.                     
              03 PIC  X(09)              VALUE 'IHI  BINN'.                     
              03 PIC  X(09)              VALUE 'IHI  EINN'.                     
              03 PIC  X(09)              VALUE 'IHO  BONN'.                     
              03 PIC  X(09)              VALUE 'IHO  EONN'.                     
              03 PIC  X(09)              VALUE 'IHV  DINN'.                     
              03 PIC  X(09)              VALUE 'IMM  BONN'.                     
              03 PIC  X(09)              VALUE 'IMM  EONN'.                     
              03 PIC  X(09)              VALUE 'INJ  EBNN'.                     
              03 PIC  X(09)              VALUE 'INVI CBNN'.                     
              03 PIC  X(09)              VALUE 'IPI  BINN'.                     
              03 PIC  X(09)              VALUE 'IPI  DINN'.                     
              03 PIC  X(09)              VALUE 'IPJ  EOYN'.                     
              03 PIC  X(09)              VALUE 'IPO  BONN'.                     
              03 PIC  X(09)              VALUE 'IPO  EONN'.                     
              03 PIC  X(09)              VALUE 'ISII BINN'.                     
              03 PIC  X(09)              VALUE 'ISII EINN'.                     
              03 PIC  X(09)              VALUE 'ISIO BONN'.                     
              03 PIC  X(09)              VALUE 'ISIO EONN'.                     
              03 PIC  X(09)              VALUE 'ISTI EINN'.                     
              03 PIC  X(09)              VALUE 'ISTO EONN'.                     
              03 PIC  X(09)              VALUE 'JUNK BBNN'.                     
              03 PIC  X(09)              VALUE 'KITI BINN'.                     
              03 PIC  X(09)              VALUE 'KITO BONN'.                     
              03 PIC  X(09)              VALUE 'LABI BINN'.                     
              03 PIC  X(09)              VALUE 'LABI EINN'.                     
              03 PIC  X(09)              VALUE 'LABO BONN'.                     
              03 PIC  X(09)              VALUE 'LABO EONN'.                     
              03 PIC  X(09)              VALUE 'LBIF EONY'.                     
              03 PIC  X(09)              VALUE 'LCNC EOYN'.                     
              03 PIC  X(09)              VALUE 'LCNT EONY'.                     
              03 PIC  X(09)              VALUE 'LENT EONY'.                     
              03 PIC  X(09)              VALUE 'LSNG EONY'.                     
              03 PIC  X(09)              VALUE 'LTRI EONY'.                     
              03 PIC  X(09)              VALUE 'MAGO EOYN'.                     
              03 PIC  X(09)              VALUE 'MAJA EONY'.                     
              03 PIC  X(09)              VALUE 'MAJB EONY'.                     
              03 PIC  X(09)              VALUE 'MAJC EONY'.                     
              03 PIC  X(09)              VALUE 'MAJD EONY'.                     
              03 PIC  X(09)              VALUE 'MAJE EONY'.                     
              03 PIC  X(09)              VALUE 'MAJF EONY'.                     
              03 PIC  X(09)              VALUE 'MAJG EONY'.                     
              03 PIC  X(09)              VALUE 'MAJH EONY'.                     
              03 PIC  X(09)              VALUE 'MAJI EONY'.                     
              03 PIC  X(09)              VALUE 'MAJJ EONY'.                     
              03 PIC  X(09)              VALUE 'MAJK EONY'.                     
              03 PIC  X(09)              VALUE 'MAJL EONY'.                     
              03 PIC  X(09)              VALUE 'MAJM EONY'.                     
              03 PIC  X(09)              VALUE 'MAMI BIYN'.                     
              03 PIC  X(09)              VALUE 'MAMI EIYN'.                     
              03 PIC  X(09)              VALUE 'MAMO BOYN'.                     
              03 PIC  X(09)              VALUE 'MAMO EOYN'.                     
              03 PIC  X(09)              VALUE 'MASO EBYN'.                     
              03 PIC  X(09)              VALUE 'MBD  WBNN'.                     
              03 PIC  X(09)              VALUE 'MBM  WBNN'.                     
              03 PIC  X(09)              VALUE 'MBS  WBNN'.                     
              03 PIC  X(09)              VALUE 'MCHI BINN'.                     
              03 PIC  X(09)              VALUE 'MCHI EINN'.                     
              03 PIC  X(09)              VALUE 'MCHO BONN'.                     
              03 PIC  X(09)              VALUE 'MCHO EONN'.                     
              03 PIC  X(09)              VALUE 'MCOI AINN'.                     
              03 PIC  X(09)              VALUE 'MCOI BINN'.                     
              03 PIC  X(09)              VALUE 'MDED AINN'.                     
              03 PIC  X(09)              VALUE 'MDED BINN'.                     
              03 PIC  X(09)              VALUE 'MDRI EONN'.                     
              03 PIC  X(09)              VALUE 'MDRO EONN'.                     
              03 PIC  X(09)              VALUE 'MECF AINN'.                     
              03 PIC  X(09)              VALUE 'MGSD AINN'.                     
              03 PIC  X(09)              VALUE 'MLTR ABNN'.                     
              03 PIC  X(09)              VALUE 'MMI  EINN'.                     
              03 PIC  X(09)              VALUE 'MMO  EONN'.                     
              03 PIC  X(09)              VALUE 'MNI  DINN'.                     
              03 PIC  X(09)              VALUE 'MPTI DINN'.                     
              03 PIC  X(09)              VALUE 'MPTO EONN'.                     
              03 PIC  X(09)              VALUE 'MRTI EINN'.                     
              03 PIC  X(09)              VALUE 'MRTO EONN'.                     
              03 PIC  X(09)              VALUE 'MRXI EINN'.                     
              03 PIC  X(09)              VALUE 'MRXO EONN'.                     
              03 PIC  X(09)              VALUE 'MSHI BINN'.                     
              03 PIC  X(09)              VALUE 'MSHO BONN'.                     
              03 PIC  X(09)              VALUE 'MSSI BINN'.                     
              03 PIC  X(09)              VALUE 'MSSI EINN'.                     
              03 PIC  X(09)              VALUE 'MSSO BONN'.                     
              03 PIC  X(09)              VALUE 'MSSO EONN'.                     
              03 PIC  X(09)              VALUE 'NCBI EONN'.                     
              03 PIC  X(09)              VALUE 'NCRC CBNN'.                     
              03 PIC  X(09)              VALUE 'NHV  DINN'.                     
              03 PIC  X(09)              VALUE 'NNBC EINN'.                     
              03 PIC  X(09)              VALUE 'NONC BBNN'.                     
              03 PIC  X(09)              VALUE 'NOPG EBNN'.                     
              03 PIC  X(09)              VALUE 'NPSA AIYN'.                     
              03 PIC  X(09)              VALUE 'NPSY AINN'.                     
              03 PIC  X(09)              VALUE 'NPSZ AIYN'.                     
              03 PIC  X(09)              VALUE 'NPV  DINN'.                     
              03 PIC  X(09)              VALUE 'NRB  AINN'.                     
              03 PIC  X(09)              VALUE 'NRSI BINN'.                     
              03 PIC  X(09)              VALUE 'NRSI EINN'.                     
              03 PIC  X(09)              VALUE 'NRSO BONN'.                     
              03 PIC  X(09)              VALUE 'NRSO EONN'.                     
              03 PIC  X(09)              VALUE 'OBCD CBNN'.                     
              03 PIC  X(09)              VALUE 'OBCD WBNN'.                     
              03 PIC  X(09)              VALUE 'OBCM CBNN'.                     
              03 PIC  X(09)              VALUE 'OBCM WBNN'.                     
              03 PIC  X(09)              VALUE 'OBCS CBNN'.                     
              03 PIC  X(09)              VALUE 'OBCS WBNN'.                     
              03 PIC  X(09)              VALUE 'OBND CBNN'.                     
              03 PIC  X(09)              VALUE 'OBND WBNN'.                     
              03 PIC  X(09)              VALUE 'OBNM CBNN'.                     
              03 PIC  X(09)              VALUE 'OBNM WBNN'.                     
              03 PIC  X(09)              VALUE 'OBNS CBNN'.                     
              03 PIC  X(09)              VALUE 'OBNS WBNN'.                     
              03 PIC  X(09)              VALUE 'OPDR WONY'.                     
              03 PIC  X(09)              VALUE 'OPSG BONN'.                     
              03 PIC  X(09)              VALUE 'OPSG WONN'.                     
              03 PIC  X(09)              VALUE 'ORGI CINN'.                     
              03 PIC  X(09)              VALUE 'ORGI WINN'.                     
              03 PIC  X(09)              VALUE 'ORGO BONN'.                     
              03 PIC  X(09)              VALUE 'ORGO CONN'.                     
              03 PIC  X(09)              VALUE 'ORGO WONN'.                     
              03 PIC  X(09)              VALUE 'ORIS CIYN'.                     
              03 PIC  X(09)              VALUE 'OROS COYN'.                     
              03 PIC  X(09)              VALUE 'ORTA EONY'.                     
              03 PIC  X(09)              VALUE 'ORTB EONY'.                     
              03 PIC  X(09)              VALUE 'OSI  BINN'.                     
              03 PIC  X(09)              VALUE 'OSI  EINN'.                     
              03 PIC  X(09)              VALUE 'OSO  BONN'.                     
              03 PIC  X(09)              VALUE 'OSO  EONN'.                     
              03 PIC  X(09)              VALUE 'OVIS EONN'.                     
              03 PIC  X(09)              VALUE 'OVTI BINN'.                     
              03 PIC  X(09)              VALUE 'OVTI EINN'.                     
              03 PIC  X(09)              VALUE 'OVTO BONN'.                     
              03 PIC  X(09)              VALUE 'OVTO EONN'.                     
              03 PIC  X(09)              VALUE 'PAPI BINN'.                     
              03 PIC  X(09)              VALUE 'PAPI EINN'.                     
              03 PIC  X(09)              VALUE 'PAPO BONN'.                     
              03 PIC  X(09)              VALUE 'PAPO EONN'.                     
              03 PIC  X(09)              VALUE 'PASS AINN'.                     
              03 PIC  X(09)              VALUE 'PAT  BBNN'.                     
              03 PIC  X(09)              VALUE 'PAT  EBNN'.                     
              03 PIC  X(09)              VALUE 'PCI  BINN'.                     
              03 PIC  X(09)              VALUE 'PCI  DINN'.                     
              03 PIC  X(09)              VALUE 'PCIG BINN'.                     
              03 PIC  X(09)              VALUE 'PCIG DINN'.                     
              03 PIC  X(09)              VALUE 'PCO  BONN'.                     
              03 PIC  X(09)              VALUE 'PCO  EONN'.                     
              03 PIC  X(09)              VALUE 'PCOG BONN'.                     
              03 PIC  X(09)              VALUE 'PCOG EONN'.                     
              03 PIC  X(09)              VALUE 'PFCI BINN'.                     
              03 PIC  X(09)              VALUE 'PFCO BONN'.                     
              03 PIC  X(09)              VALUE 'PLAI BINN'.                     
              03 PIC  X(09)              VALUE 'PLAI EINN'.                     
              03 PIC  X(09)              VALUE 'PLAO BONN'.                     
              03 PIC  X(09)              VALUE 'PLAO EONN'.                     
              03 PIC  X(09)              VALUE 'PMTI BINN'.                     
              03 PIC  X(09)              VALUE 'PMTI EINN'.                     
              03 PIC  X(09)              VALUE 'PMTO BONN'.                     
              03 PIC  X(09)              VALUE 'PMTO EONN'.                     
              03 PIC  X(09)              VALUE 'PODI CINN'.                     
              03 PIC  X(09)              VALUE 'PODO CONN'.                     
              03 PIC  X(09)              VALUE 'POIS CIYN'.                     
              03 PIC  X(09)              VALUE 'POOS COYN'.                     
              03 PIC  X(09)              VALUE 'PPFI BINN'.                     
              03 PIC  X(09)              VALUE 'PPFO BONN'.                     
              03 PIC  X(09)              VALUE 'PRAI BINN'.                     
              03 PIC  X(09)              VALUE 'PRAI EINN'.                     
              03 PIC  X(09)              VALUE 'PRAO BONN'.                     
              03 PIC  X(09)              VALUE 'PRAO EONN'.                     
              03 PIC  X(09)              VALUE 'PREA EBNY'.                     
              03 PIC  X(09)              VALUE 'PREB EBNY'.                     
              03 PIC  X(09)              VALUE 'PREC EBNY'.                     
              03 PIC  X(09)              VALUE 'PRED EBNY'.                     
              03 PIC  X(09)              VALUE 'PREE EBNY'.                     
              03 PIC  X(09)              VALUE 'PREF EBNY'.                     
              03 PIC  X(09)              VALUE 'PREG EBNY'.                     
              03 PIC  X(09)              VALUE 'PREH EBNY'.                     
              03 PIC  X(09)              VALUE 'PREI EBNY'.                     
              03 PIC  X(09)              VALUE 'PREX BBYN'.                     
              03 PIC  X(09)              VALUE 'PREX EBYN'.                     
              03 PIC  X(09)              VALUE 'PRIA EBNY'.                     
              03 PIC  X(09)              VALUE 'PRIB EBNY'.                     
              03 PIC  X(09)              VALUE 'PRIC EBNY'.                     
              03 PIC  X(09)              VALUE 'PRID EBNY'.                     
              03 PIC  X(09)              VALUE 'PRIE EBNY'.                     
              03 PIC  X(09)              VALUE 'PRIF EBNY'.                     
              03 PIC  X(09)              VALUE 'PRIG EBNY'.                     
              03 PIC  X(09)              VALUE 'PRII CBNY'.                     
              03 PIC  X(09)              VALUE 'PRIJ CBNY'.                     
              03 PIC  X(09)              VALUE 'PRIK CBNY'.                     
              03 PIC  X(09)              VALUE 'PRIL CBNY'.                     
              03 PIC  X(09)              VALUE 'PRIM EBNY'.                     
              03 PIC  X(09)              VALUE 'PRIN EBNY'.                     
              03 PIC  X(09)              VALUE 'PRIO CBNY'.                     
              03 PIC  X(09)              VALUE 'PRSM EONY'.                     
              03 PIC  X(09)              VALUE 'PSI  BINN'.                     
              03 PIC  X(09)              VALUE 'PSI  DINN'.                     
              03 PIC  X(09)              VALUE 'PSO  BONN'.                     
              03 PIC  X(09)              VALUE 'PSO  EONN'.                     
              03 PIC  X(09)              VALUE 'PSYA WIYN'.                     
              03 PIC  X(09)              VALUE 'PSYI WINN'.                     
              03 PIC  X(09)              VALUE 'PSYJ WIYN'.                     
              03 PIC  X(09)              VALUE 'PSYO WONN'.                     
              03 PIC  X(09)              VALUE 'PTI  EINN'.                     
              03 PIC  X(09)              VALUE 'PTO  EONN'.                     
              03 PIC  X(09)              VALUE 'PTRI WINN'.                     
              03 PIC  X(09)              VALUE 'PTRO WONN'.                     
              03 PIC  X(09)              VALUE 'PVTA AINN'.                     
              03 PIC  X(09)              VALUE 'PVTR AINN'.                     
              03 PIC  X(09)              VALUE 'PXH  EONN'.                     
              03 PIC  X(09)              VALUE 'PXI  BINN'.                     
              03 PIC  X(09)              VALUE 'PXO  BONN'.                     
              03 PIC  X(09)              VALUE 'PXO  EONN'.                     
              03 PIC  X(09)              VALUE 'PXR  EINN'.                     
              03 PIC  X(09)              VALUE 'PYT  BBNN'.                     
              03 PIC  X(09)              VALUE 'PYT  EBNN'.                     
              03 PIC  X(09)              VALUE 'RBAC EONY'.                     
              03 PIC  X(09)              VALUE 'RBDS EONY'.                     
              03 PIC  X(09)              VALUE 'RBIF EOYN'.                     
              03 PIC  X(09)              VALUE 'RCNT EOYN'.                     
              03 PIC  X(09)              VALUE 'RCXI BONN'.                     
              03 PIC  X(09)              VALUE 'RCXO BONN'.                     
              03 PIC  X(09)              VALUE 'RDG  BBNN'.                     
              03 PIC  X(09)              VALUE 'RDM  BBNN'.                     
              03 PIC  X(09)              VALUE 'RDM  EBNN'.                     
              03 PIC  X(09)              VALUE 'RDMP BBNN'.                     
              03 PIC  X(09)              VALUE 'RDMP EBNN'.                     
              03 PIC  X(09)              VALUE 'REHB AINN'.                     
              03 PIC  X(09)              VALUE 'REIN EBNY'.                     
              03 PIC  X(09)              VALUE 'RENT EOYN'.                     
              03 PIC  X(09)              VALUE 'RII  BINN'.                     
              03 PIC  X(09)              VALUE 'RII  EINN'.                     
              03 PIC  X(09)              VALUE 'RIO  BONN'.                     
              03 PIC  X(09)              VALUE 'RIO  EONN'.                     
              03 PIC  X(09)              VALUE 'RITI BINN'.                     
              03 PIC  X(09)              VALUE 'RITO BONN'.                     
              03 PIC  X(09)              VALUE 'RLAB BBNN'.                     
              03 PIC  X(09)              VALUE 'RLAB EBNN'.                     
              03 PIC  X(09)              VALUE 'RLED EONY'.                     
              03 PIC  X(09)              VALUE 'RLEN EONY'.                     
              03 PIC  X(09)              VALUE 'RMAM BBNN'.                     
              03 PIC  X(09)              VALUE 'RMAM EBNN'.                     
              03 PIC  X(09)              VALUE 'RMSI EINN'.                     
              03 PIC  X(09)              VALUE 'RMSO EONN'.                     
              03 PIC  X(09)              VALUE 'RPAI BINN'.                     
              03 PIC  X(09)              VALUE 'RPAI EINN'.                     
              03 PIC  X(09)              VALUE 'RPAO BONN'.                     
              03 PIC  X(09)              VALUE 'RPAO EONN'.                     
              03 PIC  X(09)              VALUE 'RPAP BBNN'.                     
              03 PIC  X(09)              VALUE 'RPAP EBNN'.                     
              03 PIC  X(09)              VALUE 'RPCI BINN'.                     
              03 PIC  X(09)              VALUE 'RPCI EINN'.                     
              03 PIC  X(09)              VALUE 'RPCO BONN'.                     
              03 PIC  X(09)              VALUE 'RPCO EONN'.                     
              03 PIC  X(09)              VALUE 'RPFI BINN'.                     
              03 PIC  X(09)              VALUE 'RPFO BONN'.                     
              03 PIC  X(09)              VALUE 'RPMI BINN'.                     
              03 PIC  X(09)              VALUE 'RPMI EINN'.                     
              03 PIC  X(09)              VALUE 'RPMO BONN'.                     
              03 PIC  X(09)              VALUE 'RPMO EONN'.                     
              03 PIC  X(09)              VALUE 'RPNV EONN'.                     
              03 PIC  X(09)              VALUE 'RPOK BBYN'.                     
              03 PIC  X(09)              VALUE 'RPOK EBYN'.                     
              03 PIC  X(09)              VALUE 'RPOV EONN'.                     
              03 PIC  X(09)              VALUE 'RPTO BOYN'.                     
              03 PIC  X(09)              VALUE 'RPTO EOYN'.                     
              03 PIC  X(09)              VALUE 'RRTI BINN'.                     
              03 PIC  X(09)              VALUE 'RRTO BONN'.                     
              03 PIC  X(09)              VALUE 'RSNG EOYN'.                     
              03 PIC  X(09)              VALUE 'RSPT AINN'.                     
              03 PIC  X(09)              VALUE 'RTAC EONY'.                     
              03 PIC  X(09)              VALUE 'RTDS EONY'.                     
              03 PIC  X(09)              VALUE 'RTPI EINN'.                     
              03 PIC  X(09)              VALUE 'RTPO EONN'.                     
              03 PIC  X(09)              VALUE 'RTRI EOYN'.                     
              03 PIC  X(09)              VALUE 'RVTO BOYN'.                     
              03 PIC  X(09)              VALUE 'RVTO EOYN'.                     
              03 PIC  X(09)              VALUE 'RXGN EOYN'.                     
              03 PIC  X(09)              VALUE 'RXHI BINN'.                     
              03 PIC  X(09)              VALUE 'RXHO BONN'.                     
              03 PIC  X(09)              VALUE 'RXMN EBYN'.                     
              03 PIC  X(09)              VALUE 'RXRY BBNN'.                     
              03 PIC  X(09)              VALUE 'RXRY EBNN'.                     
              03 PIC  X(09)              VALUE 'SAC  BBNN'.                     
              03 PIC  X(09)              VALUE 'SAC  EBNN'.                     
              03 PIC  X(09)              VALUE 'SAC  WBNN'.                     
              03 PIC  X(09)              VALUE 'SBAC EONY'.                     
              03 PIC  X(09)              VALUE 'SBAM EOYN'.                     
              03 PIC  X(09)              VALUE 'SBDS EONY'.                     
              03 PIC  X(09)              VALUE 'SBLD EOYN'.                     
              03 PIC  X(09)              VALUE 'SBPR EOYN'.                     
              03 PIC  X(09)              VALUE 'SCON EOYN'.                     
              03 PIC  X(09)              VALUE 'SCSO EONY'.                     
              03 PIC  X(09)              VALUE 'SDMP EOYN'.                     
              03 PIC  X(09)              VALUE 'SEC  COYN'.                     
              03 PIC  X(09)              VALUE 'SEC  EOYN'.                     
              03 PIC  X(09)              VALUE 'SECF EOYN'.                     
              03 PIC  X(09)              VALUE 'SHVD DIYN'.                     
              03 PIC  X(09)              VALUE 'SICK CONY'.                     
              03 PIC  X(09)              VALUE 'SICK DONY'.                     
              03 PIC  X(09)              VALUE 'SICK EONY'.                     
              03 PIC  X(09)              VALUE 'SICK WONY'.                     
              03 PIC  X(09)              VALUE 'SIH  EOYN'.                     
              03 PIC  X(09)              VALUE 'SINJ EOYN'.                     
              03 PIC  X(09)              VALUE 'SLAB EOYN'.                     
              03 PIC  X(09)              VALUE 'SLED EONY'.                     
              03 PIC  X(09)              VALUE 'SLEN EONY'.                     
              03 PIC  X(09)              VALUE 'SMC  BBYN'.                     
              03 PIC  X(09)              VALUE 'SMC  EBYN'.                     
              03 PIC  X(09)              VALUE 'SMC  WBYN'.                     
              03 PIC  X(09)              VALUE 'SMIS CIYN'.                     
              03 PIC  X(09)              VALUE 'SMNI CINN'.                     
              03 PIC  X(09)              VALUE 'SMNO CONN'.                     
              03 PIC  X(09)              VALUE 'SMOK EONN'.                     
              03 PIC  X(09)              VALUE 'SMOK WONN'.                     
              03 PIC  X(09)              VALUE 'SMOS COYN'.                     
              03 PIC  X(09)              VALUE 'SMPT EOYN'.                     
              03 PIC  X(09)              VALUE 'SMRI EINN'.                     
              03 PIC  X(09)              VALUE 'SMRO EONN'.                     
              03 PIC  X(09)              VALUE 'SMS  EOYN'.                     
              03 PIC  X(09)              VALUE 'SMVI BINN'.                     
              03 PIC  X(09)              VALUE 'SMVO BONN'.                     
              03 PIC  X(09)              VALUE 'SOSI BINN'.                     
              03 PIC  X(09)              VALUE 'SOSI EINN'.                     
              03 PIC  X(09)              VALUE 'SOSO BONN'.                     
              03 PIC  X(09)              VALUE 'SOSO EONN'.                     
              03 PIC  X(09)              VALUE 'SPAP EOYN'.                     
              03 PIC  X(09)              VALUE 'SPRT EOYN'.                     
              03 PIC  X(09)              VALUE 'SPT  EOYN'.                     
              03 PIC  X(09)              VALUE 'SPTI BINN'.                     
              03 PIC  X(09)              VALUE 'SPTI EINN'.                     
              03 PIC  X(09)              VALUE 'SPTO BONN'.                     
              03 PIC  X(09)              VALUE 'SPTO EONN'.                     
              03 PIC  X(09)              VALUE 'SRGI CINN'.                     
              03 PIC  X(09)              VALUE 'SRGO CONN'.                     
              03 PIC  X(09)              VALUE 'SRIO EOYN'.                     
              03 PIC  X(09)              VALUE 'SRIS CIYN'.                     
              03 PIC  X(09)              VALUE 'SRO  CONN'.                     
              03 PIC  X(09)              VALUE 'SROS COYN'.                     
              03 PIC  X(09)              VALUE 'SRRX EOYN'.                     
              03 PIC  X(09)              VALUE 'SSCI BINN'.                     
              03 PIC  X(09)              VALUE 'SSCO BONN'.                     
              03 PIC  X(09)              VALUE 'SSTO BOYN'.                     
              03 PIC  X(09)              VALUE 'STAC EONY'.                     
              03 PIC  X(09)              VALUE 'STDS EONY'.                     
              03 PIC  X(09)              VALUE 'STI  BINN'.                     
              03 PIC  X(09)              VALUE 'STO  AONN'.                     
              03 PIC  X(09)              VALUE 'STRI WINN'.                     
              03 PIC  X(09)              VALUE 'STRO WONN'.                     
              03 PIC  X(09)              VALUE 'SVIS EOYN'.                     
              03 PIC  X(09)              VALUE 'SXRY EOYN'.                     
              03 PIC  X(09)              VALUE 'SXTI BINN'.                     
              03 PIC  X(09)              VALUE 'SXTI EINN'.                     
              03 PIC  X(09)              VALUE 'SXTO BONN'.                     
              03 PIC  X(09)              VALUE 'SXTO EONN'.                     
              03 PIC  X(09)              VALUE 'TABI CINN'.                     
              03 PIC  X(09)              VALUE 'TABI WINN'.                     
              03 PIC  X(09)              VALUE 'TABO CONN'.                     
              03 PIC  X(09)              VALUE 'TABO WONN'.                     
              03 PIC  X(09)              VALUE 'TAX  BBNN'.                     
              03 PIC  X(09)              VALUE 'TAX  EBNN'.                     
              03 PIC  X(09)              VALUE 'TBV  DINN'.                     
              03 PIC  X(09)              VALUE 'TINT EONY'.                     
              03 PIC  X(09)              VALUE 'TRAN BBNN'.                     
              03 PIC  X(09)              VALUE 'TRAN EBNN'.                     
              03 PIC  X(09)              VALUE 'VCPI EINN'.                     
              03 PIC  X(09)              VALUE 'VCPO EONN'.                     
              03 PIC  X(09)              VALUE 'VMIS EONY'.                     
              03 PIC  X(09)              VALUE 'VOCI BINN'.                     
              03 PIC  X(09)              VALUE 'VOCO BONN'.                     
              03 PIC  X(09)              VALUE 'VTCG EOYN'.                     
              03 PIC  X(09)              VALUE 'VTI  BINN'.                     
              03 PIC  X(09)              VALUE 'VTI  EINN'.                     
              03 PIC  X(09)              VALUE 'VTO  BONN'.                     
              03 PIC  X(09)              VALUE 'VTO  EONN'.                     
              03 PIC  X(09)              VALUE 'WBCO EBNN'.                     
              03 PIC  X(09)              VALUE 'WTI  BINN'.                     
              03 PIC  X(09)              VALUE 'WTI  EINN'.                     
              03 PIC  X(09)              VALUE 'WTO  BONN'.                     
              03 PIC  X(09)              VALUE 'WTO  EONN'.                     
              03 PIC  X(09)              VALUE 'XRYI BINN'.                     
              03 PIC  X(09)              VALUE 'XRYI EINN'.                     
              03 PIC  X(09)              VALUE 'XRYO BONN'.                     
              03 PIC  X(09)              VALUE 'XRYO EONN'.                     
                                                                                
           02 BPL-VL-TBL               REDEFINES BPL-VLS.                       
              03 BPL-TBL               OCCURS   752 TIMES                       
                                       ASCENDING KEY BPL-BP-ID                  
                                       INDEXED BY BPL-IDX                       
                                                  BPL-MAX-IDX.                  
                 04 BPL-BP-ID.                                                  
                    05 BPL-BP-PROVN             PIC  X(05).                     
                    05 BPL-PB-FORMAT            PIC  X(01).                     
                       88 BPL-INST-PROVN        VALUE 'A' 'B' 'W'.              
                       88 BPL-PROF-PROVN        VALUE 'C' 'D' 'E'.              
                 04 BPL-IP-OP-IND               PIC  X(01).                     
                    88 BPL-BOTH                 VALUE 'B'.                      
                    88 BPL-IP                   VALUE 'I'.                      
                    88 BPL-OP                   VALUE 'O'.                      
                 04 BPL-ALT-PROVN-IND           PIC  X(01).                     
                    88 BPL-ALT-PROVN            VALUE 'Y'.                      
                    88 BPL-NOT-ALT-PROVN        VALUE 'N'.                      
                 04 BPL-NON-STD-PROVN-IND       PIC  X(01).                     
                    88 BPL-NON-STD-PROVN        VALUE 'Y'.                      
                    88 BPL-STD-PROVN            VALUE 'N'.                      
