000100******************************************************************00010000
000200*                         COPYLIB Member                         *00020000
000300******************************************************************00030000
000400*                                                                *00040000
000500*    Member Name:   ELSCFTBA                                     *00050000
000600*    Member Title:  Benefit Period PMCI Confidence Factors       *00060000
000700*    Date Created:  20-Jan-1993                                  *00070000
000800*    Author:        Automated Procedure                          *00080000
000900*                                                                *00090000
001000*    Function:                                                   *00100000
001100*       This is the master list of all benefit periods available *00110000
001200*       through the Generic Contract files, with information     *00120000
001300*       pertinent to benefit-specific accumulators in PMCI       *00130000
001400*                                                                *00140000
001500******************************************************************00150000
001600*                                                                *00160000
001700*                       Maintenance History                      *00170000
001800*                                                                *00180000
001900*  Mod     Date      By               Action/Reason              *00190000
002000* ----- ----------- ---- --------------------------------------- *00200000
002100* 01.00 20-Jan-1993 AUTO Created.                                *00210000
002100* 02.00 19-oct-1993 bak  added support for emergency and office  *00211001
002200*                        visit 13071 phase 2.                    *00220001
002210*       26-Aug-1997 DAU  ADDED CONFIDENCE FACTORS AD, AE, AND 0Z *00221004
002300*                                                                 00230010
002210*       28-jul-2000 AKK  added confidence factors CB, CC, CD, CE, 00231010
002300*                        CF. Commented out CC-CF to determine if  00231110
002300*                        they are used.                           00231210
002300******************************************************************00232010
002400                                                                  00240000
002500 01  CFTA-CNFDNC-FCTRS.                                           00250000
002600     02 CFTA-NBR-ENTRS                   PIC S9(04)        COMP   00260000
002700                                         VALUE   +37.             00270013
002800     02 CFTA-VLS.                                                 00280000
002900        03 PIC  X(02)                VALUE 'AA'.                  00290000
003000        03 PIC  X(01)                VALUE '2'.                   00300000
003100        03 PIC  X(01)                VALUE SPACES.                00310000
003200        03                   COMP-1  VALUE  9.000000E-01.         00320000
003300        03                   COMP-1  VALUE  9.000000E-01.         00330000
003400        03                   COMP-1  VALUE  7.000000E-01.         00340000
003500        03                   COMP-1  VALUE  7.000000E-01.         00350000
003600        03                   COMP-1  VALUE  7.000000E-01.         00360000
007000        03                   COMP-1  VALUE -1.000000E+00.         00361001
007000        03                   COMP-1  VALUE -1.000000E+00.         00362001
003700                                                                  00370000
003800        03 PIC  X(02)                VALUE 'AB'.                  00380000
003900        03 PIC  X(01)                VALUE '8'.                   00390000
004000        03 PIC  X(01)                VALUE SPACES.                00400000
004100        03                   COMP-1  VALUE  7.000000E-01.         00410000
004200        03                   COMP-1  VALUE  7.000000E-01.         00420000
004300        03                   COMP-1  VALUE  7.000000E-01.         00430000
004400        03                   COMP-1  VALUE  7.000000E-01.         00440000
004500        03                   COMP-1  VALUE  7.000000E-01.         00450000
007000        03                   COMP-1  VALUE -1.000000E+00.         00451001
007000        03                   COMP-1  VALUE -1.000000E+00.         00452001
004600                                                                  00460000
004700        03 PIC  X(02)                VALUE 'AC'.                  00470000
004800        03 PIC  X(01)                VALUE '2'.                   00480000
004900        03 PIC  X(01)                VALUE SPACES.                00490000
005000        03                   COMP-1  VALUE  9.000000E-01.         00500000
005100        03                   COMP-1  VALUE  9.000000E-01.         00510000
005200        03                   COMP-1  VALUE  7.000000E-01.         00520000
005300        03                   COMP-1  VALUE  7.000000E-01.         00530000
005400        03                   COMP-1  VALUE  7.000000E-01.         00540000
007000        03                   COMP-1  VALUE -1.000000E+00.         00541001
007000        03                   COMP-1  VALUE -1.000000E+00.         00542001
005500                                                                  00550000
003800        03 PIC  X(02)                VALUE 'AD'.                  00551004
003900        03 PIC  X(01)                VALUE '9'.                   00552004
004000        03 PIC  X(01)                VALUE SPACES.                00553004
004100        03                   COMP-1  VALUE -1.000000E+00.         00554004
004200        03                   COMP-1  VALUE -1.000000E+00.         00555004
004300        03                   COMP-1  VALUE  5.000000E-01.         00556004
004400        03                   COMP-1  VALUE  9.000000E-01.         00557004
004500        03                   COMP-1  VALUE  9.000000E-01.         00558004
007000        03                   COMP-1  VALUE -1.000000E+00.         00559004
007000        03                   COMP-1  VALUE -1.000000E+00.         00559104
004600                                                                  00559204
004700        03 PIC  X(02)                VALUE 'AE'.                  00559304
004800        03 PIC  X(01)                VALUE '2'.                   00559404
004900        03 PIC  X(01)                VALUE SPACES.                00559504
005000        03                   COMP-1  VALUE  9.000000E-01.         00559604
005100        03                   COMP-1  VALUE -1.000000E+00.         00559704
005200        03                   COMP-1  VALUE -1.000000E+00.         00559804
005300        03                   COMP-1  VALUE  5.000000E-01.         00559904
005400        03                   COMP-1  VALUE  5.000000E-01.         00560004
007000        03                   COMP-1  VALUE -1.000000E+00.         00560104
007000        03                   COMP-1  VALUE -1.000000E+00.         00560204
005500                                                                  00560304
005600        03 PIC  X(02)                VALUE 'CA'.                  00563006
004800        03 PIC  X(01)                VALUE '2'.                   00564009
005700        03 PIC  X(01)                VALUE SPACES.                00570009
005800        03                   COMP-1  VALUE -1.000000E+00.         00580008
005900        03                   COMP-1  VALUE -1.000000E+00.         00590008
006000        03                   COMP-1  VALUE -1.000000E+00.         00600008
006100        03                   COMP-1  VALUE -1.000000E+00.         00610006
006200        03                   COMP-1  VALUE -1.000000E+00.         00620006
006300        03                   COMP-1  VALUE  1.000000E+00.         00630008
007000        03                   COMP-1  VALUE  1.000000E+00.         00631008
005500                                                                  00632010
005600        03 PIC  X(02)                VALUE 'CB'.                  00633010
004800        03 PIC  X(01)                VALUE '2'.                   00634010
005700        03 PIC  X(01)                VALUE SPACES.                00635010
005800        03                   COMP-1  VALUE -1.000000E+00.         00636010
005900        03                   COMP-1  VALUE -1.000000E+00.         00637010
006000        03                   COMP-1  VALUE -1.000000E+00.         00638010
006100        03                   COMP-1  VALUE -1.000000E+00.         00639010
006200        03                   COMP-1  VALUE -1.000000E+00.         00639110
006300        03                   COMP-1  VALUE  1.000000E+00.         00639210
007000        03                   COMP-1  VALUE  1.000000E+00.         00639310
006400                                                                  00640000
005600        03 PIC  X(02)                VALUE 'CC'.                  00640112
004800        03 PIC  X(01)                VALUE '2'.                   00640212
005700        03 PIC  X(01)                VALUE SPACES.                00640312
005800        03                   COMP-1  VALUE -1.000000E+00.         00640412
005900        03                   COMP-1  VALUE -1.000000E+00.         00640512
006000        03                   COMP-1  VALUE -1.000000E+00.         00640612
006100        03                   COMP-1  VALUE -1.000000E+00.         00640712
006200        03                   COMP-1  VALUE -1.000000E+00.         00640812
006300        03                   COMP-1  VALUE  1.000000E+00.         00640912
007000        03                   COMP-1  VALUE  1.000000E+00.         00641012
006400                                                                  00641110
005600        03 PIC  X(02)                VALUE 'CD'.                  00641212
004800        03 PIC  X(01)                VALUE '2'.                   00641312
005700        03 PIC  X(01)                VALUE SPACES.                00641412
005800        03                   COMP-1  VALUE -1.000000E+00.         00641512
005900        03                   COMP-1  VALUE -1.000000E+00.         00641612
006000        03                   COMP-1  VALUE -1.000000E+00.         00641712
006100        03                   COMP-1  VALUE -1.000000E+00.         00641812
006200        03                   COMP-1  VALUE -1.000000E+00.         00641912
006300        03                   COMP-1  VALUE  1.000000E+00.         00642012
007000        03                   COMP-1  VALUE  1.000000E+00.         00642112
006400                                                                  00642210
005600        03 PIC  X(02)                VALUE 'CE'.                  00642312
004800        03 PIC  X(01)                VALUE '2'.                   00642412
005700        03 PIC  X(01)                VALUE SPACES.                00642512
005800        03                   COMP-1  VALUE -1.000000E+00.         00642612
005900        03                   COMP-1  VALUE -1.000000E+00.         00642712
006000        03                   COMP-1  VALUE -1.000000E+00.         00642812
006100        03                   COMP-1  VALUE -1.000000E+00.         00642912
006200        03                   COMP-1  VALUE -1.000000E+00.         00643012
006300        03                   COMP-1  VALUE  1.000000E+00.         00643112
007000        03                   COMP-1  VALUE  1.000000E+00.         00643212
006400                                                                  00643310
005600        03 PIC  X(02)                VALUE 'CF'.                  00643412
004800        03 PIC  X(01)                VALUE '2'.                   00643512
005700        03 PIC  X(01)                VALUE SPACES.                00643612
005800        03                   COMP-1  VALUE -1.000000E+00.         00643712
005900        03                   COMP-1  VALUE -1.000000E+00.         00643812
006000        03                   COMP-1  VALUE -1.000000E+00.         00643912
006100        03                   COMP-1  VALUE -1.000000E+00.         00644012
006200        03                   COMP-1  VALUE -1.000000E+00.         00644112
006300        03                   COMP-1  VALUE  1.000000E+00.         00644212
007000        03                   COMP-1  VALUE  1.000000E+00.         00644312
006400                                                                  00644410
005600        03 PIC  X(02)                VALUE '0A'.                  00644510
005700        03 PIC  X(01)                VALUE '2'.                   00644610
005800        03 PIC  X(01)                VALUE SPACES.                00644710
005900        03                   COMP-1  VALUE  9.000000E-01.         00644810
006000        03                   COMP-1  VALUE  9.000000E-01.         00645006
006100        03                   COMP-1  VALUE  7.000000E-01.         00646006
006200        03                   COMP-1  VALUE  7.000000E-01.         00647006
006300        03                   COMP-1  VALUE  7.000000E-01.         00648006
007000        03                   COMP-1  VALUE -1.000000E+00.         00649006
007000        03                   COMP-1  VALUE -1.000000E+00.         00649106
006400                                                                  00649206
006500        03 PIC  X(02)                VALUE '0B'.                  00650000
006600        03 PIC  X(01)                VALUE '9'.                   00660000
006700        03 PIC  X(01)                VALUE SPACES.                00670000
006800        03                   COMP-1  VALUE  1.000000E-01.         00680000
006900        03                   COMP-1  VALUE  1.000000E-01.         00690000
007000        03                   COMP-1  VALUE -1.000000E+00.         00700000
007100        03                   COMP-1  VALUE  1.000000E-01.         00710000
007200        03                   COMP-1  VALUE  1.000000E-01.         00720000
007000        03                   COMP-1  VALUE -1.000000E+00.         00721001
007000        03                   COMP-1  VALUE -1.000000E+00.         00722001
007300                                                                  00730000
007400        03 PIC  X(02)                VALUE '0C'.                  00740000
007500        03 PIC  X(01)                VALUE 'C'.                   00750000
007600        03 PIC  X(01)                VALUE SPACES.                00760000
007700        03                   COMP-1  VALUE  7.000000E-01.         00770000
007800        03                   COMP-1  VALUE  7.000000E-01.         00780000
007900        03                   COMP-1  VALUE  7.000000E-01.         00790000
008000        03                   COMP-1  VALUE  7.000000E-01.         00800000
008100        03                   COMP-1  VALUE  7.000000E-01.         00810000
007000        03                   COMP-1  VALUE -1.000000E+00.         00811001
007000        03                   COMP-1  VALUE -1.000000E+00.         00812001
008200                                                                  00820000
008300        03 PIC  X(02)                VALUE '0D'.                  00830000
008400        03 PIC  X(01)                VALUE '8'.                   00840000
008500        03 PIC  X(01)                VALUE SPACES.                00850000
008600        03                   COMP-1  VALUE  7.000000E-01.         00860000
008700        03                   COMP-1  VALUE  7.000000E-01.         00870000
008800        03                   COMP-1  VALUE  7.000000E-01.         00880000
008900        03                   COMP-1  VALUE  7.000000E-01.         00890000
009000        03                   COMP-1  VALUE  7.000000E-01.         00900000
007000        03                   COMP-1  VALUE -1.000000E+00.         00901001
007000        03                   COMP-1  VALUE -1.000000E+00.         00902001
009100                                                                  00910000
009200        03 PIC  X(02)                VALUE '0E'.                  00920000
009300        03 PIC  X(01)                VALUE '8'.                   00930000
009400        03 PIC  X(01)                VALUE SPACES.                00940000
009500        03                   COMP-1  VALUE  7.000000E-01.         00950000
009600        03                   COMP-1  VALUE  7.000000E-01.         00960000
009700        03                   COMP-1  VALUE  7.000000E-01.         00970000
009800        03                   COMP-1  VALUE  7.000000E-01.         00980000
009900        03                   COMP-1  VALUE  7.000000E-01.         00990000
007000        03                   COMP-1  VALUE -1.000000E+00.         00991001
007000        03                   COMP-1  VALUE -1.000000E+00.         00992001
010000                                                                  01000000
010100        03 PIC  X(02)                VALUE '0F'.                  01010000
010200        03 PIC  X(01)                VALUE 'C'.                   01020000
010300        03 PIC  X(01)                VALUE SPACES.                01030000
010400        03                   COMP-1  VALUE  7.000000E-01.         01040000
010500        03                   COMP-1  VALUE  7.000000E-01.         01050000
010600        03                   COMP-1  VALUE  7.000000E-01.         01060000
010700        03                   COMP-1  VALUE  7.000000E-01.         01070000
010800        03                   COMP-1  VALUE  7.000000E-01.         01080000
007000        03                   COMP-1  VALUE -1.000000E+00.         01081001
007000        03                   COMP-1  VALUE -1.000000E+00.         01082001
010900                                                                  01090000
011000        03 PIC  X(02)                VALUE '0G'.                  01100000
011100        03 PIC  X(01)                VALUE 'C'.                   01110000
011200        03 PIC  X(01)                VALUE SPACES.                01120000
011300        03                   COMP-1  VALUE  3.000000E-01.         01130000
011400        03                   COMP-1  VALUE  3.000000E-01.         01140000
011500        03                   COMP-1  VALUE  3.000000E-01.         01150000
011600        03                   COMP-1  VALUE  3.000000E-01.         01160000
011700        03                   COMP-1  VALUE  3.000000E-01.         01170000
007000        03                   COMP-1  VALUE -1.000000E+00.         01171001
007000        03                   COMP-1  VALUE -1.000000E+00.         01172001
011800                                                                  01180000
011900        03 PIC  X(02)                VALUE '0H'.                  01190000
012000        03 PIC  X(01)                VALUE 'C'.                   01200000
012100        03 PIC  X(01)                VALUE SPACES.                01210000
012200        03                   COMP-1  VALUE  3.000000E-01.         01220000
012300        03                   COMP-1  VALUE  3.000000E-01.         01230000
012400        03                   COMP-1  VALUE  3.000000E-01.         01240000
012500        03                   COMP-1  VALUE  3.000000E-01.         01250000
012600        03                   COMP-1  VALUE  3.000000E-01.         01260000
007000        03                   COMP-1  VALUE -1.000000E+00.         01261001
007000        03                   COMP-1  VALUE -1.000000E+00.         01262001
012700                                                                  01270000
012800        03 PIC  X(02)                VALUE '0I'.                  01280000
012900        03 PIC  X(01)                VALUE '2'.                   01290000
013000        03 PIC  X(01)                VALUE SPACES.                01300000
013100        03                   COMP-1  VALUE  9.000000E-01.         01310000
013200        03                   COMP-1  VALUE  9.000000E-01.         01320000
013300        03                   COMP-1  VALUE  7.000000E-01.         01330000
013400        03                   COMP-1  VALUE  7.000000E-01.         01340000
013500        03                   COMP-1  VALUE  7.000000E-01.         01350000
007000        03                   COMP-1  VALUE  1.000000E+00.         01351003
007000        03                   COMP-1  VALUE  1.000000E+00.         01352003
013600                                                                  01360000
013700        03 PIC  X(02)                VALUE '0J'.                  01370000
013800        03 PIC  X(01)                VALUE 'C'.                   01380000
013900        03 PIC  X(01)                VALUE SPACES.                01390000
014000        03                   COMP-1  VALUE  9.000000E-01.         01400000
014100        03                   COMP-1  VALUE  9.000000E-01.         01410000
014200        03                   COMP-1  VALUE  7.000000E-01.         01420000
014300        03                   COMP-1  VALUE  7.000000E-01.         01430000
014400        03                   COMP-1  VALUE  7.000000E-01.         01440000
007000        03                   COMP-1  VALUE -1.000000E+00.         01441001
007000        03                   COMP-1  VALUE -1.000000E+00.         01442001
014500                                                                  01450000
014600        03 PIC  X(02)                VALUE '0K'.                  01460000
014700        03 PIC  X(01)                VALUE '7'.                   01470000
014800        03 PIC  X(01)                VALUE SPACES.                01480000
014900        03                   COMP-1  VALUE  3.000000E-01.         01490000
015000        03                   COMP-1  VALUE  5.000000E-01.         01500000
015100        03                   COMP-1  VALUE  3.000000E-01.         01510000
015200        03                   COMP-1  VALUE  3.000000E-01.         01520000
015300        03                   COMP-1  VALUE  3.000000E-01.         01530000
007000        03                   COMP-1  VALUE -1.000000E+00.         01531001
007000        03                   COMP-1  VALUE -1.000000E+00.         01532001
015400                                                                  01540000
015500        03 PIC  X(02)                VALUE '0L'.                  01550000
015600        03 PIC  X(01)                VALUE '8'.                   01560000
015700        03 PIC  X(01)                VALUE SPACES.                01570000
015800        03                   COMP-1  VALUE  7.000000E-01.         01580000
015900        03                   COMP-1  VALUE  7.000000E-01.         01590000
016000        03                   COMP-1  VALUE  7.000000E-01.         01600000
016100        03                   COMP-1  VALUE  7.000000E-01.         01610000
016200        03                   COMP-1  VALUE  7.000000E-01.         01620000
007000        03                   COMP-1  VALUE -1.000000E+00.         01621001
007000        03                   COMP-1  VALUE -1.000000E+00.         01622001
016300                                                                  01630000
016400        03 PIC  X(02)                VALUE '0M'.                  01640000
016500        03 PIC  X(01)                VALUE '3'.                   01650000
016600        03 PIC  X(01)                VALUE SPACES.                01660000
016700        03                   COMP-1  VALUE  9.000000E-01.         01670000
016800        03                   COMP-1  VALUE  9.000000E-01.         01680000
016900        03                   COMP-1  VALUE  7.000000E-01.         01690000
017000        03                   COMP-1  VALUE  7.000000E-01.         01700000
017100        03                   COMP-1  VALUE  7.000000E-01.         01710000
007000        03                   COMP-1  VALUE -1.000000E+00.         01711001
007000        03                   COMP-1  VALUE -1.000000E+00.         01712001
017200                                                                  01720000
017300        03 PIC  X(02)                VALUE '0N'.                  01730000
017400        03 PIC  X(01)                VALUE '6'.                   01740000
017500        03 PIC  X(01)                VALUE SPACES.                01750000
017600        03                   COMP-1  VALUE  1.000000E-01.         01760000
017700        03                   COMP-1  VALUE  1.000000E-01.         01770000
017800        03                   COMP-1  VALUE  1.000000E-01.         01780000
017900        03                   COMP-1  VALUE  1.000000E-01.         01790000
018000        03                   COMP-1  VALUE  1.000000E-01.         01800000
007000        03                   COMP-1  VALUE -1.000000E+00.         01801001
007000        03                   COMP-1  VALUE -1.000000E+00.         01802001
018100                                                                  01810000
018200        03 PIC  X(02)                VALUE '0P'.                  01820000
018300        03 PIC  X(01)                VALUE '8'.                   01830000
018400        03 PIC  X(01)                VALUE SPACES.                01840000
018500        03                   COMP-1  VALUE  9.000000E-01.         01850000
018600        03                   COMP-1  VALUE  9.000000E-01.         01860000
018700        03                   COMP-1  VALUE  7.000000E-01.         01870000
018800        03                   COMP-1  VALUE  7.000000E-01.         01880000
018900        03                   COMP-1  VALUE  7.000000E-01.         01890000
007000        03                   COMP-1  VALUE -1.000000E+00.         01891001
007000        03                   COMP-1  VALUE -1.000000E+00.         01892001
019000                                                                  01900000
019100        03 PIC  X(02)                VALUE '0Q'.                  01910000
019200        03 PIC  X(01)                VALUE 'C'.                   01920000
019300        03 PIC  X(01)                VALUE SPACES.                01930000
019400        03                   COMP-1  VALUE  1.000000E-01.         01940000
019500        03                   COMP-1  VALUE  1.000000E-01.         01950000
019600        03                   COMP-1  VALUE  1.000000E-01.         01960000
019700        03                   COMP-1  VALUE  1.000000E-01.         01970000
019800        03                   COMP-1  VALUE  1.000000E-01.         01980000
007000        03                   COMP-1  VALUE -1.000000E+00.         01981001
007000        03                   COMP-1  VALUE -1.000000E+00.         01982001
019900                                                                  01990000
020000        03 PIC  X(02)                VALUE '0R'.                  02000000
020100        03 PIC  X(01)                VALUE 'C'.                   02010000
020200        03 PIC  X(01)                VALUE SPACES.                02020000
020300        03                   COMP-1  VALUE  1.000000E-01.         02030000
020400        03                   COMP-1  VALUE  1.000000E-01.         02040000
020500        03                   COMP-1  VALUE  1.000000E-01.         02050000
020600        03                   COMP-1  VALUE  1.000000E-01.         02060000
020700        03                   COMP-1  VALUE  1.000000E-01.         02070000
007000        03                   COMP-1  VALUE -1.000000E+00.         02071001
007000        03                   COMP-1  VALUE -1.000000E+00.         02072001
020800                                                                  02080000
020900        03 PIC  X(02)                VALUE '0S'.                  02090000
021000        03 PIC  X(01)                VALUE 'C'.                   02100000
021100        03 PIC  X(01)                VALUE SPACES.                02110000
021200        03                   COMP-1  VALUE  1.000000E-01.         02120000
021300        03                   COMP-1  VALUE  1.000000E-01.         02130000
021400        03                   COMP-1  VALUE  1.000000E-01.         02140000
021500        03                   COMP-1  VALUE  1.000000E-01.         02150000
021600        03                   COMP-1  VALUE  1.000000E-01.         02160000
007000        03                   COMP-1  VALUE -1.000000E+00.         02161001
007000        03                   COMP-1  VALUE -1.000000E+00.         02162001
021700                                                                  02170000
021800        03 PIC  X(02)                VALUE '0T'.                  02180000
021900        03 PIC  X(01)                VALUE 'C'.                   02190000
022000        03 PIC  X(01)                VALUE SPACES.                02200000
022100        03                   COMP-1  VALUE  1.000000E-01.         02210000
022200        03                   COMP-1  VALUE  1.000000E-01.         02220000
022300        03                   COMP-1  VALUE  1.000000E-01.         02230000
022400        03                   COMP-1  VALUE  1.000000E-01.         02240000
022500        03                   COMP-1  VALUE  1.000000E-01.         02250000
007000        03                   COMP-1  VALUE -1.000000E+00.         02251001
007000        03                   COMP-1  VALUE -1.000000E+00.         02252001
022600                                                                  02260000
022700        03 PIC  X(02)                VALUE '0U'.                  02270000
022800        03 PIC  X(01)                VALUE 'C'.                   02280000
022900        03 PIC  X(01)                VALUE SPACES.                02290000
023000        03                   COMP-1  VALUE  3.000000E-01.         02300000
023100        03                   COMP-1  VALUE  3.000000E-01.         02310000
023200        03                   COMP-1  VALUE  3.000000E-01.         02320000
023300        03                   COMP-1  VALUE  3.000000E-01.         02330000
023400        03                   COMP-1  VALUE  3.000000E-01.         02340000
007000        03                   COMP-1  VALUE -1.000000E+00.         02341001
007000        03                   COMP-1  VALUE -1.000000E+00.         02342001
023500                                                                  02350000
023600        03 PIC  X(02)                VALUE '0V'.                  02360000
023700        03 PIC  X(01)                VALUE 'C'.                   02370000
023800        03 PIC  X(01)                VALUE SPACES.                02380000
023900        03                   COMP-1  VALUE  1.000000E-01.         02390000
024000        03                   COMP-1  VALUE  1.000000E-01.         02400000
024100        03                   COMP-1  VALUE  1.000000E-01.         02410000
024200        03                   COMP-1  VALUE  1.000000E-01.         02420000
024300        03                   COMP-1  VALUE  1.000000E-01.         02430000
007000        03                   COMP-1  VALUE -1.000000E+00.         02431001
007000        03                   COMP-1  VALUE -1.000000E+00.         02432001
024400                                                                  02440000
024500        03 PIC  X(02)                VALUE '0W'.                  02450000
024600        03 PIC  X(01)                VALUE 'C'.                   02460000
024700        03 PIC  X(01)                VALUE SPACES.                02470000
024800        03                   COMP-1  VALUE  1.000000E-01.         02480000
024900        03                   COMP-1  VALUE  1.000000E-01.         02490000
025000        03                   COMP-1  VALUE  1.000000E-01.         02500000
025100        03                   COMP-1  VALUE  1.000000E-01.         02510000
025200        03                   COMP-1  VALUE  1.000000E-01.         02520000
007000        03                   COMP-1  VALUE -1.000000E+00.         02521001
007000        03                   COMP-1  VALUE -1.000000E+00.         02522001
025300                                                                  02530000
025400        03 PIC  X(02)                VALUE '0X'.                  02540000
025500        03 PIC  X(01)                VALUE '7'.                   02550000
025600        03 PIC  X(01)                VALUE SPACES.                02560000
025700        03                   COMP-1  VALUE  3.000000E-01.         02570000
025800        03                   COMP-1  VALUE  5.000000E-01.         02580000
025900        03                   COMP-1  VALUE  3.000000E-01.         02590000
026000        03                   COMP-1  VALUE  3.000000E-01.         02600000
026100        03                   COMP-1  VALUE  3.000000E-01.         02610000
007000        03                   COMP-1  VALUE -1.000000E+00.         02611001
007000        03                   COMP-1  VALUE -1.000000E+00.         02612001
026200                                                                  02620000
026300        03 PIC  X(02)                VALUE '0Y'.                  02630000
026400        03 PIC  X(01)                VALUE '1'.                   02640000
026500        03 PIC  X(01)                VALUE SPACES.                02650000
026600        03                   COMP-1  VALUE -1.000000E+00.         02660000
026700        03                   COMP-1  VALUE  7.000000E-01.         02670000
026800        03                   COMP-1  VALUE  7.000000E-01.         02680000
026900        03                   COMP-1  VALUE  7.000000E-01.         02690000
027000        03                   COMP-1  VALUE  7.000000E-01.         02700000
007000        03                   COMP-1  VALUE -1.000000E+00.         02701001
007000        03                   COMP-1  VALUE -1.000000E+00.         02702001
027100                                                                  02710000
026300        03 PIC  X(02)                VALUE '0Z'.                  02711004
026400        03 PIC  X(01)                VALUE '9'.                   02712004
026500        03 PIC  X(01)                VALUE SPACES.                02713004
026600        03                   COMP-1  VALUE -1.000000E+00.         02714004
026700        03                   COMP-1  VALUE  5.000000E-01.         02715004
026800        03                   COMP-1  VALUE -1.000000E+00.         02716004
026900        03                   COMP-1  VALUE -1.000000E+00.         02717004
027000        03                   COMP-1  VALUE -1.000000E+00.         02718004
007000        03                   COMP-1  VALUE -1.000000E+00.         02719004
007000        03                   COMP-1  VALUE  5.000000E-01.         02719104
027100                                                                  02719204
027200        03 PIC  X(02)                VALUE '00'.                  02720000
027300        03 PIC  X(01)                VALUE 'C'.                   02730000
027400        03 PIC  X(01)                VALUE SPACES.                02740000
027500        03                   COMP-1  VALUE -1.000000E+00.         02750000
027600        03                   COMP-1  VALUE -1.000000E+00.         02760000
027700        03                   COMP-1  VALUE -1.000000E+00.         02770000
027800        03                   COMP-1  VALUE -1.000000E+00.         02780000
027900        03                   COMP-1  VALUE -1.000000E+00.         02790000
007000        03                   COMP-1  VALUE -1.000000E+00.         02791001
007000        03                   COMP-1  VALUE -1.000000E+00.         02792001
028000                                                                  02800000
028100     02 CFTA-VL-TBL              REDEFINES CFTA-VLS.              02810000
028200        03 CFTA-TBL                      OCCURS    37 TIMES       02820013
028300                                         INDEXED BY CFTA-IDX      02830000
028400                                                    CFTA-MAX-IDX. 02840000
028500           04 CFTA-BNFT-PRD              PIC  X(02).              02850000
028600           04 CFTA-PMCI-BNFT-PRD         PIC  X(01).              02860000
028700           04                            PIC  X(01).              02870000
028800           04 CFTA-CF-DRB                                  COMP-1.02880000
028900           04 CFTA-CF-PDN                                  COMP-1.02890000
029000           04 CFTA-CF-OTHR-MNTL                            COMP-1.02900000
029100           04 CFTA-CF-PSYCH                                COMP-1.02910000
029200           04 CFTA-CF-SB-ABS                               COMP-1.02920000
029200           04 CFTA-CF-EMRGNC                               COMP-1.02930002
029200           04 CFTA-CF-OFVST                                COMP-1.02940002
