000000******************************************************************        
000010*                                                                *        
000020*    TABLE 4                                                     *        
000030*    BENEFIT PROVISION CATEGORIZATION TABLE                      *        
000040*    INCLUDES PROVISION PLACES OF TREATMENT                      *        
000050*                                                                *        
000060******************************************************************        
000070                                                                          
000080 01  CFT4.                                                                
000090     02 CFT4-VALUES.                                                      
000100                                                                          
000110        03 FILLER     PICTURE  X(08)  VALUE 'ABUA WIâ'.                   
000120        03 FILLER     PICTURE  X(08)  VALUE 'ABUE WOâ'.                   
000130        03 FILLER     PICTURE  X(08)  VALUE 'ABUF AOâ'.                   
000140        03 FILLER     PICTURE  X(08)  VALUE 'ABUF WOâ'.                   
000150        03 FILLER     PICTURE  X(08)  VALUE 'ABUI AIâ'.                   
000160        03 FILLER     PICTURE  X(08)  VALUE 'ABUI WIâ'.                   
000170        03 FILLER     PICTURE  X(08)  VALUE 'ABUO AOâ'.                   
000180        03 FILLER     PICTURE  X(08)  VALUE 'ABUO WOâ'.                   
000190        03 FILLER     PICTURE  X(08)  VALUE 'ACAI CIâ'.                   
000200        03 FILLER     PICTURE  X(08)  VALUE 'ACAO COâ'.                   
000210        03 FILLER     PICTURE  X(08)  VALUE 'ACCO BBâ'.                   
000220        03 FILLER     PICTURE  X(08)  VALUE 'ACCO EBâ'.                   
000230        03 FILLER     PICTURE  X(08)  VALUE 'ACTI BIâ'.                   
000240        03 FILLER     PICTURE  X(08)  VALUE 'ACTI EIâ'.                   
000250        03 FILLER     PICTURE  X(08)  VALUE 'ACTO BOâ'.                   
000260        03 FILLER     PICTURE  X(08)  VALUE 'ACTO EOâ'.                   
000270        03 FILLER     PICTURE  X(08)  VALUE 'ADOC BBâ'.                   
000280        03 FILLER     PICTURE  X(08)  VALUE 'ADOC EBâ'.                   
000290        03 FILLER     PICTURE  X(08)  VALUE 'ADXA WIâ'.                   
000300        03 FILLER     PICTURE  X(08)  VALUE 'ADXF WOâ'.                   
000310        03 FILLER     PICTURE  X(08)  VALUE 'ADXI WIâ'.                   
000320        03 FILLER     PICTURE  X(08)  VALUE 'ADXO WOâ'.                   
000330        03 FILLER     PICTURE  X(08)  VALUE 'AHI  DIâ'.                   
000340        03 FILLER     PICTURE  X(08)  VALUE 'ALTI BIâ'.                   
000350        03 FILLER     PICTURE  X(08)  VALUE 'ALTI EIâ'.                   
000360        03 FILLER     PICTURE  X(08)  VALUE 'ALTO BOâ'.                   
000370        03 FILLER     PICTURE  X(08)  VALUE 'ALTO EOâ'.                   
000380        03 FILLER     PICTURE  X(08)  VALUE 'ALTW BOâ'.                   
000390        03 FILLER     PICTURE  X(08)  VALUE 'ALTW EOâ'.                   
000400        03 FILLER     PICTURE  X(08)  VALUE 'AMB  BBâ'.                   
000410        03 FILLER     PICTURE  X(08)  VALUE 'AMB  EBâ'.                   
000420        03 FILLER     PICTURE  X(08)  VALUE 'AMBM BBâ'.                   
000430        03 FILLER     PICTURE  X(08)  VALUE 'AMBM EBâ'.                   
000440        03 FILLER     PICTURE  X(08)  VALUE 'ANSI CIâ'.                   
000450        03 FILLER     PICTURE  X(08)  VALUE 'ANSL CBâ'.                   
000460        03 FILLER     PICTURE  X(08)  VALUE 'ANSO COâ'.                   
000470        03 FILLER     PICTURE  X(08)  VALUE 'APFI BIâ'.                   
000480        03 FILLER     PICTURE  X(08)  VALUE 'APFO BOâ'.                   
000490        03 FILLER     PICTURE  X(08)  VALUE 'ARPA WIâ'.                   
000500        03 FILLER     PICTURE  X(08)  VALUE 'ARPE WOâ'.                   
000510        03 FILLER     PICTURE  X(08)  VALUE 'ARPF WOâ'.                   
000520        03 FILLER     PICTURE  X(08)  VALUE 'ARPI WIâ'.                   
000530        03 FILLER     PICTURE  X(08)  VALUE 'ARPO WOâ'.                   
000540        03 FILLER     PICTURE  X(08)  VALUE 'ASEM CBâ'.                   
000550        03 FILLER     PICTURE  X(08)  VALUE 'ASOP EBâ'.                   
000560        03 FILLER     PICTURE  X(08)  VALUE 'ASSI CIâ'.                   
000570        03 FILLER     PICTURE  X(08)  VALUE 'ASSO COâ'.                   
000580        03 FILLER     PICTURE  X(08)  VALUE 'ATI  BIâ'.                   
000590        03 FILLER     PICTURE  X(08)  VALUE 'ATII EIâ'.                   
000600        03 FILLER     PICTURE  X(08)  VALUE 'ATO  BOâ'.                   
000610        03 FILLER     PICTURE  X(08)  VALUE 'ATO  EOâ'.                   
000620        03 FILLER     PICTURE  X(08)  VALUE 'ATOW BOâ'.                   
000630        03 FILLER     PICTURE  X(08)  VALUE 'ATOW EOâ'.                   
000640        03 FILLER     PICTURE  X(08)  VALUE 'ATSI EIâ'.                   
000650        03 FILLER     PICTURE  X(08)  VALUE 'AUTO CBâ'.                   
000660        03 FILLER     PICTURE  X(08)  VALUE 'BAMI BIâ'.                   
000670        03 FILLER     PICTURE  X(08)  VALUE 'BAMI EIâ'.                   
000680        03 FILLER     PICTURE  X(08)  VALUE 'BAMO BOâ'.                   
000690        03 FILLER     PICTURE  X(08)  VALUE 'BAMO EOâ'.                   
000700        03 FILLER     PICTURE  X(08)  VALUE 'BCHI BIâ'.                   
000710        03 FILLER     PICTURE  X(08)  VALUE 'BCHI EIâ'.                   
000720        03 FILLER     PICTURE  X(08)  VALUE 'BCHO BOâ'.                   
000730        03 FILLER     PICTURE  X(08)  VALUE 'BCHO EOâ'.                   
000740        03 FILLER     PICTURE  X(08)  VALUE 'BDRI BIâ'.                   
000750        03 FILLER     PICTURE  X(08)  VALUE 'BDRI EIâ'.                   
000760        03 FILLER     PICTURE  X(08)  VALUE 'BDRO BOâ'.                   
000770        03 FILLER     PICTURE  X(08)  VALUE 'BDRO EOâ'.                   
000780        03 FILLER     PICTURE  X(08)  VALUE 'BIOI BIâ'.                   
000790        03 FILLER     PICTURE  X(08)  VALUE 'BIOI EIâ'.                   
000800        03 FILLER     PICTURE  X(08)  VALUE 'BIOO BOâ'.                   
000810        03 FILLER     PICTURE  X(08)  VALUE 'BIOO EOâ'.                   
000820        03 FILLER     PICTURE  X(08)  VALUE 'BIRD CIâ'.                   
000830        03 FILLER     PICTURE  X(08)  VALUE 'BIRH WIâ'.                   
000840        03 FILLER     PICTURE  X(08)  VALUE 'BIRM CIâ'.                   
000850        03 FILLER     PICTURE  X(08)  VALUE 'BIRS CIâ'.                   
000860        03 FILLER     PICTURE  X(08)  VALUE 'BLCI BIâ'.                   
000870        03 FILLER     PICTURE  X(08)  VALUE 'BLCI EIâ'.                   
000880        03 FILLER     PICTURE  X(08)  VALUE 'BLCO BOâ'.                   
000890        03 FILLER     PICTURE  X(08)  VALUE 'BLCO EOâ'.                   
000900        03 FILLER     PICTURE  X(08)  VALUE 'BLDI BIâ'.                   
000910        03 FILLER     PICTURE  X(08)  VALUE 'BLDI EIâ'.                   
000920        03 FILLER     PICTURE  X(08)  VALUE 'BLDO BOâ'.                   
000930        03 FILLER     PICTURE  X(08)  VALUE 'BLDO EOâ'.                   
000940        03 FILLER     PICTURE  X(08)  VALUE 'BPRI BIâ'.                   
000950        03 FILLER     PICTURE  X(08)  VALUE 'BPRI EIâ'.                   
000960        03 FILLER     PICTURE  X(08)  VALUE 'BPRO BOâ'.                   
000970        03 FILLER     PICTURE  X(08)  VALUE 'BPRO EOâ'.                   
000980        03 FILLER     PICTURE  X(08)  VALUE 'BRCI BIâ'.                   
000990        03 FILLER     PICTURE  X(08)  VALUE 'BRCI EIâ'.                   
001000        03 FILLER     PICTURE  X(08)  VALUE 'BRCO BOâ'.                   
001010        03 FILLER     PICTURE  X(08)  VALUE 'BRCO EOâ'.                   
001020        03 FILLER     PICTURE  X(08)  VALUE 'BRRI EIâ'.                   
001030        03 FILLER     PICTURE  X(08)  VALUE 'BRRO EOâ'.                   
001040        03 FILLER     PICTURE  X(08)  VALUE 'BRTI EIâ'.                   
001050        03 FILLER     PICTURE  X(08)  VALUE 'BRTO EOâ'.                   
001060        03 FILLER     PICTURE  X(08)  VALUE 'BRXI EIâ'.                   
001070        03 FILLER     PICTURE  X(08)  VALUE 'BRXO EOâ'.                   
001080        03 FILLER     PICTURE  X(08)  VALUE 'BXTI EIâ'.                   
001090        03 FILLER     PICTURE  X(08)  VALUE 'BXTO EOâ'.                   
001100        03 FILLER     PICTURE  X(08)  VALUE 'CDIS CIâ'.                   
001110        03 FILLER     PICTURE  X(08)  VALUE 'CDMP EOâ'.                   
001120        03 FILLER     PICTURE  X(08)  VALUE 'CDOS COâ'.                   
001130        03 FILLER     PICTURE  X(08)  VALUE 'CDSI CIâ'.                   
001140        03 FILLER     PICTURE  X(08)  VALUE 'CDSO COâ'.                   
001150        03 FILLER     PICTURE  X(08)  VALUE 'CFOV EOâ'.                   
001160        03 FILLER     PICTURE  X(08)  VALUE 'CFTI BIâ'.                   
001170        03 FILLER     PICTURE  X(08)  VALUE 'CFTO BOâ'.                   
001180        03 FILLER     PICTURE  X(08)  VALUE 'CHC  WBâ'.                   
001190        03 FILLER     PICTURE  X(08)  VALUE 'CHCO EOâ'.                   
001200        03 FILLER     PICTURE  X(08)  VALUE 'CHCS WBâ'.                   
001210        03 FILLER     PICTURE  X(08)  VALUE 'CHCV DBâ'.                   
001220        03 FILLER     PICTURE  X(08)  VALUE 'CHEM WOâ'.                   
001230        03 FILLER     PICTURE  X(08)  VALUE 'CINJ EOâ'.                   
001240        03 FILLER     PICTURE  X(08)  VALUE 'CIRC BIâ'.                   
001250        03 FILLER     PICTURE  X(08)  VALUE 'CLAB EOâ'.                   
001260        03 FILLER     PICTURE  X(08)  VALUE 'CLED EOâ'.                   
001270        03 FILLER     PICTURE  X(08)  VALUE 'CLEM EOâ'.                   
001280        03 FILLER     PICTURE  X(08)  VALUE 'CLEN EOâ'.                   
001290        03 FILLER     PICTURE  X(08)  VALUE 'CLMD EOâ'.                   
001300        03 FILLER     PICTURE  X(08)  VALUE 'CMPT EOâ'.                   
001310        03 FILLER     PICTURE  X(08)  VALUE 'CMS  EOâ'.                   
001320        03 FILLER     PICTURE  X(08)  VALUE 'COIS CIâ'.                   
001330        03 FILLER     PICTURE  X(08)  VALUE 'CONI EIâ'.                   
001340        03 FILLER     PICTURE  X(08)  VALUE 'CONO EOâ'.                   
001350        03 FILLER     PICTURE  X(08)  VALUE 'COOS COâ'.                   
001360        03 FILLER     PICTURE  X(08)  VALUE 'COSI CIâ'.                   
001370        03 FILLER     PICTURE  X(08)  VALUE 'COSO COâ'.                   
001380        03 FILLER     PICTURE  X(08)  VALUE 'CPAP EOâ'.                   
001390        03 FILLER     PICTURE  X(08)  VALUE 'CPT  EOâ'.                   
001400        03 FILLER     PICTURE  X(08)  VALUE 'CRIO EOâ'.                   
001410        03 FILLER     PICTURE  X(08)  VALUE 'CRPI BIâ'.                   
001420        03 FILLER     PICTURE  X(08)  VALUE 'CRPO BOâ'.                   
001430        03 FILLER     PICTURE  X(08)  VALUE 'CSVI DIâ'.                   
001440        03 FILLER     PICTURE  X(08)  VALUE 'CSVO EOâ'.                   
001450        03 FILLER     PICTURE  X(08)  VALUE 'CVIS EOâ'.                   
001460        03 FILLER     PICTURE  X(08)  VALUE 'CXRY EOâ'.                   
001470        03 FILLER     PICTURE  X(08)  VALUE 'DDXA WIâ'.                   
001480        03 FILLER     PICTURE  X(08)  VALUE 'DDXF WOâ'.                   
001490        03 FILLER     PICTURE  X(08)  VALUE 'DDXI WIâ'.                   
001500        03 FILLER     PICTURE  X(08)  VALUE 'DDXO WOâ'.                   
001510        03 FILLER     PICTURE  X(08)  VALUE 'DEIS CIâ'.                   
001520        03 FILLER     PICTURE  X(08)  VALUE 'DENI CIâ'.                   
001530        03 FILLER     PICTURE  X(08)  VALUE 'DENO COâ'.                   
001540        03 FILLER     PICTURE  X(08)  VALUE 'DEOS COâ'.                   
001550        03 FILLER     PICTURE  X(08)  VALUE 'DIAI BIâ'.                   
001560        03 FILLER     PICTURE  X(08)  VALUE 'DIAI DIâ'.                   
001570        03 FILLER     PICTURE  X(08)  VALUE 'DIAO AOâ'.                   
001580        03 FILLER     PICTURE  X(08)  VALUE 'DIAO EOâ'.                   
001590        03 FILLER     PICTURE  X(08)  VALUE 'DIET EBâ'.                   
001600        03 FILLER     PICTURE  X(08)  VALUE 'DIET WBâ'.                   
001610        03 FILLER     PICTURE  X(08)  VALUE 'DMEI BIâ'.                   
001620        03 FILLER     PICTURE  X(08)  VALUE 'DMEI EIâ'.                   
001630        03 FILLER     PICTURE  X(08)  VALUE 'DMEO BOâ'.                   
001640        03 FILLER     PICTURE  X(08)  VALUE 'DMEO EOâ'.                   
001650        03 FILLER     PICTURE  X(08)  VALUE 'DMPI BIâ'.                   
001660        03 FILLER     PICTURE  X(08)  VALUE 'DMPI EIâ'.                   
001670        03 FILLER     PICTURE  X(08)  VALUE 'DMPO BOâ'.                   
001680        03 FILLER     PICTURE  X(08)  VALUE 'DMPO EOâ'.                   
001690        03 FILLER     PICTURE  X(08)  VALUE 'DMRI BIâ'.                   
001700        03 FILLER     PICTURE  X(08)  VALUE 'DMRI EIâ'.                   
001710        03 FILLER     PICTURE  X(08)  VALUE 'DMRO BOâ'.                   
001720        03 FILLER     PICTURE  X(08)  VALUE 'DMRO EOâ'.                   
001730        03 FILLER     PICTURE  X(08)  VALUE 'DPSY AIâ'.                   
001740        03 FILLER     PICTURE  X(08)  VALUE 'DPV  DIâ'.                   
001750        03 FILLER     PICTURE  X(08)  VALUE 'DRB  AIâ'.                   
001760        03 FILLER     PICTURE  X(08)  VALUE 'DRGI BIâ'.                   
001770        03 FILLER     PICTURE  X(08)  VALUE 'DRGI EIâ'.                   
001780        03 FILLER     PICTURE  X(08)  VALUE 'DRGO BOâ'.                   
001790        03 FILLER     PICTURE  X(08)  VALUE 'DRGO EOâ'.                   
001800        03 FILLER     PICTURE  X(08)  VALUE 'DRI  DIâ'.                   
001810        03 FILLER     PICTURE  X(08)  VALUE 'DRPA WIâ'.                   
001820        03 FILLER     PICTURE  X(08)  VALUE 'DRPE WOâ'.                   
001830        03 FILLER     PICTURE  X(08)  VALUE 'DRPF WOâ'.                   
001840        03 FILLER     PICTURE  X(08)  VALUE 'DRPI WIâ'.                   
001850        03 FILLER     PICTURE  X(08)  VALUE 'DRPO WOâ'.                   
001860        03 FILLER     PICTURE  X(08)  VALUE 'DRTI BIâ'.                   
001870        03 FILLER     PICTURE  X(08)  VALUE 'DRTI EIâ'.                   
001880        03 FILLER     PICTURE  X(08)  VALUE 'DRTO BOâ'.                   
001890        03 FILLER     PICTURE  X(08)  VALUE 'DRTO EOâ'.                   
001900        03 FILLER     PICTURE  X(08)  VALUE 'DTI  BIâ'.                   
001910        03 FILLER     PICTURE  X(08)  VALUE 'DTI  EIâ'.                   
001920        03 FILLER     PICTURE  X(08)  VALUE 'DTO  BOâ'.                   
001930        03 FILLER     PICTURE  X(08)  VALUE 'DTO  EOâ'.                   
001940        03 FILLER     PICTURE  X(08)  VALUE 'DTOX AIâ'.                   
001950        03 FILLER     PICTURE  X(08)  VALUE 'DXTI BIâ'.                   
001960        03 FILLER     PICTURE  X(08)  VALUE 'DXTI EIâ'.                   
001970        03 FILLER     PICTURE  X(08)  VALUE 'DXTO BOâ'.                   
001980        03 FILLER     PICTURE  X(08)  VALUE 'DXTO EOâ'.                   
001990        03 FILLER     PICTURE  X(08)  VALUE 'EABA BOâ'.                   
002000        03 FILLER     PICTURE  X(08)  VALUE 'EABA EOâ'.                   
002010        03 FILLER     PICTURE  X(08)  VALUE 'EABC BOâ'.                   
002020        03 FILLER     PICTURE  X(08)  VALUE 'EABC EOâ'.                   
002030        03 FILLER     PICTURE  X(08)  VALUE 'EABD BOâ'.                   
002040        03 FILLER     PICTURE  X(08)  VALUE 'EABD EOâ'.                   
002050        03 FILLER     PICTURE  X(08)  VALUE 'EABI CIâ'.                   
002060        03 FILLER     PICTURE  X(08)  VALUE 'EABI WIâ'.                   
002070        03 FILLER     PICTURE  X(08)  VALUE 'EABO COâ'.                   
002080        03 FILLER     PICTURE  X(08)  VALUE 'EABO WOâ'.                   
002090        03 FILLER     PICTURE  X(08)  VALUE 'EABP BOâ'.                   
002100        03 FILLER     PICTURE  X(08)  VALUE 'EABP EOâ'.                   
002110        03 FILLER     PICTURE  X(08)  VALUE 'EABR BOâ'.                   
002120        03 FILLER     PICTURE  X(08)  VALUE 'EABR EOâ'.                   
002130        03 FILLER     PICTURE  X(08)  VALUE 'EAC  EOâ'.                   
002140        03 FILLER     PICTURE  X(08)  VALUE 'EACF BOâ'.                   
002150        03 FILLER     PICTURE  X(08)  VALUE 'EACF EOâ'.                   
002160        03 FILLER     PICTURE  X(08)  VALUE 'EACI EOâ'.                   
002170        03 FILLER     PICTURE  X(08)  VALUE 'EACX BOâ'.                   
002180        03 FILLER     PICTURE  X(08)  VALUE 'EADM BOâ'.                   
002190        03 FILLER     PICTURE  X(08)  VALUE 'EAER BOâ'.                   
002200        03 FILLER     PICTURE  X(08)  VALUE 'EAHM BOâ'.                   
002210        03 FILLER     PICTURE  X(08)  VALUE 'EAIH BOâ'.                   
002220        03 FILLER     PICTURE  X(08)  VALUE 'EAIH EOâ'.                   
002230        03 FILLER     PICTURE  X(08)  VALUE 'EAL  BOâ'.                   
002240        03 FILLER     PICTURE  X(08)  VALUE 'EAL  EOâ'.                   
002250        03 FILLER     PICTURE  X(08)  VALUE 'EAMP BOâ'.                   
002260        03 FILLER     PICTURE  X(08)  VALUE 'EAMP EOâ'.                   
002270        03 FILLER     PICTURE  X(08)  VALUE 'EAMS BOâ'.                   
002280        03 FILLER     PICTURE  X(08)  VALUE 'EAMS EOâ'.                   
002290        03 FILLER     PICTURE  X(08)  VALUE 'EAMV BOâ'.                   
002300        03 FILLER     PICTURE  X(08)  VALUE 'EAPL BOâ'.                   
002310        03 FILLER     PICTURE  X(08)  VALUE 'EAPL EOâ'.                   
002320        03 FILLER     PICTURE  X(08)  VALUE 'EAPT EOâ'.                   
002330        03 FILLER     PICTURE  X(08)  VALUE 'EARI BOâ'.                   
002340        03 FILLER     PICTURE  X(08)  VALUE 'EARI EOâ'.                   
002350        03 FILLER     PICTURE  X(08)  VALUE 'EARX BOâ'.                   
002360        03 FILLER     PICTURE  X(08)  VALUE 'EARX EOâ'.                   
002370        03 FILLER     PICTURE  X(08)  VALUE 'EASS BOâ'.                   
002380        03 FILLER     PICTURE  X(08)  VALUE 'EAX  BOâ'.                   
002390        03 FILLER     PICTURE  X(08)  VALUE 'EAX  EOâ'.                   
002400        03 FILLER     PICTURE  X(08)  VALUE 'ECFA DIâ'.                   
002410        03 FILLER     PICTURE  X(08)  VALUE 'ECFD DIâ'.                   
002420        03 FILLER     PICTURE  X(08)  VALUE 'ECFM DIâ'.                   
002430        03 FILLER     PICTURE  X(08)  VALUE 'ECFT DIâ'.                   
002440        03 FILLER     PICTURE  X(08)  VALUE 'ECFV DIâ'.                   
002450        03 FILLER     PICTURE  X(08)  VALUE 'EHV  DIâ'.                   
002460        03 FILLER     PICTURE  X(08)  VALUE 'EMBA BOâ'.                   
002470        03 FILLER     PICTURE  X(08)  VALUE 'EMBA EOâ'.                   
002480        03 FILLER     PICTURE  X(08)  VALUE 'EMBC BOâ'.                   
002490        03 FILLER     PICTURE  X(08)  VALUE 'EMBC EOâ'.                   
002500        03 FILLER     PICTURE  X(08)  VALUE 'EMBD BOâ'.                   
002510        03 FILLER     PICTURE  X(08)  VALUE 'EMBD EOâ'.                   
002520        03 FILLER     PICTURE  X(08)  VALUE 'EMBP BOâ'.                   
002530        03 FILLER     PICTURE  X(08)  VALUE 'EMBP EOâ'.                   
002540        03 FILLER     PICTURE  X(08)  VALUE 'EMBR BOâ'.                   
002550        03 FILLER     PICTURE  X(08)  VALUE 'EMBR EOâ'.                   
002560        03 FILLER     PICTURE  X(08)  VALUE 'EMC  EOâ'.                   
002570        03 FILLER     PICTURE  X(08)  VALUE 'EMCI EOâ'.                   
002580        03 FILLER     PICTURE  X(08)  VALUE 'EMCX BOâ'.                   
002590        03 FILLER     PICTURE  X(08)  VALUE 'EMER BOâ'.                   
002600        03 FILLER     PICTURE  X(08)  VALUE 'EMHM BOâ'.                   
002610        03 FILLER     PICTURE  X(08)  VALUE 'EMIH BOâ'.                   
002620        03 FILLER     PICTURE  X(08)  VALUE 'EMIH EOâ'.                   
002630        03 FILLER     PICTURE  X(08)  VALUE 'EML  BOâ'.                   
002640        03 FILLER     PICTURE  X(08)  VALUE 'EML  EOâ'.                   
002650        03 FILLER     PICTURE  X(08)  VALUE 'EMMP BOâ'.                   
002660        03 FILLER     PICTURE  X(08)  VALUE 'EMMP EOâ'.                   
002670        03 FILLER     PICTURE  X(08)  VALUE 'EMMS BOâ'.                   
002680        03 FILLER     PICTURE  X(08)  VALUE 'EMMS EOâ'.                   
002690        03 FILLER     PICTURE  X(08)  VALUE 'EMMV BOâ'.                   
002700        03 FILLER     PICTURE  X(08)  VALUE 'EMPL BOâ'.                   
002710        03 FILLER     PICTURE  X(08)  VALUE 'EMPL EOâ'.                   
002720        03 FILLER     PICTURE  X(08)  VALUE 'EMPT EOâ'.                   
002730        03 FILLER     PICTURE  X(08)  VALUE 'EMRI BOâ'.                   
002740        03 FILLER     PICTURE  X(08)  VALUE 'EMRI EOâ'.                   
002750        03 FILLER     PICTURE  X(08)  VALUE 'EMRX BOâ'.                   
002760        03 FILLER     PICTURE  X(08)  VALUE 'EMRX EOâ'.                   
002770        03 FILLER     PICTURE  X(08)  VALUE 'EMSS BOâ'.                   
002780        03 FILLER     PICTURE  X(08)  VALUE 'EMX  BOâ'.                   
002790        03 FILLER     PICTURE  X(08)  VALUE 'EMX  EOâ'.                   
002800        03 FILLER     PICTURE  X(08)  VALUE 'ERIS CIâ'.                   
002810        03 FILLER     PICTURE  X(08)  VALUE 'EROS COâ'.                   
002820        03 FILLER     PICTURE  X(08)  VALUE 'ERSI BIâ'.                   
002830        03 FILLER     PICTURE  X(08)  VALUE 'ERSO BOâ'.                   
002840        03 FILLER     PICTURE  X(08)  VALUE 'ESI  CIâ'.                   
002850        03 FILLER     PICTURE  X(08)  VALUE 'ESIS CIâ'.                   
002860        03 FILLER     PICTURE  X(08)  VALUE 'ESO  COâ'.                   
002870        03 FILLER     PICTURE  X(08)  VALUE 'ESOS COâ'.                   
002880        03 FILLER     PICTURE  X(08)  VALUE 'ESRI CIâ'.                   
002890        03 FILLER     PICTURE  X(08)  VALUE 'ESRI WIâ'.                   
002900        03 FILLER     PICTURE  X(08)  VALUE 'ESRO COâ'.                   
002910        03 FILLER     PICTURE  X(08)  VALUE 'ESRO WOâ'.                   
002920        03 FILLER     PICTURE  X(08)  VALUE 'ESTI EIâ'.                   
002930        03 FILLER     PICTURE  X(08)  VALUE 'ESTO EOâ'.                   
002940        03 FILLER     PICTURE  X(08)  VALUE 'ETAI CIâ'.                   
002950        03 FILLER     PICTURE  X(08)  VALUE 'ETAO COâ'.                   
002960        03 FILLER     PICTURE  X(08)  VALUE 'EXPI BIâ'.                   
002970        03 FILLER     PICTURE  X(08)  VALUE 'EXPO BOâ'.                   
002980        03 FILLER     PICTURE  X(08)  VALUE 'FCAI BIâ'.                   
002990        03 FILLER     PICTURE  X(08)  VALUE 'FCAI DIâ'.                   
003000        03 FILLER     PICTURE  X(08)  VALUE 'FCAO BOâ'.                   
003010        03 FILLER     PICTURE  X(08)  VALUE 'FCAO EOâ'.                   
003020        03 FILLER     PICTURE  X(08)  VALUE 'FCCI BIâ'.                   
003030        03 FILLER     PICTURE  X(08)  VALUE 'FCCI DIâ'.                   
003040        03 FILLER     PICTURE  X(08)  VALUE 'FCCO BOâ'.                   
003050        03 FILLER     PICTURE  X(08)  VALUE 'FCCO EOâ'.                   
003060        03 FILLER     PICTURE  X(08)  VALUE 'FHI  BIâ'.                   
003070        03 FILLER     PICTURE  X(08)  VALUE 'FHI  DIâ'.                   
003080        03 FILLER     PICTURE  X(08)  VALUE 'FHO  BOâ'.                   
003090        03 FILLER     PICTURE  X(08)  VALUE 'FHO  EOâ'.                   
003100        03 FILLER     PICTURE  X(08)  VALUE 'FOTI BIâ'.                   
003110        03 FILLER     PICTURE  X(08)  VALUE 'FOTI EIâ'.                   
003120        03 FILLER     PICTURE  X(08)  VALUE 'FOTO BOâ'.                   
003130        03 FILLER     PICTURE  X(08)  VALUE 'FOTO EOâ'.                   
003140        03 FILLER     PICTURE  X(08)  VALUE 'FPO  BOâ'.                   
003150        03 FILLER     PICTURE  X(08)  VALUE 'FPO  EOâ'.                   
003160        03 FILLER     PICTURE  X(08)  VALUE 'FRAA EOâ'.                   
003170        03 FILLER     PICTURE  X(08)  VALUE 'FRAD EOâ'.                   
003180        03 FILLER     PICTURE  X(08)  VALUE 'FRAM EOâ'.                   
003190        03 FILLER     PICTURE  X(08)  VALUE 'FRAR EOâ'.                   
003200        03 FILLER     PICTURE  X(08)  VALUE 'GPI  BIâ'.                   
003210        03 FILLER     PICTURE  X(08)  VALUE 'GPI  DIâ'.                   
003220        03 FILLER     PICTURE  X(08)  VALUE 'GPO  BOâ'.                   
003230        03 FILLER     PICTURE  X(08)  VALUE 'GPO  EOâ'.                   
003240        03 FILLER     PICTURE  X(08)  VALUE 'GREF BBâ'.                   
003250        03 FILLER     PICTURE  X(08)  VALUE 'GREF EBâ'.                   
003260        03 FILLER     PICTURE  X(08)  VALUE 'HAAC EOâ'.                   
003270        03 FILLER     PICTURE  X(08)  VALUE 'HADF EOâ'.                   
003280        03 FILLER     PICTURE  X(08)  VALUE 'HAEV EOâ'.                   
003290        03 FILLER     PICTURE  X(08)  VALUE 'HAID BOâ'.                   
003300        03 FILLER     PICTURE  X(08)  VALUE 'HAID EOâ'.                   
003310        03 FILLER     PICTURE  X(08)  VALUE 'HCPI EIâ'.                   
003320        03 FILLER     PICTURE  X(08)  VALUE 'HCPM BBâ'.                   
003330        03 FILLER     PICTURE  X(08)  VALUE 'HCPM EBâ'.                   
003340        03 FILLER     PICTURE  X(08)  VALUE 'HCPO EOâ'.                   
003350        03 FILLER     PICTURE  X(08)  VALUE 'HEAR EOâ'.                   
003360        03 FILLER     PICTURE  X(08)  VALUE 'HECO EOâ'.                   
003370        03 FILLER     PICTURE  X(08)  VALUE 'HHP  BOâ'.                   
003380        03 FILLER     PICTURE  X(08)  VALUE 'HHP  EOâ'.                   
003390        03 FILLER     PICTURE  X(08)  VALUE 'HHRX BOâ'.                   
003400        03 FILLER     PICTURE  X(08)  VALUE 'HHV  DOâ'.                   
003410        03 FILLER     PICTURE  X(08)  VALUE 'HMI  BIâ'.                   
003420        03 FILLER     PICTURE  X(08)  VALUE 'HMO  BOâ'.                   
003430        03 FILLER     PICTURE  X(08)  VALUE 'HOSP WBâ'.                   
003440        03 FILLER     PICTURE  X(08)  VALUE 'HTEI BIâ'.                   
003450        03 FILLER     PICTURE  X(08)  VALUE 'HTEI EIâ'.                   
003460        03 FILLER     PICTURE  X(08)  VALUE 'HTEO BOâ'.                   
003470        03 FILLER     PICTURE  X(08)  VALUE 'HTEO EOâ'.                   
003480        03 FILLER     PICTURE  X(08)  VALUE 'HTI  BIâ'.                   
003490        03 FILLER     PICTURE  X(08)  VALUE 'HTI  EIâ'.                   
003500        03 FILLER     PICTURE  X(08)  VALUE 'HTO  BOâ'.                   
003510        03 FILLER     PICTURE  X(08)  VALUE 'HTO  EOâ'.                   
003520        03 FILLER     PICTURE  X(08)  VALUE 'HVD  DIâ'.                   
003530        03 FILLER     PICTURE  X(08)  VALUE 'HVIS EOâ'.                   
003540        03 FILLER     PICTURE  X(08)  VALUE 'HVO  EOâ'.                   
003550        03 FILLER     PICTURE  X(08)  VALUE 'HYPI BIâ'.                   
003560        03 FILLER     PICTURE  X(08)  VALUE 'HYPI DIâ'.                   
003570        03 FILLER     PICTURE  X(08)  VALUE 'HYPO BOâ'.                   
003580        03 FILLER     PICTURE  X(08)  VALUE 'HYPO EOâ'.                   
003590        03 FILLER     PICTURE  X(08)  VALUE 'ICUN AIâ'.                   
003600        03 FILLER     PICTURE  X(08)  VALUE 'ICUR AIâ'.                   
003610        03 FILLER     PICTURE  X(08)  VALUE 'ICUR BIâ'.                   
003620        03 FILLER     PICTURE  X(08)  VALUE 'ICV  DIâ'.                   
003630        03 FILLER     PICTURE  X(08)  VALUE 'IHI  BIâ'.                   
003640        03 FILLER     PICTURE  X(08)  VALUE 'IHI  EIâ'.                   
003650        03 FILLER     PICTURE  X(08)  VALUE 'IHO  BOâ'.                   
003660        03 FILLER     PICTURE  X(08)  VALUE 'IHO  EOâ'.                   
003670        03 FILLER     PICTURE  X(08)  VALUE 'IHV  DIâ'.                   
003680        03 FILLER     PICTURE  X(08)  VALUE 'IMM  BOâ'.                   
003690        03 FILLER     PICTURE  X(08)  VALUE 'IMM  EOâ'.                   
003700        03 FILLER     PICTURE  X(08)  VALUE 'INJ  EBâ'.                   
003710        03 FILLER     PICTURE  X(08)  VALUE 'INVI CBâ'.                   
003720        03 FILLER     PICTURE  X(08)  VALUE 'IPI  BIâ'.                   
003730        03 FILLER     PICTURE  X(08)  VALUE 'IPI  DIâ'.                   
003740        03 FILLER     PICTURE  X(08)  VALUE 'IPO  BOâ'.                   
003750        03 FILLER     PICTURE  X(08)  VALUE 'IPO  EOâ'.                   
003760        03 FILLER     PICTURE  X(08)  VALUE 'ISII BIâ'.                   
003770        03 FILLER     PICTURE  X(08)  VALUE 'ISII EIâ'.                   
003780        03 FILLER     PICTURE  X(08)  VALUE 'ISIO BOâ'.                   
003790        03 FILLER     PICTURE  X(08)  VALUE 'ISIO EOâ'.                   
003800        03 FILLER     PICTURE  X(08)  VALUE 'ISTI EIâ'.                   
003810        03 FILLER     PICTURE  X(08)  VALUE 'ISTO EOâ'.                   
003820        03 FILLER     PICTURE  X(08)  VALUE 'JUNK BBâ'.                   
003830        03 FILLER     PICTURE  X(08)  VALUE 'KITI BIâ'.                   
003840        03 FILLER     PICTURE  X(08)  VALUE 'KITO BOâ'.                   
003850        03 FILLER     PICTURE  X(08)  VALUE 'LABI BIâ'.                   
003860        03 FILLER     PICTURE  X(08)  VALUE 'LABI EIâ'.                   
003870        03 FILLER     PICTURE  X(08)  VALUE 'LABO BOâ'.                   
003880        03 FILLER     PICTURE  X(08)  VALUE 'LABO EOâ'.                   
003890        03 FILLER     PICTURE  X(08)  VALUE 'LBIF EOâ'.                   
003900        03 FILLER     PICTURE  X(08)  VALUE 'LCNT EOâ'.                   
003910        03 FILLER     PICTURE  X(08)  VALUE 'LENT EOâ'.                   
003920        03 FILLER     PICTURE  X(08)  VALUE 'LSNG EOâ'.                   
003930        03 FILLER     PICTURE  X(08)  VALUE 'LTRI EOâ'.                   
003940        03 FILLER     PICTURE  X(08)  VALUE 'MAJA EBâ'.                   
003950        03 FILLER     PICTURE  X(08)  VALUE 'MAJB EBâ'.                   
003960        03 FILLER     PICTURE  X(08)  VALUE 'MAJC EBâ'.                   
003970        03 FILLER     PICTURE  X(08)  VALUE 'MAJD EBâ'.                   
003980        03 FILLER     PICTURE  X(08)  VALUE 'MAJE EBâ'.                   
003990        03 FILLER     PICTURE  X(08)  VALUE 'MAJF EOâ'.                   
004000        03 FILLER     PICTURE  X(08)  VALUE 'MAJG EOâ'.                   
004010        03 FILLER     PICTURE  X(08)  VALUE 'MAJH EBâ'.                   
004020        03 FILLER     PICTURE  X(08)  VALUE 'MAJI EBâ'.                   
004030        03 FILLER     PICTURE  X(08)  VALUE 'MAJJ EBâ'.                   
004040        03 FILLER     PICTURE  X(08)  VALUE 'MAJK EBâ'.                   
004050        03 FILLER     PICTURE  X(08)  VALUE 'MAJL E-â'.                   
004060        03 FILLER     PICTURE  X(08)  VALUE 'MAJM EBâ'.                   
004070        03 FILLER     PICTURE  X(08)  VALUE 'MASO EBâ'.                   
004080        03 FILLER     PICTURE  X(08)  VALUE 'MBD  WIâ'.                   
004090        03 FILLER     PICTURE  X(08)  VALUE 'MBM  WIâ'.                   
004100        03 FILLER     PICTURE  X(08)  VALUE 'MBS  WIâ'.                   
004110        03 FILLER     PICTURE  X(08)  VALUE 'MCHI BIâ'.                   
004120        03 FILLER     PICTURE  X(08)  VALUE 'MCHI EIâ'.                   
004130        03 FILLER     PICTURE  X(08)  VALUE 'MCHO BOâ'.                   
004140        03 FILLER     PICTURE  X(08)  VALUE 'MCHO EOâ'.                   
004150        03 FILLER     PICTURE  X(08)  VALUE 'MCOI AIâ'.                   
004160        03 FILLER     PICTURE  X(08)  VALUE 'MDED AIâ'.                   
004170        03 FILLER     PICTURE  X(08)  VALUE 'MDRI EIâ'.                   
004180        03 FILLER     PICTURE  X(08)  VALUE 'MDRO EOâ'.                   
004190        03 FILLER     PICTURE  X(08)  VALUE 'MGSD AIâ'.                   
004200        03 FILLER     PICTURE  X(08)  VALUE 'MLTR ABâ'.                   
004210        03 FILLER     PICTURE  X(08)  VALUE 'MMI  EIâ'.                   
004220        03 FILLER     PICTURE  X(08)  VALUE 'MMO  EOâ'.                   
004230        03 FILLER     PICTURE  X(08)  VALUE 'MNI  DIâ'.                   
004240        03 FILLER     PICTURE  X(08)  VALUE 'MPTI DIâ'.                   
004250        03 FILLER     PICTURE  X(08)  VALUE 'MPTO EOâ'.                   
004260        03 FILLER     PICTURE  X(08)  VALUE 'MRTI EIâ'.                   
004270        03 FILLER     PICTURE  X(08)  VALUE 'MRTO EOâ'.                   
004280        03 FILLER     PICTURE  X(08)  VALUE 'MRXI EIâ'.                   
004290        03 FILLER     PICTURE  X(08)  VALUE 'MRXO EOâ'.                   
004300        03 FILLER     PICTURE  X(08)  VALUE 'MSHI BIâ'.                   
004310        03 FILLER     PICTURE  X(08)  VALUE 'MSHO BOâ'.                   
004320        03 FILLER     PICTURE  X(08)  VALUE 'MSSI BIâ'.                   
004330        03 FILLER     PICTURE  X(08)  VALUE 'MSSI EIâ'.                   
004340        03 FILLER     PICTURE  X(08)  VALUE 'MSSO BOâ'.                   
004350        03 FILLER     PICTURE  X(08)  VALUE 'MSSO EOâ'.                   
004360        03 FILLER     PICTURE  X(08)  VALUE 'NCBI EOâ'.                   
004370        03 FILLER     PICTURE  X(08)  VALUE 'NCRC CBâ'.                   
004380        03 FILLER     PICTURE  X(08)  VALUE 'NHV  DIâ'.                   
004390        03 FILLER     PICTURE  X(08)  VALUE 'NNBC EIâ'.                   
004400        03 FILLER     PICTURE  X(08)  VALUE 'NPSY AIâ'.                   
004410        03 FILLER     PICTURE  X(08)  VALUE 'NPV  DIâ'.                   
004420        03 FILLER     PICTURE  X(08)  VALUE 'NRB  AIâ'.                   
004430        03 FILLER     PICTURE  X(08)  VALUE 'NRSI BIâ'.                   
004440        03 FILLER     PICTURE  X(08)  VALUE 'NRSI EIâ'.                   
004450        03 FILLER     PICTURE  X(08)  VALUE 'NRSO BOâ'.                   
004460        03 FILLER     PICTURE  X(08)  VALUE 'NRSO EOâ'.                   
004470        03 FILLER     PICTURE  X(08)  VALUE 'OBCD CBâ'.                   
004480        03 FILLER     PICTURE  X(08)  VALUE 'OBCD WBâ'.                   
004490        03 FILLER     PICTURE  X(08)  VALUE 'OBCM CBâ'.                   
004500        03 FILLER     PICTURE  X(08)  VALUE 'OBCM WBâ'.                   
004510        03 FILLER     PICTURE  X(08)  VALUE 'OBCS CBâ'.                   
004520        03 FILLER     PICTURE  X(08)  VALUE 'OBCS WBâ'.                   
004530        03 FILLER     PICTURE  X(08)  VALUE 'OBND CBâ'.                   
004540        03 FILLER     PICTURE  X(08)  VALUE 'OBND WBâ'.                   
004550        03 FILLER     PICTURE  X(08)  VALUE 'OBNM CBâ'.                   
004560        03 FILLER     PICTURE  X(08)  VALUE 'OBNM WBâ'.                   
004570        03 FILLER     PICTURE  X(08)  VALUE 'OBNS CBâ'.                   
004580        03 FILLER     PICTURE  X(08)  VALUE 'OBNS WBâ'.                   
004590        03 FILLER     PICTURE  X(08)  VALUE 'OPDR WOâ'.                   
004600        03 FILLER     PICTURE  X(08)  VALUE 'OPSG BOâ'.                   
004610        03 FILLER     PICTURE  X(08)  VALUE 'OPSG WOâ'.                   
004620        03 FILLER     PICTURE  X(08)  VALUE 'ORGI CIâ'.                   
004630        03 FILLER     PICTURE  X(08)  VALUE 'ORGI WIâ'.                   
004640        03 FILLER     PICTURE  X(08)  VALUE 'ORGO BOâ'.                   
004650        03 FILLER     PICTURE  X(08)  VALUE 'ORGO COâ'.                   
004660        03 FILLER     PICTURE  X(08)  VALUE 'ORGO WOâ'.                   
004670        03 FILLER     PICTURE  X(08)  VALUE 'ORIS CIâ'.                   
004680        03 FILLER     PICTURE  X(08)  VALUE 'OROS COâ'.                   
004690        03 FILLER     PICTURE  X(08)  VALUE 'ORTA EOâ'.                   
004700        03 FILLER     PICTURE  X(08)  VALUE 'ORTB EBâ'.                   
004710        03 FILLER     PICTURE  X(08)  VALUE 'OSI  BIâ'.                   
004720        03 FILLER     PICTURE  X(08)  VALUE 'OSI  EIâ'.                   
004730        03 FILLER     PICTURE  X(08)  VALUE 'OSO  BOâ'.                   
004740        03 FILLER     PICTURE  X(08)  VALUE 'OSO  EOâ'.                   
004750        03 FILLER     PICTURE  X(08)  VALUE 'OVIS EOâ'.                   
004760        03 FILLER     PICTURE  X(08)  VALUE 'OVTI BIâ'.                   
004770        03 FILLER     PICTURE  X(08)  VALUE 'OVTI EIâ'.                   
004780        03 FILLER     PICTURE  X(08)  VALUE 'OVTO BOâ'.                   
004790        03 FILLER     PICTURE  X(08)  VALUE 'OVTO EOâ'.                   
004800        03 FILLER     PICTURE  X(08)  VALUE 'PAPI BIâ'.                   
004810        03 FILLER     PICTURE  X(08)  VALUE 'PAPI EIâ'.                   
004820        03 FILLER     PICTURE  X(08)  VALUE 'PAPO BOâ'.                   
004830        03 FILLER     PICTURE  X(08)  VALUE 'PAPO EOâ'.                   
004840        03 FILLER     PICTURE  X(08)  VALUE 'PASS AIâ'.                   
004850        03 FILLER     PICTURE  X(08)  VALUE 'PAT  BBâ'.                   
004860        03 FILLER     PICTURE  X(08)  VALUE 'PAT  EBâ'.                   
004870        03 FILLER     PICTURE  X(08)  VALUE 'PCI  BIâ'.                   
004880        03 FILLER     PICTURE  X(08)  VALUE 'PCI  DIâ'.                   
004890        03 FILLER     PICTURE  X(08)  VALUE 'PCIG BIâ'.                   
004900        03 FILLER     PICTURE  X(08)  VALUE 'PCIG DIâ'.                   
004910        03 FILLER     PICTURE  X(08)  VALUE 'PCO  BOâ'.                   
004920        03 FILLER     PICTURE  X(08)  VALUE 'PCO  EOâ'.                   
004930        03 FILLER     PICTURE  X(08)  VALUE 'PCOG BOâ'.                   
004940        03 FILLER     PICTURE  X(08)  VALUE 'PCOG EOâ'.                   
004950        03 FILLER     PICTURE  X(08)  VALUE 'PFCI BIâ'.                   
004960        03 FILLER     PICTURE  X(08)  VALUE 'PFCO BOâ'.                   
004970        03 FILLER     PICTURE  X(08)  VALUE 'PLAI BIâ'.                   
004980        03 FILLER     PICTURE  X(08)  VALUE 'PLAI EIâ'.                   
004990        03 FILLER     PICTURE  X(08)  VALUE 'PLAO BOâ'.                   
005000        03 FILLER     PICTURE  X(08)  VALUE 'PLAO EOâ'.                   
005010        03 FILLER     PICTURE  X(08)  VALUE 'PMTI BIâ'.                   
005020        03 FILLER     PICTURE  X(08)  VALUE 'PMTI EIâ'.                   
005030        03 FILLER     PICTURE  X(08)  VALUE 'PMTO BOâ'.                   
005040        03 FILLER     PICTURE  X(08)  VALUE 'PMTO EOâ'.                   
005050        03 FILLER     PICTURE  X(08)  VALUE 'PODI CIâ'.                   
005060        03 FILLER     PICTURE  X(08)  VALUE 'PODO COâ'.                   
005070        03 FILLER     PICTURE  X(08)  VALUE 'POIS CIâ'.                   
005080        03 FILLER     PICTURE  X(08)  VALUE 'POOS COâ'.                   
005090        03 FILLER     PICTURE  X(08)  VALUE 'PPFI BIâ'.                   
005100        03 FILLER     PICTURE  X(08)  VALUE 'PPFO BOâ'.                   
005110        03 FILLER     PICTURE  X(08)  VALUE 'PRAI BIâ'.                   
005120        03 FILLER     PICTURE  X(08)  VALUE 'PRAI EIâ'.                   
005130        03 FILLER     PICTURE  X(08)  VALUE 'PRAO BOâ'.                   
005140        03 FILLER     PICTURE  X(08)  VALUE 'PRAO EOâ'.                   
005150        03 FILLER     PICTURE  X(08)  VALUE 'PREA EBâ'.                   
005160        03 FILLER     PICTURE  X(08)  VALUE 'PREB EBâ'.                   
005170        03 FILLER     PICTURE  X(08)  VALUE 'PREC EBâ'.                   
005180        03 FILLER     PICTURE  X(08)  VALUE 'PRED EBâ'.                   
005190        03 FILLER     PICTURE  X(08)  VALUE 'PREE EBâ'.                   
005200        03 FILLER     PICTURE  X(08)  VALUE 'PREF EBâ'.                   
005210        03 FILLER     PICTURE  X(08)  VALUE 'PREG EBâ'.                   
005220        03 FILLER     PICTURE  X(08)  VALUE 'PREH EBâ'.                   
005230        03 FILLER     PICTURE  X(08)  VALUE 'PREI EBâ'.                   
005240        03 FILLER     PICTURE  X(08)  VALUE 'PREX BBâ'.                   
005250        03 FILLER     PICTURE  X(08)  VALUE 'PREX EBâ'.                   
005250        03 FILLER     PICTURE  X(08)  VALUE 'PRHI EIâ'.                   
005250        03 FILLER     PICTURE  X(08)  VALUE 'PRHO EOâ'.                   
005260        03 FILLER     PICTURE  X(08)  VALUE 'PRIA EBâ'.                   
005270        03 FILLER     PICTURE  X(08)  VALUE 'PRIB EBâ'.                   
005280        03 FILLER     PICTURE  X(08)  VALUE 'PRIC EBâ'.                   
005290        03 FILLER     PICTURE  X(08)  VALUE 'PRID EBâ'.                   
005300        03 FILLER     PICTURE  X(08)  VALUE 'PRIE EBâ'.                   
005310        03 FILLER     PICTURE  X(08)  VALUE 'PRIF EBâ'.                   
005320        03 FILLER     PICTURE  X(08)  VALUE 'PRIG EBâ'.                   
005330        03 FILLER     PICTURE  X(08)  VALUE 'PRII CBâ'.                   
005340        03 FILLER     PICTURE  X(08)  VALUE 'PRIJ CBâ'.                   
005350        03 FILLER     PICTURE  X(08)  VALUE 'PRIK CBâ'.                   
005360        03 FILLER     PICTURE  X(08)  VALUE 'PRIL CBâ'.                   
005370        03 FILLER     PICTURE  X(08)  VALUE 'PRIM EBâ'.                   
005380        03 FILLER     PICTURE  X(08)  VALUE 'PRIN EBâ'.                   
005390        03 FILLER     PICTURE  X(08)  VALUE 'PRSI EIâ'.                   
005390        03 FILLER     PICTURE  X(08)  VALUE 'PRSO EIâ'.                   
005390        03 FILLER     PICTURE  X(08)  VALUE 'PRIO CBâ'.                   
005400        03 FILLER     PICTURE  X(08)  VALUE 'PRSM EOâ'.                   
005410        03 FILLER     PICTURE  X(08)  VALUE 'PSAO EOâ'.                   
005410        03 FILLER     PICTURE  X(08)  VALUE 'PSI  BIâ'.                   
005420        03 FILLER     PICTURE  X(08)  VALUE 'PSI  DIâ'.                   
005430        03 FILLER     PICTURE  X(08)  VALUE 'PSO  BOâ'.                   
005440        03 FILLER     PICTURE  X(08)  VALUE 'PSO  EOâ'.                   
005450        03 FILLER     PICTURE  X(08)  VALUE 'PSYI WIâ'.                   
005460        03 FILLER     PICTURE  X(08)  VALUE 'PSYO WOâ'.                   
005470        03 FILLER     PICTURE  X(08)  VALUE 'PTI  EIâ'.                   
005480        03 FILLER     PICTURE  X(08)  VALUE 'PTO  EOâ'.                   
005490        03 FILLER     PICTURE  X(08)  VALUE 'PTRI WIâ'.                   
005500        03 FILLER     PICTURE  X(08)  VALUE 'PTRO WOâ'.                   
005510        03 FILLER     PICTURE  X(08)  VALUE 'PVTA AIâ'.                   
005520        03 FILLER     PICTURE  X(08)  VALUE 'PVTR AIâ'.                   
005530        03 FILLER     PICTURE  X(08)  VALUE 'PXH  EOâ'.                   
005540        03 FILLER     PICTURE  X(08)  VALUE 'PXI  BIâ'.                   
005550        03 FILLER     PICTURE  X(08)  VALUE 'PXO  BOâ'.                   
005560        03 FILLER     PICTURE  X(08)  VALUE 'PXO  EOâ'.                   
005570        03 FILLER     PICTURE  X(08)  VALUE 'PXR  EIâ'.                   
005580        03 FILLER     PICTURE  X(08)  VALUE 'PYT  BBâ'.                   
005590        03 FILLER     PICTURE  X(08)  VALUE 'PYT  EBâ'.                   
005600        03 FILLER     PICTURE  X(08)  VALUE 'RBAC EOâ'.                   
005610        03 FILLER     PICTURE  X(08)  VALUE 'RBDS EOâ'.                   
005620        03 FILLER     PICTURE  X(08)  VALUE 'RBIF EOâ'.                   
005630        03 FILLER     PICTURE  X(08)  VALUE 'RCNT EOâ'.                   
005640        03 FILLER     PICTURE  X(08)  VALUE 'RCXI BIâ'.                   
005650        03 FILLER     PICTURE  X(08)  VALUE 'RCXO BOâ'.                   
005660        03 FILLER     PICTURE  X(08)  VALUE 'RDG  BIâ'.                   
005670        03 FILLER     PICTURE  X(08)  VALUE 'RDM  BOâ'.                   
005680        03 FILLER     PICTURE  X(08)  VALUE 'RDM  EOâ'.                   
005690        03 FILLER     PICTURE  X(08)  VALUE 'RDMP BBâ'.                   
005700        03 FILLER     PICTURE  X(08)  VALUE 'RDMP EBâ'.                   
005710        03 FILLER     PICTURE  X(08)  VALUE 'REHB AIâ'.                   
005720        03 FILLER     PICTURE  X(08)  VALUE 'REIN EBâ'.                   
005730        03 FILLER     PICTURE  X(08)  VALUE 'RENT EOâ'.                   
005740        03 FILLER     PICTURE  X(08)  VALUE 'RII  BIâ'.                   
005750        03 FILLER     PICTURE  X(08)  VALUE 'RII  EIâ'.                   
005760        03 FILLER     PICTURE  X(08)  VALUE 'RIO  BOâ'.                   
005770        03 FILLER     PICTURE  X(08)  VALUE 'RIO  EOâ'.                   
005780        03 FILLER     PICTURE  X(08)  VALUE 'RITI BIâ'.                   
005790        03 FILLER     PICTURE  X(08)  VALUE 'RITO BOâ'.                   
005800        03 FILLER     PICTURE  X(08)  VALUE 'RLAB BBâ'.                   
005810        03 FILLER     PICTURE  X(08)  VALUE 'RLAB EBâ'.                   
005820        03 FILLER     PICTURE  X(08)  VALUE 'RLED EOâ'.                   
005830        03 FILLER     PICTURE  X(08)  VALUE 'RLEN EOâ'.                   
005840        03 FILLER     PICTURE  X(08)  VALUE 'RMSI EIâ'.                   
005850        03 FILLER     PICTURE  X(08)  VALUE 'RMSO EOâ'.                   
005860        03 FILLER     PICTURE  X(08)  VALUE 'RPAI BIâ'.                   
005870        03 FILLER     PICTURE  X(08)  VALUE 'RPAI EIâ'.                   
005880        03 FILLER     PICTURE  X(08)  VALUE 'RPAO BOâ'.                   
005890        03 FILLER     PICTURE  X(08)  VALUE 'RPAO EOâ'.                   
005900        03 FILLER     PICTURE  X(08)  VALUE 'RPAP BBâ'.                   
005910        03 FILLER     PICTURE  X(08)  VALUE 'RPAP EBâ'.                   
005920        03 FILLER     PICTURE  X(08)  VALUE 'RPCI BIâ'.                   
005930        03 FILLER     PICTURE  X(08)  VALUE 'RPCI EIâ'.                   
005940        03 FILLER     PICTURE  X(08)  VALUE 'RPCO BOâ'.                   
005950        03 FILLER     PICTURE  X(08)  VALUE 'RPCO EOâ'.                   
005960        03 FILLER     PICTURE  X(08)  VALUE 'RPFI BIâ'.                   
005970        03 FILLER     PICTURE  X(08)  VALUE 'RPFO BOâ'.                   
005980        03 FILLER     PICTURE  X(08)  VALUE 'RPMI BIâ'.                   
005990        03 FILLER     PICTURE  X(08)  VALUE 'RPMI EIâ'.                   
006000        03 FILLER     PICTURE  X(08)  VALUE 'RPMO BOâ'.                   
006010        03 FILLER     PICTURE  X(08)  VALUE 'RPMO EOâ'.                   
006020        03 FILLER     PICTURE  X(08)  VALUE 'RPNV EOâ'.                   
006030        03 FILLER     PICTURE  X(08)  VALUE 'RPOK BBâ'.                   
006040        03 FILLER     PICTURE  X(08)  VALUE 'RPOK EBâ'.                   
006050        03 FILLER     PICTURE  X(08)  VALUE 'RPOV EOâ'.                   
006060        03 FILLER     PICTURE  X(08)  VALUE 'RPTO BOâ'.                   
006070        03 FILLER     PICTURE  X(08)  VALUE 'RPTO EOâ'.                   
006080        03 FILLER     PICTURE  X(08)  VALUE 'RRTI BIâ'.                   
006090        03 FILLER     PICTURE  X(08)  VALUE 'RRTO BOâ'.                   
006100        03 FILLER     PICTURE  X(08)  VALUE 'RSNG EOâ'.                   
006110        03 FILLER     PICTURE  X(08)  VALUE 'RSPT AIâ'.                   
006120        03 FILLER     PICTURE  X(08)  VALUE 'RTAC EOâ'.                   
006130        03 FILLER     PICTURE  X(08)  VALUE 'RTDS EOâ'.                   
006140        03 FILLER     PICTURE  X(08)  VALUE 'RTPI EIâ'.                   
006150        03 FILLER     PICTURE  X(08)  VALUE 'RTPO EOâ'.                   
006160        03 FILLER     PICTURE  X(08)  VALUE 'RTRI EOâ'.                   
006170        03 FILLER     PICTURE  X(08)  VALUE 'RXGN EOâ'.                   
006180        03 FILLER     PICTURE  X(08)  VALUE 'RXHI BIâ'.                   
006190        03 FILLER     PICTURE  X(08)  VALUE 'RXHO BOâ'.                   
006200        03 FILLER     PICTURE  X(08)  VALUE 'RXRY BBâ'.                   
006210        03 FILLER     PICTURE  X(08)  VALUE 'RXRY EBâ'.                   
006220        03 FILLER     PICTURE  X(08)  VALUE 'SAC  EBâ'.                   
006230        03 FILLER     PICTURE  X(08)  VALUE 'SAC  WBâ'.                   
006240        03 FILLER     PICTURE  X(08)  VALUE 'SBAC EOâ'.                   
006250        03 FILLER     PICTURE  X(08)  VALUE 'SBAM EOâ'.                   
006260        03 FILLER     PICTURE  X(08)  VALUE 'SBDS EOâ'.                   
006270        03 FILLER     PICTURE  X(08)  VALUE 'SBLD EOâ'.                   
006280        03 FILLER     PICTURE  X(08)  VALUE 'SBPR EOâ'.                   
006290        03 FILLER     PICTURE  X(08)  VALUE 'SCON EOâ'.                   
006300        03 FILLER     PICTURE  X(08)  VALUE 'SCSO EOâ'.                   
006310        03 FILLER     PICTURE  X(08)  VALUE 'SDMP EOâ'.                   
006320        03 FILLER     PICTURE  X(08)  VALUE 'SEC  EOâ'.                   
006330        03 FILLER     PICTURE  X(08)  VALUE 'SECF EOâ'.                   
006340        03 FILLER     PICTURE  X(08)  VALUE 'SHVD DIâ'.                   
006350        03 FILLER     PICTURE  X(08)  VALUE 'SICK CBâ'.                   
006360        03 FILLER     PICTURE  X(08)  VALUE 'SICK DBâ'.                   
006370        03 FILLER     PICTURE  X(08)  VALUE 'SICK EBâ'.                   
006380        03 FILLER     PICTURE  X(08)  VALUE 'SICK WBâ'.                   
006390        03 FILLER     PICTURE  X(08)  VALUE 'SIH  EOâ'.                   
006400        03 FILLER     PICTURE  X(08)  VALUE 'SINJ EOâ'.                   
006410        03 FILLER     PICTURE  X(08)  VALUE 'SLAB EOâ'.                   
006420        03 FILLER     PICTURE  X(08)  VALUE 'SLED EOâ'.                   
006430        03 FILLER     PICTURE  X(08)  VALUE 'SLEN EOâ'.                   
006440        03 FILLER     PICTURE  X(08)  VALUE 'SMC  EBâ'.                   
006450        03 FILLER     PICTURE  X(08)  VALUE 'SMC  WBâ'.                   
006460        03 FILLER     PICTURE  X(08)  VALUE 'SMIS CIâ'.                   
006470        03 FILLER     PICTURE  X(08)  VALUE 'SMNI CIâ'.                   
006480        03 FILLER     PICTURE  X(08)  VALUE 'SMNO COâ'.                   
006490        03 FILLER     PICTURE  X(08)  VALUE 'SMOK EOâ'.                   
006500        03 FILLER     PICTURE  X(08)  VALUE 'SMOK WOâ'.                   
006510        03 FILLER     PICTURE  X(08)  VALUE 'SMOS COâ'.                   
006520        03 FILLER     PICTURE  X(08)  VALUE 'SMPT EOâ'.                   
006530        03 FILLER     PICTURE  X(08)  VALUE 'SMRI EIâ'.                   
006540        03 FILLER     PICTURE  X(08)  VALUE 'SMRO EOâ'.                   
006550        03 FILLER     PICTURE  X(08)  VALUE 'SMS  EOâ'.                   
006560        03 FILLER     PICTURE  X(08)  VALUE 'SMVI BIâ'.                   
006570        03 FILLER     PICTURE  X(08)  VALUE 'SMVO BOâ'.                   
006580        03 FILLER     PICTURE  X(08)  VALUE 'SOSI BIâ'.                   
006590        03 FILLER     PICTURE  X(08)  VALUE 'SOSI EIâ'.                   
006600        03 FILLER     PICTURE  X(08)  VALUE 'SOSO BOâ'.                   
006610        03 FILLER     PICTURE  X(08)  VALUE 'SOSO EOâ'.                   
006620        03 FILLER     PICTURE  X(08)  VALUE 'SPAP EOâ'.                   
006630        03 FILLER     PICTURE  X(08)  VALUE 'SPRT EOâ'.                   
006640        03 FILLER     PICTURE  X(08)  VALUE 'SPT  EOâ'.                   
006650        03 FILLER     PICTURE  X(08)  VALUE 'SPTI BIâ'.                   
006660        03 FILLER     PICTURE  X(08)  VALUE 'SPTI EIâ'.                   
006670        03 FILLER     PICTURE  X(08)  VALUE 'SPTO BOâ'.                   
006680        03 FILLER     PICTURE  X(08)  VALUE 'SPTO EOâ'.                   
006690        03 FILLER     PICTURE  X(08)  VALUE 'SRGI CIâ'.                   
006700        03 FILLER     PICTURE  X(08)  VALUE 'SRGO COâ'.                   
006710        03 FILLER     PICTURE  X(08)  VALUE 'SRIO EOâ'.                   
006720        03 FILLER     PICTURE  X(08)  VALUE 'SRIS CIâ'.                   
006730        03 FILLER     PICTURE  X(08)  VALUE 'SRO  COâ'.                   
006740        03 FILLER     PICTURE  X(08)  VALUE 'SROS COâ'.                   
006750        03 FILLER     PICTURE  X(08)  VALUE 'SRRX EOâ'.                   
006760        03 FILLER     PICTURE  X(08)  VALUE 'SSCI BIâ'.                   
006770        03 FILLER     PICTURE  X(08)  VALUE 'SSCO BOâ'.                   
006780        03 FILLER     PICTURE  X(08)  VALUE 'SSTO BOâ'.                   
006790        03 FILLER     PICTURE  X(08)  VALUE 'STAC EOâ'.                   
006800        03 FILLER     PICTURE  X(08)  VALUE 'STDS EOâ'.                   
006810        03 FILLER     PICTURE  X(08)  VALUE 'STI  BIâ'.                   
006820        03 FILLER     PICTURE  X(08)  VALUE 'STO  AOâ'.                   
006830        03 FILLER     PICTURE  X(08)  VALUE 'STRI WIâ'.                   
006840        03 FILLER     PICTURE  X(08)  VALUE 'STRO WOâ'.                   
006850        03 FILLER     PICTURE  X(08)  VALUE 'SVIS EOâ'.                   
006860        03 FILLER     PICTURE  X(08)  VALUE 'SXRY EOâ'.                   
006870        03 FILLER     PICTURE  X(08)  VALUE 'SXTI BIâ'.                   
006880        03 FILLER     PICTURE  X(08)  VALUE 'SXTI EIâ'.                   
006890        03 FILLER     PICTURE  X(08)  VALUE 'SXTO BOâ'.                   
006900        03 FILLER     PICTURE  X(08)  VALUE 'SXTO EOâ'.                   
006910        03 FILLER     PICTURE  X(08)  VALUE 'TABI CIâ'.                   
006920        03 FILLER     PICTURE  X(08)  VALUE 'TABI WIâ'.                   
006930        03 FILLER     PICTURE  X(08)  VALUE 'TABO COâ'.                   
006940        03 FILLER     PICTURE  X(08)  VALUE 'TABO WOâ'.                   
006950        03 FILLER     PICTURE  X(08)  VALUE 'TAX  BOâ'.                   
006960        03 FILLER     PICTURE  X(08)  VALUE 'TAX  EOâ'.                   
006970        03 FILLER     PICTURE  X(08)  VALUE 'TBV  DIâ'.                   
006980        03 FILLER     PICTURE  X(08)  VALUE 'TINT EOâ'.                   
006990        03 FILLER     PICTURE  X(08)  VALUE 'TRAN BBâ'.                   
007000        03 FILLER     PICTURE  X(08)  VALUE 'TRAN EBâ'.                   
007010        03 FILLER     PICTURE  X(08)  VALUE 'VCPI EIâ'.                   
007020        03 FILLER     PICTURE  X(08)  VALUE 'VCPO EOâ'.                   
007030        03 FILLER     PICTURE  X(08)  VALUE 'VMIS EOâ'.                   
007040        03 FILLER     PICTURE  X(08)  VALUE 'VOCI BIâ'.                   
007050        03 FILLER     PICTURE  X(08)  VALUE 'VOCO BOâ'.                   
007060        03 FILLER     PICTURE  X(08)  VALUE 'VTCG EOâ'.                   
007070        03 FILLER     PICTURE  X(08)  VALUE 'VTI  BIâ'.                   
007080        03 FILLER     PICTURE  X(08)  VALUE 'VTI  EIâ'.                   
007090        03 FILLER     PICTURE  X(08)  VALUE 'VTO  BOâ'.                   
007100        03 FILLER     PICTURE  X(08)  VALUE 'VTO  EOâ'.                   
007100        03 FILLER     PICTURE  X(08)  VALUE 'VVIS EOâ'.                   
007110        03 FILLER     PICTURE  X(08)  VALUE 'WBCO EBâ'.                   
007120        03 FILLER     PICTURE  X(08)  VALUE 'WTI  BIâ'.                   
007130        03 FILLER     PICTURE  X(08)  VALUE 'WTI  EIâ'.                   
007140        03 FILLER     PICTURE  X(08)  VALUE 'WTO  BOâ'.                   
007150        03 FILLER     PICTURE  X(08)  VALUE 'WTO  EOâ'.                   
007160        03 FILLER     PICTURE  X(08)  VALUE 'XRYI BIâ'.                   
007170        03 FILLER     PICTURE  X(08)  VALUE 'XRYI EIâ'.                   
007180        03 FILLER     PICTURE  X(08)  VALUE 'XRYO BOâ'.                   
007190        03 FILLER     PICTURE  X(08)  VALUE 'XRYO EOâ'.                   
007200     02 CFT4-TABLE       REDEFINES CFT4-VALUES.                           
007210        03 CFT4-TBL      OCCURS 715 TIMES                                 
007220                         INDEXED BY CFT4-IDX.                             
007230           04 CFT4-BP            PICTURE  X(06).                          
007240           04 CFT4-IP-OP-IND     PICTURE  X(01).                          
007250           04 CFT4-ALT-PROVN-IND PICTURE  X(01).                          
007260                                                                          
007270     02 CFT4-COUNTS.                                                      
007280        03 CFT4-NBR-TBL-ENTRIES  PICTURE S9(04)  COMP VALUE   714.        
007290        03 CFT4-NBR-INST-ENTRIES PICTURE S9(04)  COMP VALUE   293.        
007300        03 CFT4-NBR-PROF-ENTRIES PICTURE S9(04)  COMP VALUE   422.        
007310        03 CFT4-NBR-IP-ENTRIES   PICTURE S9(04)  COMP VALUE   235.        
007320        03 CFT4-NBR-OP-ENTRIES   PICTURE S9(04)  COMP VALUE   378.        
007330        03 CFT4-NBR-BOTH-ENTRIES PICTURE S9(04)  COMP VALUE   102.        
