000100******************************************************************00010000
000200*                                                                *00020000
000300*    COPYBOOK:   ELSMHDGC                                        *00030000
000400*    DATE:       17-SEP-1986                                     *00040000
000500*    AUTHOR:     RICHARD J. LUKETICH                             *00050000
000600*                EDWARD G. LISS                                  *00060000
000700*    FUNCTION:   HEADING LINES FOR THE CURRENT SELECTION MENU    *00070000
000800*                                                                *00080000
000900******************************************************************00090000
001000*                                                                *00100000
001100*                      MAINTENANCE HISTORY                       *00110000
001200*                                                                *00120000
001300*  MOD     DATE     BY  DRPT                ACTION               *00130000
001400* ----- ----------- --- ----- ---------------------------------- *00140000
001500* 01.00 17-SEP-1986 RJL       CREATED                            *00150000
001600*                   EGL                                          *00160000
001700*                                                                *00170000
001800******************************************************************00180000
001900                                                                  00190000
002000 01  MHD-MENU-HEADINGS.                                           00200000
002100     02 MHD-NBR-HDG-LINES        PICTURE S9(04)          COMP.    00210000
002200     02 MHD-HDG-LINES.                                            00220000
002300        03 MHD-HDG-LINE          PICTURE  X(79)                   00230000
002400                                 OCCURS 1 TO 15 TIMES             00240000
002500                                 DEPENDING ON MHD-NBR-HDG-LINES   00250000
002600                                 INDEXED BY MHD-IDX.              00260000
