000100******************************************************************00010000
000200*                                                                *00020000
000300*    COPYBOOK:   ELCDPLS                                         *00030000
000400*    DATE:       26-SEP-1986                                     *00040000
000500*    AUTHOR:     JERRY L. ARKEMA                                 *00050000
000600*    FUNCTION:   SWITCHES TO INDICATE TO ELUPLGRP (BENEFIT       *00060000
000700*                PROVISION PAYMENT LEVEL GROUPING) WHICH BENEFIT *00070000
000800*                PROVISION DATA ELEMENTS ARE REQUIRED FOR THE    *00080000
000900*                CURRENT TOPIC.                                  *00090000
001000*                                                                *00100000
001100*                SPACE = NOT REQUIRED                            *00110000
001200*                '1'   = REQUIRED                                *00120000
001300*                                                                *00130000
001400******************************************************************00140000
001500*                                                                *00150000
001600*                      MAINTENANCE HISTORY                       *00160000
001700*                                                                *00170000
001800*  MOD     DATE     BY  DRPT                ACTION               *00180000
001900* ----- ----------- --- ----- ---------------------------------- *00190000
002000* 01.00 26-SEP-1986 RJL       RECREATED                          *00200000
002010* 01.01 17-OCT-1986 RJL       ADDED NEW DATE ELEMENT             *00201000
002010* 01.02 24-NOV-1986 NAC       DELETE CERTIFICATION REQUIREMENT   *00202000
002100*                             INDICATOR FROM ALL FORMATS AND ADD *00203000
      *                             IT TO THE COMMON PORTION.           00204000
002010* 01.03 17-APR-1990 GEM       DELETE PSE-COST-CONT-PYMT-ELIG-IND *00204101
002100*                             FROM FORMAT E PORTION.             *00204201
002100*                             ADDED  PSP-COST-CONT-PYMT-ELIG-IND *00204301
      *                             TO THE COMMON PORTION.              00204401
002200******************************************************************00205000
002300                                                                  00206000
002400 01  PLS-PAYMENT-LEVEL-SWITCHES.                                  00207000
002500     02 PSP-BP-COMMON.                                            00208000
002600        03 PSP-USE-COUNT                       PICTURE  X(01).    00209000
002700        03 PSP-PROVN-PRICING-METHD             PICTURE  X(01).    00210000
002800        03 PSP-COV-QUALIF                      PICTURE  X(01).    00220000
002900        03 PSP-AGE-LVL-1                       PICTURE  X(01).    00230000
003000        03 PSP-DAY-LVL-1                       PICTURE  X(01).    00240000
003100        03 PSP-AGE-LVL-2                       PICTURE  X(01).    00250000
003200        03 PSP-DAY-LVL-2                       PICTURE  X(01).    00260000
003300        03 PSP-TREAT-RESTRN-IND                PICTURE  X(01).    00270000
003400        03 PSP-AGE-COV-TERMN-IND               PICTURE  X(01).    00280000
003500        03 PSP-AGE-COV-TERMN                   PICTURE  X(01).    00290000
003600        03 PSP-AGE-EFF-DT-COMPRSN-IND          PICTURE  X(01).    00300000
003700        03 PSP-TRANSF-OTHER-RESP-IND           PICTURE  X(01).    00310000
003800        03 PSP-TRAUM-INJ-EFF-DT-COMP-IND       PICTURE  X(01).    00320000
003900        03 PSP-COORD-MCARE-IND                 PICTURE  X(01).    00330000
004000        03 PSP-SPILL-OVER-COINS-APL-IND        PICTURE  X(01).    00340000
004100        03 PSP-SPILL-OVER-DED-APL-IND          PICTURE  X(01).    00350000
004200        03 PSP-PROV-FILE-ELIG-IND              PICTURE  X(01).    00360000
004300        03 PSP-CRDT-CARD-PROCS-IND             PICTURE  X(01).    00370000
004400        03 PSP-DENT-SURG-PMT-ELG-IP-IND        PICTURE  X(01).    00380000
004500        03 PSP-DENT-SURG-PMT-ELG-OP-IND        PICTURE  X(01).    00390000
004600        03 PSP-ADDITIONAL-PRICING-PRCNT        PICTURE  X(01).    00400000
004700        03 PSP-VARIABLE-INDEMNITY-PRCNT        PICTURE  X(01).    00410000
004800        03 PSP-SPILL-OVR-RM-F-RT-APL-IND       PICTURE  X(01).    00420000
004900        03 PSP-PLACE-TREAT-ELIG-IND            PICTURE  X(01).    00430000
005000        03 PSP-COSM-SURG-PAYMT-IND             PICTURE  X(01).    00440000
005100        03 PSP-CONG-DFCT-SURG-PMT-ELG          PICTURE  X(01).    00450000
005200        03 PSP-SERV-NECESRY-CORP-BIT-IND       PICTURE  X(01).    00460000
007200        03 PSP-CERTFN-REQRM-IND                PICTURE  X(01).    00470000
017600        03 PSP-COST-CONT-PYMT-ELIG-IND         PICTURE  X(01).    00471002
005300     02 PSP-BP-TABULAR-SLOT-NBRS.                                 00480000
005400        03 PSP-BEN-TAB-PROVN-ID-AAR            PICTURE  X(01).    00490000
005500        03 PSP-BEN-TAB-PROVN-ID-ABM            PICTURE  X(01).    00500000
005600        03 PSP-BEN-TAB-PROVN-ID-ACL            PICTURE  X(01).    00510000
005700        03 PSP-BEN-TAB-PROVN-ID-ADL            PICTURE  X(01).    00520000
005800        03 PSP-BEN-TAB-PROVN-ID-AOL            PICTURE  X(01).    00530000
005900        03 PSP-BEN-TAB-PROVN-ID-PPF            PICTURE  X(01).    00540000
006000        03 PSP-BEN-TAB-PROVN-ID-PVE            PICTURE  X(01).    00550000
006100     02 PSP-BP-FORMAT-A.                                          00560000
006200        03 PSA-HOSP-ADM-RESTRN-IND             PICTURE  X(01).    00570000
006300        03 PSA-STAY-CD                         PICTURE  X(01).    00580000
006400        03 PSA-HOSP-COND-RELATSP-IND           PICTURE  X(01).    00590000
006500        03 PSA-REHAB-ADM-RESTRN-IND            PICTURE  X(01).    00600000
006600        03 PSA-DAYS-RDCN-RAT-IND               PICTURE  X(01).    00610000
006700        03 PSA-DAYS-RDCN-RAT-BASIC-APL         PICTURE  X(01).    00620000
006800        03 PSA-DAYS-RDCN-RAT-BASIC-BASE        PICTURE  X(01).    00630000
006900        03 PSA-DAYS-RDCN-RAT-SEC-APL           PICTURE  X(01).    00640000
007000        03 PSA-DAYS-RDCN-RAT-SEC-BASE          PICTURE  X(01).    00650000
007100        03 PSA-FLAT-RATE-PDM-AMT               PICTURE  X(01).    00660000
007300        03 PSA-CERTFN-REPETN-REQRM-IND         PICTURE  X(01).    00670000
007400        03 PSA-ADDN-ALLOW-AMT-PER-DAY          PICTURE  X(01).    00680000
007500        03 PSA-HSP-ADM-RESTRN-DAYS             PICTURE  X(01).    00690000
007600        03 PSA-NORM-NWBORN-OVRD-IND            PICTURE  X(01).    00700000
007700        03 PSA-DRUG-ELIG-MEMB-CLS-OVRD         PICTURE  X(01).    00710000
007800        03 PSA-ALCO-ELIG-MEMB-CLS-OVRD         PICTURE  X(01).    00720000
007900        03 PSA-ECF-SNF-OVRD-IND                PICTURE  X(01).    00730000
008000        03 PSA-TRANSSXL-PMT-RESTR-OVRD         PICTURE  X(01).    00740000
008100        03 PSA-ECF-F-RAT-PER-DIEM-AMT          PICTURE  X(01).    00750000
008200        03 PSA-STAY-CODE-IND                   PICTURE  X(01).    00760000
008300        03 PSA-PHYS-EXAM-IND                   PICTURE  X(01).    00770000
008400     02 PSP-BP-FORMAT-B.                                          00780000
008500        03 PSB-HOSP-ADM-RESTRN-IND             PICTURE  X(01).    00790000
008600        03 PSB-STAY-CD                         PICTURE  X(01).    00800000
008700        03 PSB-HOSP-COND-RELATSP-IND           PICTURE  X(01).    00810000
008800        03 PSB-REHAB-ADM-RESTRN-IND            PICTURE  X(01).    00820000
008900        03 PSB-TREAT-TIME-FACTOR-IND           PICTURE  X(01).    00830000
009000        03 PSB-TREAT-TIME-FACTOR               PICTURE  X(01).    00840000
009100        03 PSB-ELIG-METHD-OF-TREAT-IND         PICTURE  X(01).    00850000
009200        03 PSB-REPR-REPLAC-RESTRN-IND          PICTURE  X(01).    00860000
009400        03 PSB-CERTN-REPETN-REQRD-IND          PICTURE  X(01).    00870000
009500        03 PSB-PHYS-EXAM-IND                   PICTURE  X(01).    00880000
009600        03 PSB-HSP-ADM-RESTRN-DAYS             PICTURE  X(01).    00890000
009700        03 PSB-PROF-CHRG-HSP-CLM               PICTURE  X(01).    00900000
009800        03 PSB-AMBULANCE-ELIG-IND              PICTURE  X(01).    00910000
009900        03 PSB-NORM-NWBORN-OVRD-IND            PICTURE  X(01).    00920000
010000        03 PSB-DRUG-ELIG-MEMB-CLS-OVRD         PICTURE  X(01).    00930000
010100        03 PSB-ALCO-ELIG-MEMB-CLS-OVRD         PICTURE  X(01).    00940000
010200        03 PSB-ECF-SNF-OVRD-IND                PICTURE  X(01).    00950000
010300        03 PSB-TRANSSXL-PMT-RESTR-OVRD         PICTURE  X(01).    00960000
010400        03 PSB-STAY-CODE-IND                   PICTURE  X(01).    00970000
010500        03 PSB-MAX-AMT-PER-VISIT               PICTURE  X(01).    00980000
010600     02 PSP-BP-FORMAT-C.                                          00990000
010700        03 PSC-BEN-SCOPE-ID                    PICTURE  X(01).    01000000
010800        03 PSC-EXCP-SCHED-ID                   PICTURE  X(01).    01010000
010900        03 PSC-ELIG-METHD-OF-TREAT-IND         PICTURE  X(01).    01020000
011100        03 PSC-MULT-REL-PROC-IND               PICTURE  X(01).    01030000
011200        03 PSC-PRIM-SURG-DEPEND-IND            PICTURE  X(01).    01040000
011300        03 PSC-HOSP-STAFF-PROV-IND             PICTURE  X(01).    01050000
011400        03 PSC-REPEAT-PROC-IND                 PICTURE  X(01).    01060000
011500        03 PSC-MULT-INJ-PRICING-MOD-IND        PICTURE  X(01).    01070000
011600        03 PSC-MIN-ELIG-AMT                    PICTURE  X(01).    01080000
011700        03 PSC-SURG-MULT-PROC-PRICE-IND        PICTURE  X(01).    01090000
011800        03 PSC-PRIM-SURG-DPD-PAY-PCT           PICTURE  X(01).    01100000
011900        03 PSC-MULT-UNRL-PROC-1-PCT            PICTURE  X(01).    01110000
012000        03 PSC-MULT-UNRL-1-NO-OCCUR            PICTURE  X(01).    01120000
012100        03 PSC-MULT-UNRL-PROC-2-PCT            PICTURE  X(01).    01130000
012200        03 PSC-MULT-UNRL-2-NO-OCCUR            PICTURE  X(01).    01140000
012300        03 PSC-MULT-RL-PROC-1-PCT              PICTURE  X(01).    01150000
012400        03 PSC-MULT-RL-1-NO-OCCUR              PICTURE  X(01).    01160000
012500        03 PSC-MULT-RL-PROC-2-PCT              PICTURE  X(01).    01170000
012600        03 PSC-MULT-RL-2-NO-OCCUR              PICTURE  X(01).    01180000
012700        03 PSC-MULT-INJ-LVL-1-PCT              PICTURE  X(01).    01190000
012800        03 PSC-MULT-INJ-1-NO-OCCUR             PICTURE  X(01).    01200000
012900        03 PSC-MULT-INJ-LVL-2-PCT              PICTURE  X(01).    01210000
013000        03 PSC-MULT-INJ-2-NO-OCCUR             PICTURE  X(01).    01220000
013100        03 PSC-MULT-POD-PROC-PRICE-IND         PICTURE  X(01).    01230000
013200        03 PSC-MULT-POD-PROC-1-PCT             PICTURE  X(01).    01240000
013300        03 PSC-MULT-POD-1-NO-OCCUR             PICTURE  X(01).    01250000
013400        03 PSC-MULT-POD-PROC-2-PCT             PICTURE  X(01).    01260000
013500        03 PSC-MULT-POD-2-NO-OCCUR             PICTURE  X(01).    01270000
013600        03 PSC-MULT-POD-PROC-3-PCT             PICTURE  X(01).    01280000
013700        03 PSC-MULT-POD-3-NO-OCCUR             PICTURE  X(01).    01290000
013800        03 PSC-MULT-POD-PROC-4-PCT             PICTURE  X(01).    01300000
013900        03 PSC-MULT-POD-4-NO-OCCUR             PICTURE  X(01).    01310000
013910        03 PSC-CORRIDOR-OVERRIDE               PICTURE  X(01).    01320000
014000     02 PSP-BP-FORMAT-D.                                          01330000
014100        03 PSD-BEN-SCOPE-ID                    PICTURE  X(01).    01340000
014200        03 PSD-EXCP-SCHED-ID                   PICTURE  X(01).    01350000
014300        03 PSD-HOSP-ADM-RESTRN-IND             PICTURE  X(01).    01360000
014400        03 PSD-STAY-CD                         PICTURE  X(01).    01370000
014500        03 PSD-HOSP-COND-RELATSP-IND           PICTURE  X(01).    01380000
014600        03 PSD-DAYS-RDCN-RAT-IND               PICTURE  X(01).    01390000
014700        03 PSD-DAYS-RDCN-RAT-BASIC-APL         PICTURE  X(01).    01400000
014800        03 PSD-DAYS-RDCN-RAT-BASIC-BASE        PICTURE  X(01).    01410000
014900        03 PSD-DAYS-RDCN-RAT-SEC-APL           PICTURE  X(01).    01420000
015000        03 PSD-DAYS-RDCN-RAT-SEC-BASE          PICTURE  X(01).    01430000
015100        03 PSD-MAX-AMT-PER-VISIT               PICTURE  X(01).    01440000
015200        03 PSD-FLAT-RATE-PDM-AMT               PICTURE  X(01).    01450000
015300        03 PSD-CERT-REPT-REQ-IND               PICTURE  X(01).    01460000
015400        03 PSD-HSP-ADM-RESTRN-DAYS             PICTURE  X(01).    01470000
015600        03 PSD-STAY-CODE-IND                   PICTURE  X(01).    01480000
015700        03 PSD-BEN-MAX-VISIT-IND               PICTURE  X(01).    01490000
015800        03 PSD-BEN-MAX-VISIT-DAYS              PICTURE  X(01).    01500000
015900        03 PSD-TREAT-TIME-FACTOR-IND           PICTURE  X(01).    01510000
016000        03 PSD-TREAT-TIME-FACTOR               PICTURE  X(01).    01520000
016010        03 PSD-CORRIDOR-OVERRIDE               PICTURE  X(01).    01530000
016100     02 PSP-BP-FORMAT-E.                                          01540000
016200        03 PSE-BEN-SCOPE-ID                    PICTURE  X(01).    01550000
016300        03 PSE-EXCP-SCHED-ID                   PICTURE  X(01).    01560000
016400        03 PSE-HOSP-ADM-RESTRN-IND             PICTURE  X(01).    01570000
016500        03 PSE-TREAT-TIME-FACTOR-IND           PICTURE  X(01).    01580000
016600        03 PSE-TREAT-TIME-FACTOR               PICTURE  X(01).    01590000
016700        03 PSE-REPR-REPLAC-RESTRN-IND          PICTURE  X(01).    01600000
016900        03 PSE-CERTN-REPETN-REQRD-IND          PICTURE  X(01).    01610000
017000        03 PSE-PHYS-EXAM-IND                   PICTURE  X(01).    01620000
017100        03 PSE-MAX-AMT-PER-VISIT               PICTURE  X(01).    01630000
017200        03 PSE-HSP-ADM-RESTRN-DAYS             PICTURE  X(01).    01640000
017300        03 PSE-AMBULANCE-ELIG-IND              PICTURE  X(01).    01650000
017400        03 PSE-BEN-MAX-VISITS-IND              PICTURE  X(01).    01660000
017500        03 PSE-BEN-MAX-VISITS-DAYS             PICTURE  X(01).    01670000
017610        03 PSE-CORRIDOR-OVERRIDE               PICTURE  X(01).    01690000
017700     02 PSP-BP-FORMAT-W.                                          01700000
017800        03 PSW-HOSP-ADM-RESTRN-IND             PICTURE  X(01).    01710000
017900        03 PSW-STAY-CD                         PICTURE  X(01).    01720000
018000        03 PSW-HOSP-COND-RELATSP-IND           PICTURE  X(01).    01730000
018100        03 PSW-DAYS-RDCN-RAT-IND               PICTURE  X(01).    01740000
018200        03 PSW-DAYS-RDCN-RAT-BASIC-APL         PICTURE  X(01).    01750000
018300        03 PSW-DAYS-RDCN-RAT-BASIC-BASE        PICTURE  X(01).    01760000
018400        03 PSW-DAYS-RDCN-RAT-SEC-APL           PICTURE  X(01).    01770000
018500        03 PSW-DAYS-RDCN-RAT-SEC-BASE          PICTURE  X(01).    01780000
018600        03 PSW-FLAT-RATE-PDM-AMT               PICTURE  X(01).    01790000
018700        03 PSW-ADDN-ALLOW-AMT-PER-DAY          PICTURE  X(01).    01800000
018900        03 PSW-CERTFN-REPETN-REQRM-IND         PICTURE  X(01).    01810000
019000        03 PSW-TREAT-TIME-FACTOR-IND           PICTURE  X(01).    01820000
019100        03 PSW-TREAT-TIME-FACTOR               PICTURE  X(01).    01830000
019200        03 PSW-ELIG-METHD-OF-TREAT-IND         PICTURE  X(01).    01840000
019300        03 PSW-PHYS-EXAM-IND                   PICTURE  X(01).    01850000
019400        03 PSW-REHAB-ADM-RESTRN-IND            PICTURE  X(01).    01860000
019500        03 PSW-HSP-ADM-RESTRN-DAYS             PICTURE  X(01).    01870000
019600        03 PSW-NORM-NWBORN-OVRD-IND            PICTURE  X(01).    01880000
019700        03 PSW-DRUG-ELIG-MEMB-CLS-OVRD         PICTURE  X(01).    01890000
019800        03 PSW-ALCO-ELIG-MEMB-CLS-OVRD         PICTURE  X(01).    01900000
019900        03 PSW-STAY-CODE-IND                   PICTURE  X(01).    01910000
020000        03 PSW-TRNS-SEX-REST-OVRD-IND          PICTURE  X(01).    01920000
