      ***************************************************************** 00000100
             05 WS100-INV-LAST-PROD-KING      PIC 9  VALUE 3.           00002600
             05 WS100-INV-LAST-PROD-MEMORIAL  PIC 9  VALUE 3.           00002900
             05 WS100-INV-LAST-PROD-BUSINESS  PIC 9  VALUE 2.           00035100
             05 WS100-INV-LAST-PROD-4TH-JULY  PIC 9  VALUE 2.           00035200
             05 WS100-INV-LAST-PROD-LABOR     PIC 9  VALUE 3.           00003100
             05 WS100-INV-LAST-PROD-THANKS    PIC 9  VALUE 3.           00003200
             05 WS100-INV-LAST-PROD-ATHANKS   PIC 9  VALUE 3.           00036000
             05 WS100-INV-LAST-PROD-CHRISTMAS PIC 9  VALUE 3.           00035600
                                                                        00003300
