//HGD16DMO JOB (PD,0000,999,,PROD,HCMS,442),UCC7,CLASS=F,MSGCLASS=J     00010000
/*JOBPARM  S=C081,LINES=99999                                           00020002
/*OUTPUT   ROCK DEST=ROCKFORD                                           00030000
//HGD16D   EXEC HGD16D,REGION=3500K,                                    00040000
//         MIDATS=MIDATSMO,DATE=$(MDDYY),DAY=$(J)                       00060000
