  SORT  FIELDS=COPY                                                     00010003
  OUTFIL  FILES=01,                                                     00020003
  INCLUDE=(0003,03,CH,EQ,C'412')                                        00030003
  OUTFIL  FILES=02,                                                     00040003
  INCLUDE=(0003,03,CH,NE,C'412')                                        00050003
