 SORT FIELDS=(1,9,A,12,1,A,32,3,A),FORMAT=CH                            00134   
 INCLUDE COND=(1,2,CH,EQ,C'P3',OR,1,2,CH,EQ,C'P4')                              
