 SORT FIELDS=(5,20,CH,A)                                                00134   
 SUM FIELDS=NONE                                                        00134   
