  SORT  FIELDS=COPY                                                     00010000
  OUTFIL  FILES=01,                                                     00020000
  INCLUDE=((0003,03,CH,EQ,C'201',OR,                                    00030000
            0003,03,CH,EQ,C'207',OR,                                    00040000
            0003,03,CH,EQ,C'216',OR,                                    00041000
            0003,03,CH,EQ,C'217',OR,                                    00042000
            0003,03,CH,EQ,C'219',OR,                                    00043000
            0003,03,CH,EQ,C'969'))                                      00044000
  OUTFIL  FILES=02,                                                     00045000
  INCLUDE=((0003,03,CH,NE,C'201',AND,                                   00046000
            0003,03,CH,NE,C'207',AND,                                   00047000
            0003,03,CH,NE,C'216',AND,                                   00048000
            0003,03,CH,NE,C'217',AND,                                   00049000
            0003,03,CH,NE,C'219',AND,                                   00050000
            0003,03,CH,NE,C'969'))                                      00060000
