  SORT    FIELDS=(5,21,BI,A,52,6,CH,A,26,20,BI,A)                               
  RECORD  TYPE=V,LENGTH=(7873,,110,200)     CONTR.FILE   PROC GCD02A            
