  SORT    FIELDS=(69,6,CH,A,106,3963,BI,A)    AS.IN.GCWRK  (COMPLETE)   00000010
  RECORD  TYPE=V,LENGTH=(4068,,110,200)     CONTR.FILE                  00000011
