  SORT    FIELDS=(69,6,CH,A,94,369,BI,A,75,4,BI,A)                              
  RECORD  TYPE=V,LENGTH=(463,,323,373)                                          
