  SORT    FIELDS=(5,57,BI,A)                  AS.IN.GCWRK  (COMPLETE)   00010001
  RECORD  TYPE=V,LENGTH=(8004,,210,600)     CONTR.FILE  PROC GCD05A     00020000
