G7A2SET  DFHMSD TYPE=MAP,MODE=INOUT,LANG=COBOL,CTRL=FREEKB,DATA=FIELD,TX00001   
               IOAPFX=YES                                               00002   
G7A2I01  DFHMDI SIZE=(24,80)                                            00003   
S2FUNC   DFHMDF LENGTH=0004,POS=(1,1),ATTRB=(ASKIP,NORM,FSET),INITIAL='X00004   
               G7A2'                                                    00005   
S2TITLE  DFHMDF LENGTH=0032,POS=(1,20),ATTRB=(ASKIP,NORM),INITIAL='BENEX00006   
               FIT PROVISION TYPE A        '                            00007   
         DFHMDF LENGTH=0008,POS=(1,65),ATTRB=(ASKIP,NORM),INITIAL='SCREX00008   
               EN #'                                                    00009   
S2SCRN   DFHMDF LENGTH=0006,POS=(1,74),ATTRB=(ASKIP,NORM,FSET),INITIAL=X00010   
               '007A02'                                                 00011   
         DFHMDF LENGTH=0004,POS=(2,1),ATTRB=(ASKIP,NORM),INITIAL='PLN:' 00012   
S2PLNCD  DFHMDF LENGTH=3,POS=(2,6),ATTRB=(ASKIP,NORM,FSET)              00013   
         DFHMDF LENGTH=0004,POS=(2,10),ATTRB=(ASKIP,NORM),INITIAL='GRP:X00014   
               '                                                        00015   
S2GRPNO  DFHMDF LENGTH=9,POS=(2,15),ATTRB=(ASKIP,NORM,FSET)             00016   
         DFHMDF LENGTH=0004,POS=(2,26),ATTRB=(ASKIP,NORM),INITIAL='SEC:X00017   
               '                                                        00018   
S2SECNO  DFHMDF LENGTH=5,POS=(2,31),ATTRB=(ASKIP,NORM,FSET)             00019   
         DFHMDF LENGTH=0004,POS=(2,37),ATTRB=(ASKIP,NORM),INITIAL='PKG:X00020   
               '                                                        00021   
S2PKGCD  DFHMDF LENGTH=3,POS=(2,42),ATTRB=(ASKIP,NORM,FSET)             00022   
         DFHMDF LENGTH=0004,POS=(2,46),ATTRB=(ASKIP,NORM),INITIAL='LOB:X00023   
               '                                                        00024   
S2LOB    DFHMDF LENGTH=1,POS=(2,51),ATTRB=(ASKIP,NORM,FSET)             00025   
         DFHMDF LENGTH=0004,POS=(2,53),ATTRB=(ASKIP,NORM),INITIAL='PRV:X00026   
               '                                                        00027   
S2PRV    DFHMDF LENGTH=2,POS=(2,58),ATTRB=(ASKIP,NORM,FSET)             00028   
         DFHMDF LENGTH=0003,POS=(2,61),ATTRB=(ASKIP,NORM),INITIAL='FR:' 00029   
S2FRL    DFHMDF LENGTH=2,POS=(2,65),ATTRB=(ASKIP,NORM,FSET)             00030   
         DFHMDF LENGTH=0005,POS=(2,68),ATTRB=(ASKIP,NORM),INITIAL='EFDTX00031   
               :'                                                       00032   
S2EFFDT  DFHMDF LENGTH=6,POS=(2,74),ATTRB=(ASKIP,NORM,FSET)             00033   
         DFHMDF LENGTH=0011,POS=(3,65),ATTRB=(ASKIP,NORM),INITIAL='PAGEX00034   
                5 OF 5'                                                 00035   
         DFHMDF LENGTH=0038,POS=(6,5),ATTRB=(ASKIP,NORM),INITIAL='CERTIX00036   
               FICATION REPEAT REQUIREMENT IND :'                       00037   
S2RRCER  DFHMDF LENGTH=1,POS=(6,45),ATTRB=(UNPROT,NORM,IC,FSET)         00038   
         DFHMDF LENGTH=1,POS=(6,47),ATTRB=(ASKIP,NORM)                  00039   
         DFHMDF LENGTH=0039,POS=(8,5),ATTRB=(ASKIP,NORM),INITIAL='ALCOHX00040   
               OL ELIGIBLE MEMBER OVERRIDE IND:  '                      00041   
S2AECOI  DFHMDF LENGTH=1,POS=(8,45),ATTRB=(UNPROT,NORM,FSET)            00042   
         DFHMDF LENGTH=1,POS=(8,47),ATTRB=(ASKIP,NORM)                  00043   
         DFHMDF LENGTH=0039,POS=(9,5),ATTRB=(ASKIP,NORM),INITIAL='DRUG X00044   
               ELIGIBLE MEMBER OVERRIDE IND:     '                      00045   
S2DECOI  DFHMDF LENGTH=1,POS=(9,45),ATTRB=(UNPROT,NORM,FSET)            00046   
         DFHMDF LENGTH=1,POS=(9,47),ATTRB=(ASKIP,NORM)                  00047   
         DFHMDF LENGTH=0007,POS=(9,59),ATTRB=(ASKIP,NORM),INITIAL='BPVIX00048   
               D ='                                                     00049   
S2BPVID  DFHMDF LENGTH=6,POS=(9,67),ATTRB=(ASKIP,NORM,FSET)             00050   
         DFHMDF LENGTH=0028,POS=(10,5),ATTRB=(ASKIP,NORM),INITIAL='ECF/X00051   
               SNF OVERRIDE INDICATOR :'                                00052   
S2ESOVI  DFHMDF LENGTH=1,POS=(10,45),ATTRB=(UNPROT,NORM,FSET)           00053   
         DFHMDF LENGTH=1,POS=(10,47),ATTRB=(ASKIP,NORM)                 00054   
S2SLOTH  DFHMDF LENGTH=0007,POS=(10,59),ATTRB=(ASKIP,DRK),INITIAL='SLOTX00055   
               # ='                                                     00056   
S2SLOT   DFHMDF LENGTH=7,POS=(10,67),ATTRB=(ASKIP,DRK,FSET)             00057   
         DFHMDF LENGTH=0029,POS=(11,5),ATTRB=(ASKIP,NORM),INITIAL='NORMX00058   
               AL NEWBORN OVERRIDE IND :'                               00059   
S2NNOVI  DFHMDF LENGTH=1,POS=(11,45),ATTRB=(UNPROT,NORM,FSET)           00060   
         DFHMDF LENGTH=1,POS=(11,47),ATTRB=(ASKIP,NORM)                 00061   
         DFHMDF LENGTH=0035,POS=(12,5),ATTRB=(ASKIP,NORM),INITIAL='TRANX00062   
               S-SEXUAL RESTR. OVERRIDE IND : '                         00063   
S2TXPRI  DFHMDF LENGTH=1,POS=(12,45),ATTRB=(UNPROT,NORM,FSET)           00064   
         DFHMDF LENGTH=1,POS=(12,47),ATTRB=(PROT,NORM)                  00065   
S2ERR    DFHMDF LENGTH=79,POS=(24,1),ATTRB=(PROT,BRT)                   00066   
         DFHMSD TYPE=FINAL                                              00067   
         END                                                            00068   
/*                                                                      00069   
