G7C1SET  DFHMSD TYPE=MAP,MODE=INOUT,LANG=COBOL,CTRL=FREEKB,DATA=FIELD,TX00001   
               IOAPFX=YES                                               00002   
G7C1I01  DFHMDI SIZE=(24,80)                                            00003   
S1FUNC   DFHMDF LENGTH=0004,POS=(1,1),ATTRB=(ASKIP,NORM,FSET),INITIAL='X00004   
               G7C1'                                                    00005   
S1TITLE  DFHMDF LENGTH=0032,POS=(1,20),ATTRB=(ASKIP,NORM),INITIAL='BENEX00006   
               FIT PROVISION TYPE C        '                            00007   
         DFHMDF LENGTH=0008,POS=(1,65),ATTRB=(ASKIP,NORM),INITIAL='SCREX00008   
               EN #'                                                    00009   
S1SCRN   DFHMDF LENGTH=0006,POS=(1,74),ATTRB=(ASKIP,NORM,FSET),INITIAL=X00010   
               '007C01'                                                 00011   
         DFHMDF LENGTH=0004,POS=(2,1),ATTRB=(ASKIP,NORM),INITIAL='PLN:' 00012   
S1PLNCD  DFHMDF LENGTH=3,POS=(2,6),ATTRB=(ASKIP,NORM,FSET)              00013   
         DFHMDF LENGTH=0004,POS=(2,10),ATTRB=(ASKIP,NORM),INITIAL='GRP:X00014   
               '                                                        00015   
S1GRPNO  DFHMDF LENGTH=9,POS=(2,15),ATTRB=(ASKIP,NORM,FSET)             00016   
         DFHMDF LENGTH=0004,POS=(2,26),ATTRB=(ASKIP,NORM),INITIAL='SEC:X00017   
               '                                                        00018   
S1SECNO  DFHMDF LENGTH=5,POS=(2,31),ATTRB=(ASKIP,NORM,FSET)             00019   
         DFHMDF LENGTH=0004,POS=(2,37),ATTRB=(ASKIP,NORM),INITIAL='PKG:X00020   
               '                                                        00021   
S1PKGCD  DFHMDF LENGTH=3,POS=(2,42),ATTRB=(ASKIP,NORM,FSET)             00022   
         DFHMDF LENGTH=0004,POS=(2,46),ATTRB=(ASKIP,NORM),INITIAL='LOB:X00023   
               '                                                        00024   
S1LOB    DFHMDF LENGTH=1,POS=(2,51),ATTRB=(ASKIP,NORM,FSET)             00025   
         DFHMDF LENGTH=0004,POS=(2,53),ATTRB=(ASKIP,NORM),INITIAL='PRV:X00026   
               '                                                        00027   
S1PRV    DFHMDF LENGTH=2,POS=(2,58),ATTRB=(ASKIP,NORM,FSET)             00028   
         DFHMDF LENGTH=0003,POS=(2,61),ATTRB=(ASKIP,NORM),INITIAL='FR:' 00029   
S1FRL    DFHMDF LENGTH=2,POS=(2,65),ATTRB=(ASKIP,NORM,FSET)             00030   
         DFHMDF LENGTH=0005,POS=(2,68),ATTRB=(ASKIP,NORM),INITIAL='EFDTX00031   
               :'                                                       00032   
S1EFFDT  DFHMDF LENGTH=6,POS=(2,74),ATTRB=(ASKIP,NORM,FSET)             00033   
         DFHMDF LENGTH=0011,POS=(3,65),ATTRB=(ASKIP,NORM),INITIAL='PAGEX00034   
                4 OF 5'                                                 00035   
         DFHMDF LENGTH=0018,POS=(4,9),ATTRB=(ASKIP,NORM),INITIAL='BENEFX00036   
               IT SCOPE ID :'                                           00037   
S1BESCI  DFHMDF LENGTH=4,POS=(4,53),ATTRB=(UNPROT,NORM,IC,FSET),JUSTIFYX00038   
               =(LEFT,BLANK)                                            00039   
         DFHMDF LENGTH=1,POS=(4,58),ATTRB=(ASKIP,NORM)                  00040   
         DFHMDF LENGTH=0021,POS=(5,9),ATTRB=(ASKIP,NORM),INITIAL='EXCEPX00041   
               TION SCHED. ID :'                                        00042   
S1EXCSC  DFHMDF LENGTH=4,POS=(5,53),ATTRB=(UNPROT,NORM,FSET),JUSTIFY=(LX00043   
               EFT,BLANK)                                               00044   
         DFHMDF LENGTH=1,POS=(5,58),ATTRB=(ASKIP,NORM)                  00045   
         DFHMDF LENGTH=0031,POS=(6,9),ATTRB=(ASKIP,NORM),INITIAL='ELIG.X00046   
                METHOD OF TREATMENT IND :'                              00047   
S1ELMTI  DFHMDF LENGTH=1,POS=(6,53),ATTRB=(UNPROT,NORM,FSET)            00048   
         DFHMDF LENGTH=1,POS=(6,55),ATTRB=(ASKIP,NORM)                  00049   
         DFHMDF LENGTH=0038,POS=(8,9),ATTRB=(ASKIP,NORM),INITIAL='MULTIX00050   
               -RELATED PROCEDURES PRICING IND :'                       00051   
S1MRPI   DFHMDF LENGTH=2,POS=(8,53),ATTRB=(UNPROT,NORM,FSET),JUSTIFY=(LX00052   
               EFT,BLANK)                                               00053   
         DFHMDF LENGTH=1,POS=(8,56),ATTRB=(ASKIP,NORM)                  00054   
         DFHMDF LENGTH=0032,POS=(9,9),ATTRB=(ASKIP,NORM),INITIAL='PRIMAX00055   
               RY SURGEON DEPENDENCY IND :'                             00056   
S1PSUDI  DFHMDF LENGTH=1,POS=(9,53),ATTRB=(UNPROT,NORM,FSET)            00057   
         DFHMDF LENGTH=1,POS=(9,55),ATTRB=(ASKIP,NORM)                  00058   
         DFHMDF LENGTH=0029,POS=(10,9),ATTRB=(ASKIP,NORM),INITIAL='HOSPX00059   
               ITAL STAFF PROVIDER IND :'                               00060   
S1HSTFP  DFHMDF LENGTH=1,POS=(10,53),ATTRB=(UNPROT,NORM,FSET)           00061   
         DFHMDF LENGTH=1,POS=(10,55),ATTRB=(ASKIP,NORM)                 00062   
         DFHMDF LENGTH=0022,POS=(11,9),ATTRB=(ASKIP,NORM),INITIAL='REPEX00063   
               AT PROCEDURE IND :'                                      00064   
S1RPTPR  DFHMDF LENGTH=1,POS=(11,53),ATTRB=(UNPROT,NORM,FSET)           00065   
         DFHMDF LENGTH=1,POS=(11,55),ATTRB=(ASKIP,NORM)                 00066   
         DFHMDF LENGTH=0007,POS=(11,62),ATTRB=(ASKIP,NORM),INITIAL='BPVX00067   
               ID ='                                                    00068   
S1BPVID  DFHMDF LENGTH=6,POS=(11,70),ATTRB=(ASKIP,NORM,FSET)            00069   
S1SLOTH  DFHMDF LENGTH=0007,POS=(12,62),ATTRB=(ASKIP,DRK),INITIAL='SLOTX00070   
               # ='                                                     00071   
S1SLOT   DFHMDF LENGTH=7,POS=(12,70),ATTRB=(ASKIP,DRK,FSET)             00072   
         DFHMDF LENGTH=0025,POS=(13,9),ATTRB=(ASKIP,NORM),INITIAL='MINIX00073   
               MUM ELIGIBLE AMOUNT :'                                   00074   
S1MNAMT  DFHMDF LENGTH=6,POS=(13,53),ATTRB=(UNPROT,NORM,FSET),JUSTIFY=(X00075   
               RIGHT,ZERO)                                              00076   
         DFHMDF LENGTH=1,POS=(13,60),ATTRB=(ASKIP,NORM)                 00077   
         DFHMDF LENGTH=0019,POS=(16,9),ATTRB=(ASKIP,NORM),INITIAL='CORRX00078   
               IDOR OVERRIDE :'                                         00079   
S1COROR  DFHMDF LENGTH=1,POS=(16,53),ATTRB=(UNPROT,NORM,FSET)           00080   
         DFHMDF LENGTH=1,POS=(16,55),ATTRB=(ASKIP,NORM)                 00081   
         DFHMDF LENGTH=0040,POS=(17,9),ATTRB=(ASKIP,NORM),INITIAL='MULTX00082   
               I-UNRELATED PROCEDURES PRICING IND :'                    00083   
S1SMPPI  DFHMDF LENGTH=1,POS=(17,53),ATTRB=(UNPROT,NORM,FSET)           00084   
         DFHMDF LENGTH=1,POS=(17,55),ATTRB=(ASKIP,NORM)                 00085   
         DFHMDF LENGTH=0039,POS=(18,9),ATTRB=(ASKIP,NORM),INITIAL='MULTX00086   
               I-INJURY PRICING MODIFICATION IND :'                     00087   
S1MIJPM  DFHMDF LENGTH=1,POS=(18,53),ATTRB=(UNPROT,NORM,FSET)           00088   
         DFHMDF LENGTH=1,POS=(18,55),ATTRB=(PROT,NORM)                  00089   
S1ERR    DFHMDF LENGTH=79,POS=(24,1),ATTRB=(PROT,BRT)                   00090   
         DFHMSD TYPE=FINAL                                              00091   
         END                                                            00092   
/*                                                                      00093   
