G7W1SET  DFHMSD TYPE=MAP,MODE=INOUT,LANG=COBOL,CTRL=FREEKB,DATA=FIELD,TX00001   
               IOAPFX=YES                                               00002   
G7W1I01  DFHMDI SIZE=(24,80)                                            00003   
S1FUNC   DFHMDF LENGTH=0004,POS=(1,1),ATTRB=(ASKIP,NORM,FSET),INITIAL='X00004   
               G7W1'                                                    00005   
S1TITLE  DFHMDF LENGTH=0032,POS=(1,20),ATTRB=(ASKIP,NORM),INITIAL='BENEX00006   
               FIT PROVISION TYPE W        '                            00007   
         DFHMDF LENGTH=0008,POS=(1,65),ATTRB=(ASKIP,NORM),INITIAL='SCREX00008   
               EN #'                                                    00009   
S1SCRN   DFHMDF LENGTH=0006,POS=(1,74),ATTRB=(ASKIP,NORM,FSET),INITIAL=X00010   
               '007W01'                                                 00011   
         DFHMDF LENGTH=0004,POS=(2,1),ATTRB=(ASKIP,NORM),INITIAL='PLN:' 00012   
S1PLNCD  DFHMDF LENGTH=3,POS=(2,6),ATTRB=(ASKIP,NORM,FSET)              00013   
         DFHMDF LENGTH=0004,POS=(2,10),ATTRB=(ASKIP,NORM),INITIAL='GRP:X00014   
               '                                                        00015   
S1GRPNO  DFHMDF LENGTH=9,POS=(2,15),ATTRB=(ASKIP,NORM,FSET)             00016   
         DFHMDF LENGTH=0004,POS=(2,26),ATTRB=(ASKIP,NORM),INITIAL='SEC:X00017   
               '                                                        00018   
S1SECNO  DFHMDF LENGTH=5,POS=(2,31),ATTRB=(ASKIP,NORM,FSET)             00019   
         DFHMDF LENGTH=0004,POS=(2,37),ATTRB=(ASKIP,NORM),INITIAL='PKG:X00020   
               '                                                        00021   
S1PKGCD  DFHMDF LENGTH=3,POS=(2,42),ATTRB=(ASKIP,NORM,FSET)             00022   
         DFHMDF LENGTH=0004,POS=(2,46),ATTRB=(ASKIP,NORM),INITIAL='LOB:X00023   
               '                                                        00024   
S1LOB    DFHMDF LENGTH=1,POS=(2,51),ATTRB=(ASKIP,NORM,FSET)             00025   
         DFHMDF LENGTH=0004,POS=(2,53),ATTRB=(ASKIP,NORM),INITIAL='PRV:X00026   
               '                                                        00027   
S1PRV    DFHMDF LENGTH=2,POS=(2,58),ATTRB=(ASKIP,NORM,FSET)             00028   
         DFHMDF LENGTH=0003,POS=(2,61),ATTRB=(ASKIP,NORM),INITIAL='FR:' 00029   
S1FRL    DFHMDF LENGTH=2,POS=(2,65),ATTRB=(ASKIP,NORM,FSET)             00030   
         DFHMDF LENGTH=0005,POS=(2,68),ATTRB=(ASKIP,NORM),INITIAL='EFDTX00031   
               :'                                                       00032   
S1EFFDT  DFHMDF LENGTH=6,POS=(2,74),ATTRB=(ASKIP,NORM,FSET)             00033   
         DFHMDF LENGTH=0011,POS=(3,65),ATTRB=(ASKIP,NORM),INITIAL='PAGEX00034   
                4 OF 5'                                                 00035   
         DFHMDF LENGTH=0041,POS=(7,7),ATTRB=(ASKIP,NORM),INITIAL='HOSPIX00036   
               TAL ADMISSION RESTRICTION IND :     '                    00037   
S1HADMR  DFHMDF LENGTH=1,POS=(7,50),ATTRB=(UNPROT,NORM,IC,FSET)         00038   
         DFHMDF LENGTH=1,POS=(7,52),ATTRB=(ASKIP,NORM)                  00039   
         DFHMDF LENGTH=0011,POS=(8,7),ATTRB=(ASKIP,NORM),INITIAL='STAY X00040   
               CODE :'                                                  00041   
S1STYCD  DFHMDF LENGTH=3,POS=(8,50),ATTRB=(UNPROT,NORM,FSET),JUSTIFY=(RX00042   
               IGHT,ZERO)                                               00043   
         DFHMDF LENGTH=1,POS=(8,54),ATTRB=(ASKIP,NORM)                  00044   
         DFHMDF LENGTH=0037,POS=(9,7),ATTRB=(ASKIP,NORM),INITIAL='HOSPIX00045   
               TAL CONDITION RELATIONSHIP IND :'                        00046   
S1HCNDR  DFHMDF LENGTH=1,POS=(9,50),ATTRB=(UNPROT,NORM,FSET)            00047   
         DFHMDF LENGTH=1,POS=(9,52),ATTRB=(ASKIP,NORM)                  00048   
         DFHMDF LENGTH=0026,POS=(11,7),ATTRB=(ASKIP,NORM),INITIAL='DAYSX00049   
                REDUCTION RATIO IND :'                                  00050   
S1RDDYI  DFHMDF LENGTH=1,POS=(11,50),ATTRB=(UNPROT,NORM,FSET)           00051   
         DFHMDF LENGTH=1,POS=(11,52),ATTRB=(ASKIP,NORM)                 00052   
         DFHMDF LENGTH=0028,POS=(12,10),ATTRB=(ASKIP,NORM),INITIAL='DAYX00053   
               S REDUCTION RATIO BASIC :'                               00054   
S1DRRB1  DFHMDF LENGTH=4,POS=(12,50),ATTRB=(UNPROT,NORM,FSET),JUSTIFY=(X00055   
               RIGHT,ZERO)                                              00056   
         DFHMDF LENGTH=0001,POS=(12,55),ATTRB=(ASKIP,NORM),INITIAL=':'  00057   
S1DRRB2  DFHMDF LENGTH=4,POS=(12,57),ATTRB=(UNPROT,NORM,FSET),JUSTIFY=(X00058   
               RIGHT,ZERO)                                              00059   
         DFHMDF LENGTH=1,POS=(12,62),ATTRB=(ASKIP,NORM)                 00060   
         DFHMDF LENGTH=0032,POS=(13,10),ATTRB=(ASKIP,NORM),INITIAL='DAYX00061   
               S REDUCTION RATIO SECONDARY :'                           00062   
S1DRRS1  DFHMDF LENGTH=4,POS=(13,50),ATTRB=(UNPROT,NORM,FSET),JUSTIFY=(X00063   
               RIGHT,ZERO)                                              00064   
         DFHMDF LENGTH=0001,POS=(13,55),ATTRB=(ASKIP,NORM),INITIAL=':'  00065   
S1DRRS2  DFHMDF LENGTH=4,POS=(13,57),ATTRB=(UNPROT,NORM,FSET),JUSTIFY=(X00066   
               RIGHT,ZERO)                                              00067   
         DFHMDF LENGTH=1,POS=(13,62),ATTRB=(ASKIP,NORM)                 00068   
         DFHMDF LENGTH=0038,POS=(15,7),ATTRB=(ASKIP,NORM),INITIAL='HOSPX00069   
               ITAL ADMISSION  RESTRICTION DAYS :'                      00070   
S1HADRD  DFHMDF LENGTH=3,POS=(15,50),ATTRB=(UNPROT,NORM,FSET),JUSTIFY=(X00071   
               RIGHT,ZERO)                                              00072   
         DFHMDF LENGTH=1,POS=(15,54),ATTRB=(ASKIP,NORM)                 00073   
         DFHMDF LENGTH=0038,POS=(16,7),ATTRB=(ASKIP,NORM),INITIAL='DRUGX00074   
                ELIGIBLE MEMBER OVERRIDE IND :   '                      00075   
S1DECOI  DFHMDF LENGTH=1,POS=(16,50),ATTRB=(UNPROT,NORM,FSET)           00076   
         DFHMDF LENGTH=1,POS=(16,52),ATTRB=(ASKIP,NORM)                 00077   
         DFHMDF LENGTH=0041,POS=(17,7),ATTRB=(ASKIP,NORM),INITIAL='ALCOX00078   
               HOL ELIGIBLE MEMBER OVERRIDE IND :   '                   00079   
S1AECOI  DFHMDF LENGTH=1,POS=(17,50),ATTRB=(UNPROT,NORM,FSET)           00080   
         DFHMDF LENGTH=1,POS=(17,52),ATTRB=(ASKIP,NORM)                 00081   
         DFHMDF LENGTH=0007,POS=(17,62),ATTRB=(ASKIP,NORM),INITIAL='BPVX00082   
               ID ='                                                    00083   
S1BPVID  DFHMDF LENGTH=6,POS=(17,70),ATTRB=(ASKIP,NORM,FSET)            00084   
S1SLOTH  DFHMDF LENGTH=0007,POS=(18,62),ATTRB=(ASKIP,DRK),INITIAL='SLOTX00085   
               # ='                                                     00086   
S1SLOT   DFHMDF LENGTH=7,POS=(18,70),ATTRB=(ASKIP,DRK,FSET)             00087   
         DFHMDF LENGTH=0035,POS=(20,7),ATTRB=(ASKIP,NORM),INITIAL='NORMX00088   
               AL NEWBORN OVERRIDE INDICATOR :'                         00089   
S1NNOI   DFHMDF LENGTH=1,POS=(20,50),ATTRB=(UNPROT,NORM,FSET)           00090   
         DFHMDF LENGTH=1,POS=(20,52),ATTRB=(ASKIP,NORM)                 00091   
         DFHMDF LENGTH=0035,POS=(21,7),ATTRB=(ASKIP,NORM),INITIAL='STAYX00092   
                CODE INDICATOR :              '                         00093   
S1SCDI   DFHMDF LENGTH=1,POS=(21,50),ATTRB=(UNPROT,NORM,FSET)           00094   
         DFHMDF LENGTH=1,POS=(21,52),ATTRB=(ASKIP,NORM)                 00095   
         DFHMDF LENGTH=0035,POS=(22,7),ATTRB=(ASKIP,NORM),INITIAL='TRANX00096   
               S-SEXUAL RESTR. OVERRIDE IND. :'                         00097   
S1TRSI   DFHMDF LENGTH=1,POS=(22,50),ATTRB=(UNPROT,NORM,FSET)           00098   
         DFHMDF LENGTH=1,POS=(22,52),ATTRB=(PROT,NORM)                  00099   
S1ERR    DFHMDF LENGTH=79,POS=(24,1),ATTRB=(PROT,BRT)                   00100   
         DFHMSD TYPE=FINAL                                              00101   
         END                                                            00102   
/*                                                                      00103   
