G7W2SET  DFHMSD TYPE=MAP,MODE=INOUT,LANG=COBOL,CTRL=FREEKB,DATA=FIELD,TX00001   
               IOAPFX=YES                                               00002   
G7W2I01  DFHMDI SIZE=(24,80)                                            00003   
S2FUNC   DFHMDF LENGTH=0004,POS=(1,1),ATTRB=(ASKIP,NORM,FSET),INITIAL='X00004   
               G7W2'                                                    00005   
S2TITLE  DFHMDF LENGTH=0032,POS=(1,20),ATTRB=(ASKIP,NORM),INITIAL='BENEX00006   
               FIT PROVISION TYPE W        '                            00007   
         DFHMDF LENGTH=0008,POS=(1,65),ATTRB=(ASKIP,NORM),INITIAL='SCREX00008   
               EN #'                                                    00009   
S2SCRN   DFHMDF LENGTH=0006,POS=(1,74),ATTRB=(ASKIP,NORM,FSET),INITIAL=X00010   
               '007W02'                                                 00011   
         DFHMDF LENGTH=0004,POS=(2,1),ATTRB=(ASKIP,NORM),INITIAL='PLN:' 00012   
S2PLNCD  DFHMDF LENGTH=3,POS=(2,6),ATTRB=(ASKIP,NORM,FSET)              00013   
         DFHMDF LENGTH=0004,POS=(2,10),ATTRB=(ASKIP,NORM),INITIAL='GRP:X00014   
               '                                                        00015   
S2GRPNO  DFHMDF LENGTH=9,POS=(2,15),ATTRB=(ASKIP,NORM,FSET)             00016   
         DFHMDF LENGTH=0004,POS=(2,26),ATTRB=(ASKIP,NORM),INITIAL='SEC:X00017   
               '                                                        00018   
S2SECNO  DFHMDF LENGTH=5,POS=(2,31),ATTRB=(ASKIP,NORM,FSET)             00019   
         DFHMDF LENGTH=0004,POS=(2,37),ATTRB=(ASKIP,NORM),INITIAL='PKG:X00020   
               '                                                        00021   
S2PKGCD  DFHMDF LENGTH=3,POS=(2,42),ATTRB=(ASKIP,NORM,FSET)             00022   
         DFHMDF LENGTH=0004,POS=(2,46),ATTRB=(ASKIP,NORM),INITIAL='LOB:X00023   
               '                                                        00024   
S2LOB    DFHMDF LENGTH=1,POS=(2,51),ATTRB=(ASKIP,NORM,FSET)             00025   
         DFHMDF LENGTH=0004,POS=(2,53),ATTRB=(ASKIP,NORM),INITIAL='PRV:X00026   
               '                                                        00027   
S2PRV    DFHMDF LENGTH=2,POS=(2,58),ATTRB=(ASKIP,NORM,FSET)             00028   
         DFHMDF LENGTH=0003,POS=(2,61),ATTRB=(ASKIP,NORM),INITIAL='FR:' 00029   
S2FRL    DFHMDF LENGTH=2,POS=(2,65),ATTRB=(ASKIP,NORM,FSET)             00030   
         DFHMDF LENGTH=0005,POS=(2,68),ATTRB=(ASKIP,NORM),INITIAL='EFDTX00031   
               :'                                                       00032   
S2EFFDT  DFHMDF LENGTH=6,POS=(2,74),ATTRB=(ASKIP,NORM,FSET)             00033   
         DFHMDF LENGTH=0011,POS=(3,65),ATTRB=(ASKIP,NORM),INITIAL='PAGEX00034   
                5 OF 5'                                                 00035   
         DFHMDF LENGTH=0027,POS=(6,7),ATTRB=(ASKIP,NORM),INITIAL='FLAT-X00036   
               RATE PER-DIEM AMOUNT :'                                  00037   
S2FLPDY  DFHMDF LENGTH=8,POS=(6,51),ATTRB=(UNPROT,NORM,IC,FSET),JUSTIFYX00038   
               =(RIGHT,ZERO)                                            00039   
         DFHMDF LENGTH=1,POS=(6,60),ATTRB=(ASKIP,NORM)                  00040   
         DFHMDF LENGTH=0037,POS=(8,7),ATTRB=(ASKIP,NORM),INITIAL='ADDITX00041   
               IONAL ALLOWANCE AMOUNT PER DAY :'                        00042   
S2ADALD  DFHMDF LENGTH=6,POS=(8,51),ATTRB=(UNPROT,NORM,FSET),JUSTIFY=(RX00043   
               IGHT,ZERO)                                               00044   
         DFHMDF LENGTH=1,POS=(8,58),ATTRB=(ASKIP,NORM)                  00045   
         DFHMDF LENGTH=0038,POS=(10,7),ATTRB=(ASKIP,NORM),INITIAL='CERTX00046   
               IFICATION REPETITION REQUIR. IND :'                      00047   
S2RRCER  DFHMDF LENGTH=1,POS=(10,51),ATTRB=(UNPROT,NORM,FSET)           00048   
         DFHMDF LENGTH=1,POS=(10,53),ATTRB=(ASKIP,NORM)                 00049   
         DFHMDF LENGTH=0007,POS=(11,62),ATTRB=(ASKIP,NORM),INITIAL='BPVX00050   
               ID ='                                                    00051   
S2BPVID  DFHMDF LENGTH=6,POS=(11,70),ATTRB=(ASKIP,NORM,FSET)            00052   
         DFHMDF LENGTH=0033,POS=(12,7),ATTRB=(ASKIP,NORM),INITIAL='TREAX00053   
               TMENT TIME FACTOR INDICATOR :'                           00054   
S2TRTMI  DFHMDF LENGTH=1,POS=(12,51),ATTRB=(UNPROT,NORM,FSET)           00055   
         DFHMDF LENGTH=1,POS=(12,53),ATTRB=(ASKIP,NORM)                 00056   
S2SLOTH  DFHMDF LENGTH=0007,POS=(12,62),ATTRB=(ASKIP,DRK),INITIAL='SLOTX00057   
               # ='                                                     00058   
S2SLOT   DFHMDF LENGTH=7,POS=(12,70),ATTRB=(ASKIP,DRK,FSET)             00059   
         DFHMDF LENGTH=0023,POS=(13,7),ATTRB=(ASKIP,NORM),INITIAL='TREAX00060   
               TMENT TIME FACTOR :'                                     00061   
S2TRTMF  DFHMDF LENGTH=3,POS=(13,51),ATTRB=(UNPROT,NORM,FSET),JUSTIFY=(X00062   
               RIGHT,ZERO)                                              00063   
         DFHMDF LENGTH=1,POS=(13,55),ATTRB=(ASKIP,NORM)                 00064   
         DFHMDF LENGTH=0041,POS=(15,7),ATTRB=(ASKIP,NORM),INITIAL='ELIGX00065   
               IBLE METHODS OF TREATMENT INDICATOR :'                   00066   
S2ELMTI  DFHMDF LENGTH=1,POS=(15,51),ATTRB=(UNPROT,NORM,FSET)           00067   
         DFHMDF LENGTH=1,POS=(15,53),ATTRB=(ASKIP,NORM)                 00068   
         DFHMDF LENGTH=0025,POS=(17,7),ATTRB=(ASKIP,NORM),INITIAL='PHYSX00069   
               ICAL EXAM INDICATOR :'                                   00070   
S2PHEXI  DFHMDF LENGTH=1,POS=(17,51),ATTRB=(UNPROT,NORM,FSET)           00071   
         DFHMDF LENGTH=1,POS=(17,53),ATTRB=(ASKIP,NORM)                 00072   
         DFHMDF LENGTH=0042,POS=(20,7),ATTRB=(ASKIP,NORM),INITIAL='REHAX00073   
               BILITATION ADMISSION RESTRICTION IND :'                  00074   
S2RHARI  DFHMDF LENGTH=1,POS=(20,51),ATTRB=(UNPROT,NORM,FSET)           00075   
         DFHMDF LENGTH=1,POS=(20,53),ATTRB=(PROT,NORM)                  00076   
S2ERR    DFHMDF LENGTH=79,POS=(24,1),ATTRB=(PROT,BRT)                   00077   
         DFHMSD TYPE=FINAL                                              00078   
         END                                                            00079   
/*                                                                      00080   
