GA1ESET  DFHMSD TYPE=MAP,MODE=INOUT,LANG=COBOL,CTRL=FREEKB,DATA=FIELD,TX00001   
               IOAPFX=YES                                               00002   
GA1EI01  DFHMDI SIZE=(24,80)                                            00003   
FUNCTON  DFHMDF LENGTH=0004,POS=(1,1),ATTRB=(PROT,NORM,FSET),INITIAL='GX00004   
               A1E'                                                     00005   
CDEIND   DFHMDF LENGTH=5,POS=(1,6),ATTRB=(ASKIP,BRT,FSET)               00006   
TTLELNE  DFHMDF LENGTH=42,POS=(1,12),ATTRB=(ASKIP,NORM,FSET)            00007   
DELADD   DFHMDF LENGTH=0007,POS=(1,57),ATTRB=(ASKIP,NORM,FSET),INITIAL=X00008   
               'CHG/DEL'                                                00009   
         DFHMDF LENGTH=0008,POS=(1,65),ATTRB=(ASKIP,NORM),INITIAL='SCREX00010   
               EN #'                                                    00011   
SCRNIDN  DFHMDF LENGTH=0006,POS=(1,74),ATTRB=(ASKIP,NORM,FSET),INITIAL=X00012   
               '001E00'                                                 00013   
         DFHMDF LENGTH=0020,POS=(2,28),ATTRB=(ASKIP,NORM),INITIAL='OUT-X00014   
               OF-POCKET LIMITS'                                        00015   
         DFHMDF LENGTH=0008,POS=(2,59),ATTRB=(ASKIP,NORM),INITIAL='TABUX00016   
               LAR:'                                                    00017   
COCURAN  DFHMDF LENGTH=2,POS=(2,68),ATTRB=(ASKIP,NORM)                  00018   
         DFHMDF LENGTH=0002,POS=(2,71),ATTRB=(ASKIP,NORM),INITIAL='OF'  00019   
TOCURAN  DFHMDF LENGTH=2,POS=(2,74),ATTRB=(ASKIP,NORM)                  00020   
IDLINE   DFHMDF LENGTH=79,POS=(3,1),ATTRB=(ASKIP,NORM,FSET)             00021   
         DFHMDF LENGTH=0011,POS=(4,16),ATTRB=(ASKIP,NORM),INITIAL='TABUX00022   
               LAR ID='                                                 00023   
TABID    DFHMDF LENGTH=6,POS=(4,28),ATTRB=(ASKIP,NORM,FSET)             00024   
         DFHMDF LENGTH=0008,POS=(4,35),ATTRB=(ASKIP,NORM),INITIAL='SLOTX00025   
                NO='                                                    00026   
TABSLTN  DFHMDF LENGTH=7,POS=(4,44),ATTRB=(ASKIP,NORM,FSET)             00027   
OENTCTR  DFHMDF LENGTH=7,POS=(4,55),ATTRB=(ASKIP,DRK,FSET)              00028   
FRMNUID  DFHMDF LENGTH=4,POS=(4,65),ATTRB=(ASKIP,DRK,FSET)              00029   
         DFHMDF LENGTH=0015,POS=(5,1),ATTRB=(ASKIP,NORM),INITIAL='DAY FX00030   
               ACTOR IND:'                                              00031   
DAYFACI  DFHMDF LENGTH=1,POS=(5,17),ATTRB=(UNPROT,NORM,IC,FSET)         00032   
         DFHMDF LENGTH=1,POS=(5,19),ATTRB=(ASKIP,NORM)                  00033   
         DFHMDF LENGTH=0014,POS=(5,31),ATTRB=(ASKIP,NORM),INITIAL='ADD X00034   
               TO/OVERLAY'                                              00035   
ADDTOVR  DFHMDF LENGTH=1,POS=(5,46),ATTRB=(UNPROT,NORM,FSET)            00036   
         DFHMDF LENGTH=1,POS=(5,48),ATTRB=(ASKIP,NORM)                  00037   
DLOPTLT  DFHMDF LENGTH=0013,POS=(6,1),ATTRB=(ASKIP,NORM),INITIAL='DELETX00038   
               E OPTION'                                                00039   
DELOPTN  DFHMDF LENGTH=1,POS=(6,15),ATTRB=(UNPROT,NORM,FSET)            00040   
         DFHMDF LENGTH=1,POS=(6,17),ATTRB=(ASKIP,NORM)                  00041   
         DFHMDF LENGTH=0010,POS=(6,35),ATTRB=(ASKIP,NORM),INITIAL='DEFIX00042   
               NITION'                                                  00043   
DEFINTN  DFHMDF LENGTH=1,POS=(6,46),ATTRB=(UNPROT,NORM,FSET)            00044   
         DFHMDF LENGTH=1,POS=(6,48),ATTRB=(ASKIP,NORM)                  00045   
         DFHMDF LENGTH=0017,POS=(6,59),ATTRB=(ASKIP,NORM),INITIAL='CARRX00046   
               Y-OVER CREDIT'                                           00047   
CARYOVR  DFHMDF LENGTH=1,POS=(6,77),ATTRB=(UNPROT,NORM,FSET)            00048   
         DFHMDF LENGTH=1,POS=(6,79),ATTRB=(ASKIP,NORM)                  00049   
PERIOT   DFHMDF LENGTH=0014,POS=(7,1),ATTRB=(ASKIP,NORM),INITIAL='BENEFX00050   
               IT PERIOD'                                               00051   
PERIOD   DFHMDF LENGTH=2,POS=(7,21),ATTRB=(UNPROT,NORM,FSET),JUSTIFY=(LX00052   
               EFT,BLANK)                                               00053   
         DFHMDF LENGTH=1,POS=(7,24),ATTRB=(ASKIP,NORM)                  00054   
         DFHMDF LENGTH=0016,POS=(7,29),ATTRB=(ASKIP,NORM),INITIAL='PERIX00055   
               OD TIME QUAL'                                            00056   
PERTQAL  DFHMDF LENGTH=1,POS=(7,46),ATTRB=(UNPROT,NORM,FSET)            00057   
         DFHMDF LENGTH=1,POS=(7,48),ATTRB=(ASKIP,NORM)                  00058   
         DFHMDF LENGTH=0018,POS=(7,58),ATTRB=(ASKIP,NORM),INITIAL='PERIX00059   
               OD TIME FACTOR'                                          00060   
PRTIMEF  DFHMDF LENGTH=3,POS=(7,77),ATTRB=(UNPROT,NORM,FSET),JUSTIFY=(RX00061   
               IGHT,ZERO)                                               00062   
         DFHMDF LENGTH=0013,POS=(8,1),ATTRB=(ASKIP,NORM),INITIAL='INTERX00063   
               VAL TYPE'                                                00064   
INTTYPE  DFHMDF LENGTH=2,POS=(8,21),ATTRB=(UNPROT,NORM,FSET),JUSTIFY=(LX00065   
               EFT,BLANK)                                               00066   
         DFHMDF LENGTH=1,POS=(8,24),ATTRB=(ASKIP,NORM)                  00067   
         DFHMDF LENGTH=0017,POS=(8,28),ATTRB=(ASKIP,NORM),INITIAL='INTEX00068   
               RVAL TIME FAC'                                           00069   
INTRVAL  DFHMDF LENGTH=3,POS=(8,46),ATTRB=(UNPROT,NORM,FSET),JUSTIFY=(RX00070   
               IGHT,ZERO)                                               00071   
         DFHMDF LENGTH=1,POS=(8,50),ATTRB=(ASKIP,NORM)                  00072   
         DFHMDF LENGTH=0017,POS=(8,59),ATTRB=(ASKIP,NORM),INITIAL='INTEX00073   
               RVAL OVRD IND'                                           00074   
OVRDIND  DFHMDF LENGTH=1,POS=(8,77),ATTRB=(UNPROT,NORM,FSET)            00075   
         DFHMDF LENGTH=1,POS=(8,79),ATTRB=(ASKIP,NORM)                  00076   
         DFHMDF LENGTH=0019,POS=(9,1),ATTRB=(ASKIP,NORM),INITIAL='INTERX00077   
               VAL OVRD VALUE'                                          00078   
NEWVALU  DFHMDF LENGTH=5,POS=(9,21),ATTRB=(UNPROT,NORM,FSET),JUSTIFY=(RX00079   
               IGHT,ZERO)                                               00080   
         DFHMDF LENGTH=1,POS=(9,27),ATTRB=(ASKIP,NORM)                  00081   
         DFHMDF LENGTH=0011,POS=(9,34),ATTRB=(ASKIP,NORM),INITIAL='VALUX00082   
               E LIMIT'                                                 00083   
OPXVALU  DFHMDF LENGTH=10,POS=(9,46),ATTRB=(UNPROT,NORM,FSET),JUSTIFY=(X00084   
               RIGHT,ZERO)                                              00085   
         DFHMDF LENGTH=1,POS=(9,57),ATTRB=(ASKIP,NORM)                  00086   
OPXVLQT  DFHMDF LENGTH=0015,POS=(9,61),ATTRB=(ASKIP,NORM),INITIAL='VALUX00087   
               E QUALIFIER'                                             00088   
OPXVLQL  DFHMDF LENGTH=1,POS=(9,77),ATTRB=(UNPROT,NORM,FSET)            00089   
         DFHMDF LENGTH=1,POS=(9,79),ATTRB=(ASKIP,NORM)                  00090   
LOT      DFHMDF LENGTH=0006,POS=(10,1),ATTRB=(ASKIP,NORM),INITIAL='L.O.X00091   
               B.'                                                      00092   
LOB      DFHMDF LENGTH=1,POS=(10,21),ATTRB=(UNPROT,NORM,FSET)           00093   
         DFHMDF LENGTH=1,POS=(10,23),ATTRB=(ASKIP,NORM)                 00094   
PLCTRTT  DFHMDF LENGTH=0018,POS=(10,27),ATTRB=(ASKIP,NORM),INITIAL='PLAX00095   
               CE OF TREATMENT'                                         00096   
PLCTRMT  DFHMDF LENGTH=2,POS=(10,46),ATTRB=(UNPROT,NORM,FSET),JUSTIFY=(X00097   
               LEFT,BLANK)                                              00098   
         DFHMDF LENGTH=1,POS=(10,49),ATTRB=(ASKIP,NORM)                 00099   
FAMINDT  DFHMDF LENGTH=0012,POS=(10,64),ATTRB=(ASKIP,NORM),INITIAL='FAMX00100   
               ILY/INDIV'                                               00101   
FAMINDI  DFHMDF LENGTH=1,POS=(10,77),ATTRB=(UNPROT,NORM,FSET)           00102   
         DFHMDF LENGTH=1,POS=(10,79),ATTRB=(ASKIP,NORM)                 00103   
SRVGRUT  DFHMDF LENGTH=0013,POS=(11,1),ATTRB=(ASKIP,NORM),INITIAL='SERVX00104   
               ICE GROUP'                                               00105   
SRVGRUP  DFHMDF LENGTH=2,POS=(11,21),ATTRB=(UNPROT,NORM,FSET),JUSTIFY=(X00106   
               LEFT,BLANK)                                              00107   
         DFHMDF LENGTH=1,POS=(11,24),ATTRB=(ASKIP,NORM)                 00108   
PERCETT  DFHMDF LENGTH=0013,POS=(11,32),ATTRB=(ASKIP,NORM),INITIAL='PERX00109   
               CENT LEVEL'                                              00110   
PERCENT  DFHMDF LENGTH=3,POS=(11,46),ATTRB=(UNPROT,NORM,FSET),JUSTIFY=(X00111   
               RIGHT,ZERO)                                              00112   
         DFHMDF LENGTH=1,POS=(11,50),ATTRB=(ASKIP,NORM)                 00113   
         DFHMDF LENGTH=0017,POS=(11,59),ATTRB=(ASKIP,NORM),INITIAL='ASCX00114   
               END-OR-DESCEND'                                          00115   
ASCDSCD  DFHMDF LENGTH=1,POS=(11,77),ATTRB=(UNPROT,NORM,FSET)           00116   
         DFHMDF LENGTH=1,POS=(11,79),ATTRB=(ASKIP,NORM)                 00117   
         DFHMDF LENGTH=0019,POS=(12,1),ATTRB=(ASKIP,NORM),INITIAL='CLAIX00118   
               M LVL ACCUM IND'                                         00119   
CLAI     DFHMDF LENGTH=1,POS=(12,21),ATTRB=(UNPROT,NORM,FSET)           00120   
         DFHMDF LENGTH=1,POS=(12,23),ATTRB=(ASKIP,NORM)                 00121   
CSTCOTT  DFHMDF LENGTH=0020,POS=(12,25),ATTRB=(ASKIP,NORM),INITIAL='COSX00122   
               T CONTAINMENT IND'                                       00123   
CSTCONT  DFHMDF LENGTH=2,POS=(12,46),ATTRB=(UNPROT,NORM,FSET),JUSTIFY=(X00124   
               LEFT,BLANK)                                              00125   
         DFHMDF LENGTH=1,POS=(12,49),ATTRB=(ASKIP,NORM)                 00126   
COPAYIT  DFHMDF LENGTH=0010,POS=(12,66),ATTRB=(ASKIP,NORM),INITIAL='CO-X00127   
               PAY IND'                                                 00128   
COPAYIN  DFHMDF LENGTH=1,POS=(12,77),ATTRB=(UNPROT,NORM,FSET)           00129   
         DFHMDF LENGTH=1,POS=(12,79),ATTRB=(ASKIP,NORM)                 00130   
         DFHMDF LENGTH=0019,POS=(13,1),ATTRB=(ASKIP,NORM),INITIAL='FYI X00131   
               FIELD VALUE:   '                                         00132   
FYIVAL   DFHMDF LENGTH=3,POS=(13,21),ATTRB=(UNPROT,NORM,FSET)           00133   
         DFHMDF LENGTH=1,POS=(13,25),ATTRB=(ASKIP,NORM)                 00134   
INTDEST  DFHMDF LENGTH=0022,POS=(13,27),ATTRB=(ASKIP,NORM),INITIAL='INTX00135   
               ERNAL DESCRIPTOR : '                                     00136   
INTDESK  DFHMDF LENGTH=9,POS=(13,50),ATTRB=(UNPROT,NORM,FSET)           00137   
         DFHMDF LENGTH=1,POS=(13,60),ATTRB=(ASKIP,NORM)                 00138   
         DFHMDF LENGTH=0009,POS=(14,38),ATTRB=(ASKIP,NORM),INITIAL='CONX00139   
               DITION'                                                  00140   
         DFHMDF LENGTH=0007,POS=(14,48),ATTRB=(ASKIP,NORM),INITIAL='BENX00256   
               TYP:'                                                    00257   
BENTYP   DFHMDF LENGTH=5,POS=(14,56),ATTRB=(UNPROT,NORM,FSET)           00258   
         DFHMDF LENGTH=0005,POS=(14,62),ATTRB=(ASKIP,NORM),INITIAL='TIEX00256   
               R:'                                                      00257   
TIERCD   DFHMDF LENGTH=4,POS=(14,68),ATTRB=(UNPROT,NORM,FSET)           00258   
         DFHMDF LENGTH=0004,POS=(14,73),ATTRB=(ASKIP,NORM),INITIAL='LVLX00256   
               :'                                                       00257   
TIERLV   DFHMDF LENGTH=1,POS=(14,78),ATTRB=(UNPROT,NORM,FSET)           00258   
CONDTG1  DFHMDF LENGTH=0035,POS=(15,1),ATTRB=(ASKIP,NORM),INITIAL='ALL X00141   
               EXC ICD TB  MEN DRG ALC OBC OBN'                         00142   
CONDTG2  DFHMDF LENGTH=0031,POS=(15,37),ATTRB=(ASKIP,NORM),INITIAL='MALX00143   
                CAR OBS KDY ACC PEC NEM    '                            00144   
CONDALL  DFHMDF LENGTH=1,POS=(16,2),ATTRB=(UNPROT,NORM,FSET),JUSTIFY=(RX00145   
               IGHT,ZERO)                                               00146   
         DFHMDF LENGTH=1,POS=(16,4),ATTRB=(ASKIP,NORM)                  00147   
CONDEXC  DFHMDF LENGTH=1,POS=(16,6),ATTRB=(UNPROT,NORM,FSET),JUSTIFY=(RX00148   
               IGHT,ZERO)                                               00149   
         DFHMDF LENGTH=1,POS=(16,8),ATTRB=(ASKIP,NORM)                  00150   
CONDICD  DFHMDF LENGTH=1,POS=(16,10),ATTRB=(UNPROT,NORM,FSET),JUSTIFY=(X00151   
               RIGHT,ZERO)                                              00152   
         DFHMDF LENGTH=1,POS=(16,12),ATTRB=(ASKIP,NORM)                 00153   
CONDTAB  DFHMDF LENGTH=1,POS=(16,14),ATTRB=(UNPROT,NORM,FSET),JUSTIFY=(X00154   
               RIGHT,ZERO)                                              00155   
         DFHMDF LENGTH=1,POS=(16,16),ATTRB=(ASKIP,NORM)                 00156   
CONDMEN  DFHMDF LENGTH=1,POS=(16,18),ATTRB=(UNPROT,NORM,FSET),JUSTIFY=(X00157   
               RIGHT,ZERO)                                              00158   
         DFHMDF LENGTH=1,POS=(16,20),ATTRB=(ASKIP,NORM)                 00159   
CONDDRG  DFHMDF LENGTH=1,POS=(16,22),ATTRB=(UNPROT,NORM,FSET),JUSTIFY=(X00160   
               RIGHT,ZERO)                                              00161   
         DFHMDF LENGTH=1,POS=(16,24),ATTRB=(ASKIP,NORM)                 00162   
CONDALC  DFHMDF LENGTH=1,POS=(16,26),ATTRB=(UNPROT,NORM,FSET),JUSTIFY=(X00163   
               RIGHT,ZERO)                                              00164   
         DFHMDF LENGTH=1,POS=(16,28),ATTRB=(ASKIP,NORM)                 00165   
CONDOBC  DFHMDF LENGTH=1,POS=(16,30),ATTRB=(UNPROT,NORM,FSET),JUSTIFY=(X00166   
               RIGHT,ZERO)                                              00167   
         DFHMDF LENGTH=1,POS=(16,32),ATTRB=(ASKIP,NORM)                 00168   
CONDOBN  DFHMDF LENGTH=1,POS=(16,34),ATTRB=(UNPROT,NORM,FSET),JUSTIFY=(X00169   
               RIGHT,ZERO)                                              00170   
         DFHMDF LENGTH=1,POS=(16,36),ATTRB=(ASKIP,NORM)                 00171   
CONDMAL  DFHMDF LENGTH=1,POS=(16,38),ATTRB=(UNPROT,NORM,FSET),JUSTIFY=(X00172   
               RIGHT,ZERO)                                              00173   
         DFHMDF LENGTH=1,POS=(16,40),ATTRB=(ASKIP,NORM)                 00174   
CONDCAR  DFHMDF LENGTH=1,POS=(16,42),ATTRB=(UNPROT,NORM,FSET),JUSTIFY=(X00175   
               RIGHT,ZERO)                                              00176   
         DFHMDF LENGTH=1,POS=(16,44),ATTRB=(ASKIP,NORM)                 00177   
CONDOBS  DFHMDF LENGTH=1,POS=(16,46),ATTRB=(UNPROT,NORM,FSET),JUSTIFY=(X00178   
               RIGHT,ZERO)                                              00179   
         DFHMDF LENGTH=1,POS=(16,48),ATTRB=(ASKIP,NORM)                 00180   
CONDKDY  DFHMDF LENGTH=1,POS=(16,50),ATTRB=(UNPROT,NORM,FSET),JUSTIFY=(X00181   
               RIGHT,ZERO)                                              00182   
         DFHMDF LENGTH=1,POS=(16,52),ATTRB=(ASKIP,NORM)                 00183   
CONDACC  DFHMDF LENGTH=1,POS=(16,54),ATTRB=(UNPROT,NORM,FSET),JUSTIFY=(X00184   
               RIGHT,ZERO)                                              00185   
         DFHMDF LENGTH=1,POS=(16,56),ATTRB=(ASKIP,NORM)                 00186   
CONDPEC  DFHMDF LENGTH=1,POS=(16,58),ATTRB=(UNPROT,NORM,FSET),JUSTIFY=(X00187   
               RIGHT,ZERO)                                              00188   
         DFHMDF LENGTH=1,POS=(16,60),ATTRB=(ASKIP,NORM)                 00189   
CONDNEM  DFHMDF LENGTH=1,POS=(16,62),ATTRB=(UNPROT,NORM,FSET),JUSTIFY=(X00190   
               RIGHT,ZERO)                                              00191   
         DFHMDF LENGTH=1,POS=(16,64),ATTRB=(ASKIP,NORM)                 00192   
         DFHMDF LENGTH=0006,POS=(18,1),ATTRB=(ASKIP,NORM),INITIAL='OPTIX00193   
               ON'                                                      00194   
         DFHMDF LENGTH=0002,POS=(18,17),ATTRB=(ASKIP,NORM),INITIAL='ID' 00195   
         DFHMDF LENGTH=0006,POS=(18,26),ATTRB=(ASKIP,NORM),INITIAL='SLOX00196   
               T #'                                                     00197   
         DFHMDF LENGTH=0011,POS=(18,54),ATTRB=(ASKIP,NORM),INITIAL='DESX00198   
               CRIPTION'                                                00199   
INTROPT  DFHMDF LENGTH=0005,POS=(19,1),ATTRB=(ASKIP,NORM),INITIAL='C M X00200   
               S'                                                       00201   
DELOLIT  DFHMDF LENGTH=1,POS=(19,7),ATTRB=(ASKIP,NORM)                  00202   
IBGROPT  DFHMDF LENGTH=1,POS=(20,4),ATTRB=(UNPROT,NORM,FSET)            00203   
         DFHMDF LENGTH=1,POS=(20,6),ATTRB=(ASKIP,NORM)                  00204   
IBGRID   DFHMDF LENGTH=0006,POS=(20,15),ATTRB=(ASKIP,NORM),INITIAL='#IBX00205   
               GR '                                                     00206   
IBGRSLT  DFHMDF LENGTH=7,POS=(20,25),ATTRB=(ASKIP,NORM,FSET)            00207   
         DFHMDF LENGTH=0037,POS=(20,41),ATTRB=(ASKIP,NORM),INITIAL='BENX00208   
               EFIT-GROUP BY BENEFIT-PROVISION ID'                      00209   
IPGNOPT  DFHMDF LENGTH=1,POS=(21,4),ATTRB=(UNPROT,NORM,FSET)            00210   
         DFHMDF LENGTH=1,POS=(21,6),ATTRB=(ASKIP,NORM)                  00211   
IPGNID   DFHMDF LENGTH=0006,POS=(21,15),ATTRB=(ASKIP,NORM),INITIAL='#IPX00212   
               GN '                                                     00213   
IPGNSLT  DFHMDF LENGTH=7,POS=(21,25),ATTRB=(ASKIP,NORM,FSET)            00214   
         DFHMDF LENGTH=0034,POS=(21,41),ATTRB=(ASKIP,NORM),INITIAL='PROX00215   
               VIDER-GROUP BY PROVIDER NUMBERS'                         00216   
IPGTOPT  DFHMDF LENGTH=1,POS=(22,4),ATTRB=(UNPROT,NORM,FSET)            00217   
         DFHMDF LENGTH=1,POS=(22,6),ATTRB=(ASKIP,NORM)                  00218   
IPGTID   DFHMDF LENGTH=0006,POS=(22,15),ATTRB=(ASKIP,NORM),INITIAL='#IPX00219   
               GT '                                                     00220   
IPGTSLT  DFHMDF LENGTH=7,POS=(22,25),ATTRB=(ASKIP,NORM,FSET)            00221   
         DFHMDF LENGTH=0031,POS=(22,41),ATTRB=(ASKIP,NORM),INITIAL='PROX00222   
               VIDER-GROUP BY PROVIDER-TYPE'                            00223   
MFRMLIT  DFHMDF LENGTH=0015,POS=(23,1),ATTRB=(ASKIP,NORM),INITIAL='MAP X00224   
               FROM SLOT #'                                             00225   
MFRMSLT  DFHMDF LENGTH=7,POS=(23,17),ATTRB=(UNPROT,NORM,NUM,FSET),JUSTIX00226   
               FY=(RIGHT,ZERO)                                          00227   
         DFHMDF LENGTH=1,POS=(23,25),ATTRB=(ASKIP,NORM)                 00228   
ERRMSG   DFHMDF LENGTH=79,POS=(24,1),ATTRB=(PROT,BRT)                   00229   
         DFHMSD TYPE=FINAL                                              00230   
         END                                                            00231   
/*                                                                      00232   
