GA1FSET  DFHMSD TYPE=MAP,MODE=INOUT,LANG=COBOL,CTRL=FREEKB,DATA=FIELD,TX00001   
               IOAPFX=YES                                               00002   
GA1FI01  DFHMDI SIZE=(24,80)                                            00003   
FUNCTON  DFHMDF LENGTH=0004,POS=(1,1),ATTRB=(PROT,NORM,FSET),INITIAL='GX00004   
               A1F'                                                     00005   
TTLELNE  DFHMDF LENGTH=47,POS=(1,10),ATTRB=(ASKIP,NORM,FSET)            00006   
         DFHMDF LENGTH=0003,POS=(1,61),ATTRB=(ASKIP,NORM),INITIAL='DEL' 00007   
         DFHMDF LENGTH=0008,POS=(1,65),ATTRB=(ASKIP,NORM),INITIAL='SCREX00008   
               EN #'                                                    00009   
SCRNIDN  DFHMDF LENGTH=0006,POS=(1,74),ATTRB=(ASKIP,NORM,FSET),INITIAL=X00010   
               '001F00'                                                 00011   
         DFHMDF LENGTH=0022,POS=(2,22),ATTRB=(ASKIP,NORM),INITIAL='ANCIX00012   
               LLARY RELATIONSHIP'                                      00013   
IDLINE   DFHMDF LENGTH=79,POS=(3,1),ATTRB=(ASKIP,NORM,FSET)             00014   
         DFHMDF LENGTH=0021,POS=(4,1),ATTRB=(ASKIP,NORM),INITIAL='ALL LX00015   
               EVEL TABULAR ID='                                        00016   
ALTABID  DFHMDF LENGTH=6,POS=(4,23),ATTRB=(ASKIP,NORM,FSET)             00017   
         DFHMDF LENGTH=0030,POS=(4,33),ATTRB=(ASKIP,NORM),INITIAL='ALL X00018   
               LEVEL TABULAR SLOT NUMBER='                              00019   
ALTBSLT  DFHMDF LENGTH=7,POS=(4,64),ATTRB=(ASKIP,NORM,FSET)             00020   
FRMNUID  DFHMDF LENGTH=4,POS=(4,75),ATTRB=(ASKIP,DRK,FSET)              00021   
         DFHMDF LENGTH=0007,POS=(5,1),ATTRB=(ASKIP,BRT),INITIAL='SELECTX00022   
               :'                                                       00023   
SELECT   DFHMDF LENGTH=6,POS=(5,9),ATTRB=(UNPROT,NORM,IC,FSET)          00024   
         DFHMDF LENGTH=1,POS=(5,16),ATTRB=(ASKIP,NORM)                  00025   
SELECTF  DFHMDF LENGTH=0003,POS=(5,39),ATTRB=(PROT,NORM),INITIAL='___'  00026   
         DFHMDF LENGTH=0002,POS=(5,43),ATTRB=(ASKIP,BRT),INITIAL='TO'   00027   
SELECTT  DFHMDF LENGTH=0003,POS=(5,46),ATTRB=(PROT,NORM),INITIAL='___'  00028   
         DFHMDF LENGTH=0002,POS=(5,50),ATTRB=(ASKIP,BRT),INITIAL='OF'   00029   
SELECTO  DFHMDF LENGTH=0003,POS=(5,53),ATTRB=(PROT,NORM),INITIAL='___'  00030   
         DFHMDF LENGTH=0024,POS=(5,57),ATTRB=(ASKIP,BRT),INITIAL='BENEFX00031   
               IT CODES DISPLAYED '                                     00032   
         DFHMDF LENGTH=0006,POS=(6,4),ATTRB=(ASKIP,NORM),INITIAL='ACTIOX00033   
               N'                                                       00034   
         DFHMDF LENGTH=0007,POS=(6,16),ATTRB=(ASKIP,NORM),INITIAL='BENEX00035   
               FIT'                                                     00036   
         DFHMDF LENGTH=0006,POS=(6,30),ATTRB=(ASKIP,NORM),INITIAL='ACTIX00037   
               ON'                                                      00038   
         DFHMDF LENGTH=0007,POS=(6,42),ATTRB=(ASKIP,NORM),INITIAL='BENEX00039   
               FIT'                                                     00040   
         DFHMDF LENGTH=0006,POS=(6,56),ATTRB=(ASKIP,NORM),INITIAL='ACTIX00041   
               ON'                                                      00042   
         DFHMDF LENGTH=0007,POS=(6,68),ATTRB=(ASKIP,NORM),INITIAL='BENEX00043   
               FIT'                                                     00044   
         DFHMDF LENGTH=0004,POS=(7,5),ATTRB=(ASKIP,NORM),INITIAL='CODE' 00045   
         DFHMDF LENGTH=0004,POS=(7,17),ATTRB=(ASKIP,NORM),INITIAL='CODEX00046   
               '                                                        00047   
         DFHMDF LENGTH=0004,POS=(7,31),ATTRB=(ASKIP,NORM),INITIAL='CODEX00048   
               '                                                        00049   
         DFHMDF LENGTH=0004,POS=(7,43),ATTRB=(ASKIP,NORM),INITIAL='CODEX00050   
               '                                                        00051   
         DFHMDF LENGTH=0004,POS=(7,57),ATTRB=(ASKIP,NORM),INITIAL='CODEX00052   
               '                                                        00053   
         DFHMDF LENGTH=0004,POS=(7,69),ATTRB=(ASKIP,NORM),INITIAL='CODEX00054   
               '                                                        00055   
S1FAC1A  DFHMDF LENGTH=1,POS=(8,6),ATTRB=(UNPROT,NORM,FSET)             00056   
         DFHMDF LENGTH=1,POS=(8,8),ATTRB=(ASKIP,NORM)                   00057   
S1FBC1A  DFHMDF LENGTH=6,POS=(8,16),ATTRB=(ASKIP,NORM,FSET)             00058   
S1FAC2A  DFHMDF LENGTH=1,POS=(8,32),ATTRB=(UNPROT,NORM,FSET)            00059   
         DFHMDF LENGTH=1,POS=(8,34),ATTRB=(ASKIP,NORM)                  00060   
S1FBC2A  DFHMDF LENGTH=6,POS=(8,42),ATTRB=(ASKIP,NORM,FSET)             00061   
S1FAC3A  DFHMDF LENGTH=1,POS=(8,58),ATTRB=(UNPROT,NORM,FSET)            00062   
         DFHMDF LENGTH=1,POS=(8,60),ATTRB=(ASKIP,NORM)                  00063   
S1FBC3A  DFHMDF LENGTH=6,POS=(8,68),ATTRB=(ASKIP,NORM,FSET)             00064   
S1FAC1B  DFHMDF LENGTH=1,POS=(9,6),ATTRB=(UNPROT,NORM,FSET)             00065   
         DFHMDF LENGTH=1,POS=(9,8),ATTRB=(ASKIP,NORM)                   00066   
S1FBC1B  DFHMDF LENGTH=6,POS=(9,16),ATTRB=(ASKIP,NORM,FSET)             00067   
S1FAC2B  DFHMDF LENGTH=1,POS=(9,32),ATTRB=(UNPROT,NORM,FSET)            00068   
         DFHMDF LENGTH=1,POS=(9,34),ATTRB=(ASKIP,NORM)                  00069   
S1FBC2B  DFHMDF LENGTH=6,POS=(9,42),ATTRB=(ASKIP,NORM,FSET)             00070   
S1FAC3B  DFHMDF LENGTH=1,POS=(9,58),ATTRB=(UNPROT,NORM,FSET)            00071   
         DFHMDF LENGTH=1,POS=(9,60),ATTRB=(ASKIP,NORM)                  00072   
S1FBC3B  DFHMDF LENGTH=6,POS=(9,68),ATTRB=(ASKIP,NORM,FSET)             00073   
S1FAC1C  DFHMDF LENGTH=1,POS=(10,6),ATTRB=(UNPROT,NORM,FSET)            00074   
         DFHMDF LENGTH=1,POS=(10,8),ATTRB=(ASKIP,NORM)                  00075   
S1FBC1C  DFHMDF LENGTH=6,POS=(10,16),ATTRB=(ASKIP,NORM,FSET)            00076   
S1FAC2C  DFHMDF LENGTH=1,POS=(10,32),ATTRB=(UNPROT,NORM,FSET)           00077   
         DFHMDF LENGTH=1,POS=(10,34),ATTRB=(ASKIP,NORM)                 00078   
S1FBC2C  DFHMDF LENGTH=6,POS=(10,42),ATTRB=(ASKIP,NORM,FSET)            00079   
S1FAC3C  DFHMDF LENGTH=1,POS=(10,58),ATTRB=(UNPROT,NORM,FSET)           00080   
         DFHMDF LENGTH=1,POS=(10,60),ATTRB=(ASKIP,NORM)                 00081   
S1FBC3C  DFHMDF LENGTH=6,POS=(10,68),ATTRB=(ASKIP,NORM,FSET)            00082   
S1FAC1D  DFHMDF LENGTH=1,POS=(11,6),ATTRB=(UNPROT,NORM,FSET)            00083   
         DFHMDF LENGTH=1,POS=(11,8),ATTRB=(ASKIP,NORM)                  00084   
S1FBC1D  DFHMDF LENGTH=6,POS=(11,16),ATTRB=(ASKIP,NORM,FSET)            00085   
S1FAC2D  DFHMDF LENGTH=1,POS=(11,32),ATTRB=(UNPROT,NORM,FSET)           00086   
         DFHMDF LENGTH=1,POS=(11,34),ATTRB=(ASKIP,NORM)                 00087   
S1FBC2D  DFHMDF LENGTH=6,POS=(11,42),ATTRB=(ASKIP,NORM,FSET)            00088   
S1FAC3D  DFHMDF LENGTH=1,POS=(11,58),ATTRB=(UNPROT,NORM,FSET)           00089   
         DFHMDF LENGTH=1,POS=(11,60),ATTRB=(ASKIP,NORM)                 00090   
S1FBC3D  DFHMDF LENGTH=6,POS=(11,68),ATTRB=(ASKIP,NORM,FSET)            00091   
S1FAC1E  DFHMDF LENGTH=1,POS=(12,6),ATTRB=(UNPROT,NORM,FSET)            00092   
         DFHMDF LENGTH=1,POS=(12,8),ATTRB=(ASKIP,NORM)                  00093   
S1FBC1E  DFHMDF LENGTH=6,POS=(12,16),ATTRB=(ASKIP,NORM,FSET)            00094   
S1FAC2E  DFHMDF LENGTH=1,POS=(12,32),ATTRB=(UNPROT,NORM,FSET)           00095   
         DFHMDF LENGTH=1,POS=(12,34),ATTRB=(ASKIP,NORM)                 00096   
S1FBC2E  DFHMDF LENGTH=6,POS=(12,42),ATTRB=(ASKIP,NORM,FSET)            00097   
S1FAC3E  DFHMDF LENGTH=1,POS=(12,58),ATTRB=(UNPROT,NORM,FSET)           00098   
         DFHMDF LENGTH=1,POS=(12,60),ATTRB=(ASKIP,NORM)                 00099   
S1FBC3E  DFHMDF LENGTH=6,POS=(12,68),ATTRB=(ASKIP,NORM,FSET)            00100   
S1FAC1F  DFHMDF LENGTH=1,POS=(13,6),ATTRB=(UNPROT,NORM,FSET)            00101   
         DFHMDF LENGTH=1,POS=(13,8),ATTRB=(ASKIP,NORM)                  00102   
S1FBC1F  DFHMDF LENGTH=6,POS=(13,16),ATTRB=(ASKIP,NORM,FSET)            00103   
S1FAC2F  DFHMDF LENGTH=1,POS=(13,32),ATTRB=(UNPROT,NORM,FSET)           00104   
         DFHMDF LENGTH=1,POS=(13,34),ATTRB=(ASKIP,NORM)                 00105   
S1FBC2F  DFHMDF LENGTH=6,POS=(13,42),ATTRB=(ASKIP,NORM,FSET)            00106   
S1FAC3F  DFHMDF LENGTH=1,POS=(13,58),ATTRB=(UNPROT,NORM,FSET)           00107   
         DFHMDF LENGTH=1,POS=(13,60),ATTRB=(ASKIP,NORM)                 00108   
S1FBC3F  DFHMDF LENGTH=6,POS=(13,68),ATTRB=(ASKIP,NORM,FSET)            00109   
S1FAC1G  DFHMDF LENGTH=1,POS=(14,6),ATTRB=(UNPROT,NORM,FSET)            00110   
         DFHMDF LENGTH=1,POS=(14,8),ATTRB=(ASKIP,NORM)                  00111   
S1FBC1G  DFHMDF LENGTH=6,POS=(14,16),ATTRB=(ASKIP,NORM,FSET)            00112   
S1FAC2G  DFHMDF LENGTH=1,POS=(14,32),ATTRB=(UNPROT,NORM,FSET)           00113   
         DFHMDF LENGTH=1,POS=(14,34),ATTRB=(ASKIP,NORM)                 00114   
S1FBC2G  DFHMDF LENGTH=6,POS=(14,42),ATTRB=(ASKIP,NORM,FSET)            00115   
S1FAC3G  DFHMDF LENGTH=1,POS=(14,58),ATTRB=(UNPROT,NORM,FSET)           00116   
         DFHMDF LENGTH=1,POS=(14,60),ATTRB=(ASKIP,NORM)                 00117   
S1FBC3G  DFHMDF LENGTH=6,POS=(14,68),ATTRB=(ASKIP,NORM,FSET)            00118   
S1FAC1H  DFHMDF LENGTH=1,POS=(15,6),ATTRB=(UNPROT,NORM,FSET)            00119   
         DFHMDF LENGTH=1,POS=(15,8),ATTRB=(ASKIP,NORM)                  00120   
S1FBC1H  DFHMDF LENGTH=6,POS=(15,16),ATTRB=(ASKIP,NORM,FSET)            00121   
S1FAC2H  DFHMDF LENGTH=1,POS=(15,32),ATTRB=(UNPROT,NORM,FSET)           00122   
         DFHMDF LENGTH=1,POS=(15,34),ATTRB=(ASKIP,NORM)                 00123   
S1FBC2H  DFHMDF LENGTH=6,POS=(15,42),ATTRB=(ASKIP,NORM,FSET)            00124   
S1FAC3H  DFHMDF LENGTH=1,POS=(15,58),ATTRB=(UNPROT,NORM,FSET)           00125   
         DFHMDF LENGTH=1,POS=(15,60),ATTRB=(ASKIP,NORM)                 00126   
S1FBC3H  DFHMDF LENGTH=6,POS=(15,68),ATTRB=(ASKIP,NORM,FSET)            00127   
S1FAC1I  DFHMDF LENGTH=1,POS=(16,6),ATTRB=(UNPROT,NORM,FSET)            00128   
         DFHMDF LENGTH=1,POS=(16,8),ATTRB=(ASKIP,NORM)                  00129   
S1FBC1I  DFHMDF LENGTH=6,POS=(16,16),ATTRB=(ASKIP,NORM,FSET)            00130   
S1FAC2I  DFHMDF LENGTH=1,POS=(16,32),ATTRB=(UNPROT,NORM,FSET)           00131   
         DFHMDF LENGTH=1,POS=(16,34),ATTRB=(ASKIP,NORM)                 00132   
S1FBC2I  DFHMDF LENGTH=6,POS=(16,42),ATTRB=(ASKIP,NORM,FSET)            00133   
S1FAC3I  DFHMDF LENGTH=1,POS=(16,58),ATTRB=(UNPROT,NORM,FSET)           00134   
         DFHMDF LENGTH=1,POS=(16,60),ATTRB=(ASKIP,NORM)                 00135   
S1FBC3I  DFHMDF LENGTH=6,POS=(16,68),ATTRB=(ASKIP,NORM,FSET)            00136   
S1FAC1J  DFHMDF LENGTH=1,POS=(17,6),ATTRB=(UNPROT,NORM,FSET)            00137   
         DFHMDF LENGTH=1,POS=(17,8),ATTRB=(ASKIP,NORM)                  00138   
S1FBC1J  DFHMDF LENGTH=6,POS=(17,16),ATTRB=(ASKIP,NORM,FSET)            00139   
S1FAC2J  DFHMDF LENGTH=1,POS=(17,32),ATTRB=(UNPROT,NORM,FSET)           00140   
         DFHMDF LENGTH=1,POS=(17,34),ATTRB=(ASKIP,NORM)                 00141   
S1FBC2J  DFHMDF LENGTH=6,POS=(17,42),ATTRB=(ASKIP,NORM,FSET)            00142   
S1FAC3J  DFHMDF LENGTH=1,POS=(17,58),ATTRB=(UNPROT,NORM,FSET)           00143   
         DFHMDF LENGTH=1,POS=(17,60),ATTRB=(ASKIP,NORM)                 00144   
S1FBC3J  DFHMDF LENGTH=6,POS=(17,68),ATTRB=(ASKIP,NORM,FSET)            00145   
S1FAC1K  DFHMDF LENGTH=1,POS=(18,6),ATTRB=(UNPROT,NORM,FSET)            00146   
         DFHMDF LENGTH=1,POS=(18,8),ATTRB=(ASKIP,NORM)                  00147   
S1FBC1K  DFHMDF LENGTH=6,POS=(18,16),ATTRB=(ASKIP,NORM,FSET)            00148   
S1FAC2K  DFHMDF LENGTH=1,POS=(18,32),ATTRB=(UNPROT,NORM,FSET)           00149   
         DFHMDF LENGTH=1,POS=(18,34),ATTRB=(ASKIP,NORM)                 00150   
S1FBC2K  DFHMDF LENGTH=6,POS=(18,42),ATTRB=(ASKIP,NORM,FSET)            00151   
S1FAC3K  DFHMDF LENGTH=1,POS=(18,58),ATTRB=(UNPROT,NORM,FSET)           00152   
         DFHMDF LENGTH=1,POS=(18,60),ATTRB=(ASKIP,NORM)                 00153   
S1FBC3K  DFHMDF LENGTH=6,POS=(18,68),ATTRB=(ASKIP,NORM,FSET)            00154   
S1FAC1L  DFHMDF LENGTH=1,POS=(19,6),ATTRB=(UNPROT,NORM,FSET)            00155   
         DFHMDF LENGTH=1,POS=(19,8),ATTRB=(ASKIP,NORM)                  00156   
S1FBC1L  DFHMDF LENGTH=6,POS=(19,16),ATTRB=(ASKIP,NORM,FSET)            00157   
S1FAC2L  DFHMDF LENGTH=1,POS=(19,32),ATTRB=(UNPROT,NORM,FSET)           00158   
         DFHMDF LENGTH=1,POS=(19,34),ATTRB=(ASKIP,NORM)                 00159   
S1FBC2L  DFHMDF LENGTH=6,POS=(19,42),ATTRB=(ASKIP,NORM,FSET)            00160   
S1FAC3L  DFHMDF LENGTH=1,POS=(19,58),ATTRB=(UNPROT,NORM,FSET)           00161   
         DFHMDF LENGTH=1,POS=(19,60),ATTRB=(ASKIP,NORM)                 00162   
S1FBC3L  DFHMDF LENGTH=6,POS=(19,68),ATTRB=(ASKIP,NORM,FSET)            00163   
S1FAC1M  DFHMDF LENGTH=1,POS=(20,6),ATTRB=(UNPROT,NORM,FSET)            00164   
         DFHMDF LENGTH=1,POS=(20,8),ATTRB=(ASKIP,NORM)                  00165   
S1FBC1M  DFHMDF LENGTH=6,POS=(20,16),ATTRB=(ASKIP,NORM,FSET)            00166   
S1FAC2M  DFHMDF LENGTH=1,POS=(20,32),ATTRB=(UNPROT,NORM,FSET)           00167   
         DFHMDF LENGTH=1,POS=(20,34),ATTRB=(ASKIP,NORM)                 00168   
S1FBC2M  DFHMDF LENGTH=6,POS=(20,42),ATTRB=(ASKIP,NORM,FSET)            00169   
S1FAC3M  DFHMDF LENGTH=1,POS=(20,58),ATTRB=(UNPROT,NORM,FSET)           00170   
         DFHMDF LENGTH=1,POS=(20,60),ATTRB=(ASKIP,NORM)                 00171   
S1FBC3M  DFHMDF LENGTH=6,POS=(20,68),ATTRB=(ASKIP,NORM,FSET)            00172   
S1FAC1N  DFHMDF LENGTH=1,POS=(21,6),ATTRB=(UNPROT,NORM,FSET)            00173   
         DFHMDF LENGTH=1,POS=(21,8),ATTRB=(ASKIP,NORM)                  00174   
S1FBC1N  DFHMDF LENGTH=6,POS=(21,16),ATTRB=(ASKIP,NORM,FSET)            00175   
S1FAC2N  DFHMDF LENGTH=1,POS=(21,32),ATTRB=(UNPROT,NORM,FSET)           00176   
         DFHMDF LENGTH=1,POS=(21,34),ATTRB=(ASKIP,NORM)                 00177   
S1FBC2N  DFHMDF LENGTH=6,POS=(21,42),ATTRB=(ASKIP,NORM,FSET)            00178   
S1FAC3N  DFHMDF LENGTH=1,POS=(21,58),ATTRB=(UNPROT,NORM,FSET)           00179   
         DFHMDF LENGTH=1,POS=(21,60),ATTRB=(ASKIP,NORM)                 00180   
S1FBC3N  DFHMDF LENGTH=6,POS=(21,68),ATTRB=(ASKIP,NORM,FSET)            00181   
S1FAC1O  DFHMDF LENGTH=1,POS=(22,6),ATTRB=(UNPROT,NORM,FSET)            00182   
         DFHMDF LENGTH=1,POS=(22,8),ATTRB=(ASKIP,NORM)                  00183   
S1FBC1O  DFHMDF LENGTH=6,POS=(22,16),ATTRB=(ASKIP,NORM,FSET)            00184   
S1FAC2O  DFHMDF LENGTH=1,POS=(22,32),ATTRB=(UNPROT,NORM,FSET)           00185   
         DFHMDF LENGTH=1,POS=(22,34),ATTRB=(ASKIP,NORM)                 00186   
S1FBC2O  DFHMDF LENGTH=6,POS=(22,42),ATTRB=(ASKIP,NORM,FSET)            00187   
S1FAC3O  DFHMDF LENGTH=1,POS=(22,58),ATTRB=(UNPROT,NORM,FSET)           00188   
         DFHMDF LENGTH=1,POS=(22,60),ATTRB=(ASKIP,NORM)                 00189   
S1FBC3O  DFHMDF LENGTH=6,POS=(22,68),ATTRB=(ASKIP,NORM,FSET)            00190   
         DFHMDF LENGTH=0079,POS=(23,1),ATTRB=(ASKIP,NORM),INITIAL='PAGIX00191   
               NG:   PF7(BACKWARD) PF8(FORWARD) PF10(BOTTOM) PF11(TOP) X00192   
                                  '                                     00193   
ERRMSG   DFHMDF LENGTH=79,POS=(24,1),ATTRB=(PROT,BRT)                   00194   
         DFHMSD TYPE=FINAL                                              00195   
         END                                                            00196   
/*                                                                      00197   
