GA1HSET  DFHMSD TYPE=MAP,MODE=INOUT,LANG=COBOL,CTRL=FREEKB,DATA=FIELD,TX00001   
               IOAPFX=YES                                               00002   
GA1HI01  DFHMDI SIZE=(24,80)                                            00003   
FUNCTON  DFHMDF LENGTH=0004,POS=(1,1),ATTRB=(PROT,NORM,FSET),INITIAL='GX00004   
               A1H'                                                     00005   
TTLELNE  DFHMDF LENGTH=46,POS=(1,10),ATTRB=(ASKIP,NORM,FSET)            00006   
         DFHMDF LENGTH=0003,POS=(1,61),ATTRB=(ASKIP,NORM),INITIAL='DEL' 00007   
         DFHMDF LENGTH=0008,POS=(1,65),ATTRB=(ASKIP,NORM),INITIAL='SCREX00008   
               EN #'                                                    00009   
SCRNIDN  DFHMDF LENGTH=0006,POS=(1,74),ATTRB=(ASKIP,NORM,FSET),INITIAL=X00010   
               '001H00'                                                 00011   
         DFHMDF LENGTH=0034,POS=(2,16),ATTRB=(ASKIP,NORM),INITIAL='PROVX00012   
               IDER-GROUP BY PROVIDER NUMBERS'                          00013   
IDLINE   DFHMDF LENGTH=79,POS=(3,1),ATTRB=(ASKIP,NORM,FSET)             00014   
         DFHMDF LENGTH=0015,POS=(4,1),ATTRB=(ASKIP,NORM),INITIAL='ALL LX00015   
               VL TAB ID='                                              00016   
ALTABID  DFHMDF LENGTH=6,POS=(4,17),ATTRB=(ASKIP,NORM,FSET)             00017   
         DFHMDF LENGTH=0006,POS=(4,25),ATTRB=(ASKIP,NORM),INITIAL='SLT X00018   
               #='                                                      00019   
ALTBSLT  DFHMDF LENGTH=7,POS=(4,32),ATTRB=(ASKIP,NORM,FSET)             00020   
         DFHMDF LENGTH=0016,POS=(4,41),ATTRB=(ASKIP,NORM),INITIAL='INTEX00021   
               RNAL TAB ID='                                            00022   
INTABID  DFHMDF LENGTH=6,POS=(4,58),ATTRB=(ASKIP,NORM,FSET)             00023   
         DFHMDF LENGTH=0006,POS=(4,66),ATTRB=(ASKIP,NORM),INITIAL='SLT X00024   
               #='                                                      00025   
INTBSLT  DFHMDF LENGTH=7,POS=(4,73),ATTRB=(ASKIP,NORM,FSET)             00026   
         DFHMDF LENGTH=0027,POS=(5,1),ATTRB=(ASKIP,NORM),INITIAL='INCLUX00027   
               DE/EXCLUDE BY PROVIDER'                                  00028   
INCEXC   DFHMDF LENGTH=1,POS=(5,30),ATTRB=(ASKIP,NORM,FSET)             00029   
ADDELIN  DFHMDF LENGTH=1,POS=(5,41),ATTRB=(ASKIP,DRK,FSET)              00030   
ALTBFNC  DFHMDF LENGTH=4,POS=(5,49),ATTRB=(ASKIP,DRK,FSET)              00031   
OENTCTR  DFHMDF LENGTH=7,POS=(5,61),ATTRB=(ASKIP,DRK,FSET)              00032   
FRMNUID  DFHMDF LENGTH=4,POS=(5,75),ATTRB=(ASKIP,DRK,FSET)              00033   
         DFHMDF LENGTH=0006,POS=(7,3),ATTRB=(ASKIP,NORM),INITIAL='ACTIOX00034   
               N'                                                       00035   
         DFHMDF LENGTH=0015,POS=(7,11),ATTRB=(ASKIP,NORM),INITIAL='PROVX00036   
               IDER NUMBER'                                             00037   
         DFHMDF LENGTH=0006,POS=(7,29),ATTRB=(ASKIP,NORM),INITIAL='ACTIX00038   
               ON'                                                      00039   
         DFHMDF LENGTH=0015,POS=(7,37),ATTRB=(ASKIP,NORM),INITIAL='PROVX00040   
               IDER NUMBER'                                             00041   
         DFHMDF LENGTH=0006,POS=(7,55),ATTRB=(ASKIP,NORM),INITIAL='ACTIX00042   
               ON'                                                      00043   
         DFHMDF LENGTH=0015,POS=(7,63),ATTRB=(ASKIP,NORM),INITIAL='PROVX00044   
               IDER NUMBER'                                             00045   
         DFHMDF LENGTH=0004,POS=(8,4),ATTRB=(ASKIP,NORM),INITIAL='CODE' 00046   
         DFHMDF LENGTH=0008,POS=(8,14),ATTRB=(ASKIP,NORM),INITIAL='ARGUX00047   
               MENT'                                                    00048   
         DFHMDF LENGTH=0004,POS=(8,30),ATTRB=(ASKIP,NORM),INITIAL='CODEX00049   
               '                                                        00050   
         DFHMDF LENGTH=0008,POS=(8,40),ATTRB=(ASKIP,NORM),INITIAL='ARGUX00051   
               MENT'                                                    00052   
         DFHMDF LENGTH=0004,POS=(8,56),ATTRB=(ASKIP,NORM),INITIAL='CODEX00053   
               '                                                        00054   
         DFHMDF LENGTH=0008,POS=(8,66),ATTRB=(ASKIP,NORM),INITIAL='ARGUX00055   
               MENT'                                                    00056   
S1HAC1A  DFHMDF LENGTH=1,POS=(9,5),ATTRB=(UNPROT,NORM,IC,FSET)          00057   
         DFHMDF LENGTH=1,POS=(9,7),ATTRB=(ASKIP,NORM)                   00058   
S1HPN1A  DFHMDF LENGTH=10,POS=(9,13),ATTRB=(ASKIP,NORM,FSET)            00059   
S1HAC2A  DFHMDF LENGTH=1,POS=(9,31),ATTRB=(UNPROT,NORM,FSET)            00060   
         DFHMDF LENGTH=1,POS=(9,33),ATTRB=(ASKIP,NORM)                  00061   
S1HPN2A  DFHMDF LENGTH=10,POS=(9,39),ATTRB=(ASKIP,NORM,FSET)            00062   
S1HAC3A  DFHMDF LENGTH=1,POS=(9,57),ATTRB=(UNPROT,NORM,FSET)            00063   
         DFHMDF LENGTH=1,POS=(9,59),ATTRB=(ASKIP,NORM)                  00064   
S1HPN3A  DFHMDF LENGTH=10,POS=(9,65),ATTRB=(ASKIP,NORM,FSET)            00065   
S1HAC1B  DFHMDF LENGTH=1,POS=(10,5),ATTRB=(UNPROT,NORM,FSET)            00066   
         DFHMDF LENGTH=1,POS=(10,7),ATTRB=(ASKIP,NORM)                  00067   
S1HPN1B  DFHMDF LENGTH=10,POS=(10,13),ATTRB=(ASKIP,NORM,FSET)           00068   
S1HAC2B  DFHMDF LENGTH=1,POS=(10,31),ATTRB=(UNPROT,NORM,FSET)           00069   
         DFHMDF LENGTH=1,POS=(10,33),ATTRB=(ASKIP,NORM)                 00070   
S1HPN2B  DFHMDF LENGTH=10,POS=(10,39),ATTRB=(ASKIP,NORM,FSET)           00071   
S1HAC3B  DFHMDF LENGTH=1,POS=(10,57),ATTRB=(UNPROT,NORM,FSET)           00072   
         DFHMDF LENGTH=1,POS=(10,59),ATTRB=(ASKIP,NORM)                 00073   
S1HPN3B  DFHMDF LENGTH=10,POS=(10,65),ATTRB=(ASKIP,NORM,FSET)           00074   
S1HAC1C  DFHMDF LENGTH=1,POS=(11,5),ATTRB=(UNPROT,NORM,FSET)            00075   
         DFHMDF LENGTH=1,POS=(11,7),ATTRB=(ASKIP,NORM)                  00076   
S1HPN1C  DFHMDF LENGTH=10,POS=(11,13),ATTRB=(ASKIP,NORM,FSET)           00077   
S1HAC2C  DFHMDF LENGTH=1,POS=(11,31),ATTRB=(UNPROT,NORM,FSET)           00078   
         DFHMDF LENGTH=1,POS=(11,33),ATTRB=(ASKIP,NORM)                 00079   
S1HPN2C  DFHMDF LENGTH=10,POS=(11,39),ATTRB=(ASKIP,NORM,FSET)           00080   
S1HAC3C  DFHMDF LENGTH=1,POS=(11,57),ATTRB=(UNPROT,NORM,FSET)           00081   
         DFHMDF LENGTH=1,POS=(11,59),ATTRB=(ASKIP,NORM)                 00082   
S1HPN3C  DFHMDF LENGTH=10,POS=(11,65),ATTRB=(ASKIP,NORM,FSET)           00083   
S1HAC1D  DFHMDF LENGTH=1,POS=(12,5),ATTRB=(UNPROT,NORM,FSET)            00084   
         DFHMDF LENGTH=1,POS=(12,7),ATTRB=(ASKIP,NORM)                  00085   
S1HPN1D  DFHMDF LENGTH=10,POS=(12,13),ATTRB=(ASKIP,NORM,FSET)           00086   
S1HAC2D  DFHMDF LENGTH=1,POS=(12,31),ATTRB=(UNPROT,NORM,FSET)           00087   
         DFHMDF LENGTH=1,POS=(12,33),ATTRB=(ASKIP,NORM)                 00088   
S1HPN2D  DFHMDF LENGTH=10,POS=(12,39),ATTRB=(ASKIP,NORM,FSET)           00089   
S1HAC3D  DFHMDF LENGTH=1,POS=(12,57),ATTRB=(UNPROT,NORM,FSET)           00090   
         DFHMDF LENGTH=1,POS=(12,59),ATTRB=(ASKIP,NORM)                 00091   
S1HPN3D  DFHMDF LENGTH=10,POS=(12,65),ATTRB=(ASKIP,NORM,FSET)           00092   
S1HAC1E  DFHMDF LENGTH=1,POS=(13,5),ATTRB=(UNPROT,NORM,FSET)            00093   
         DFHMDF LENGTH=1,POS=(13,7),ATTRB=(ASKIP,NORM)                  00094   
S1HPN1E  DFHMDF LENGTH=10,POS=(13,13),ATTRB=(ASKIP,NORM,FSET)           00095   
S1HAC2E  DFHMDF LENGTH=1,POS=(13,31),ATTRB=(UNPROT,NORM,FSET)           00096   
         DFHMDF LENGTH=1,POS=(13,33),ATTRB=(ASKIP,NORM)                 00097   
S1HPN2E  DFHMDF LENGTH=10,POS=(13,39),ATTRB=(ASKIP,NORM,FSET)           00098   
S1HAC3E  DFHMDF LENGTH=1,POS=(13,57),ATTRB=(UNPROT,NORM,FSET)           00099   
         DFHMDF LENGTH=1,POS=(13,59),ATTRB=(ASKIP,NORM)                 00100   
S1HPN3E  DFHMDF LENGTH=10,POS=(13,65),ATTRB=(ASKIP,NORM,FSET)           00101   
S1HAC1F  DFHMDF LENGTH=1,POS=(14,5),ATTRB=(UNPROT,NORM,FSET)            00102   
         DFHMDF LENGTH=1,POS=(14,7),ATTRB=(ASKIP,NORM)                  00103   
S1HPN1F  DFHMDF LENGTH=10,POS=(14,13),ATTRB=(ASKIP,NORM,FSET)           00104   
S1HAC2F  DFHMDF LENGTH=1,POS=(14,31),ATTRB=(UNPROT,NORM,FSET)           00105   
         DFHMDF LENGTH=1,POS=(14,33),ATTRB=(ASKIP,NORM)                 00106   
S1HPN2F  DFHMDF LENGTH=10,POS=(14,39),ATTRB=(ASKIP,NORM,FSET)           00107   
S1HAC3F  DFHMDF LENGTH=1,POS=(14,57),ATTRB=(UNPROT,NORM,FSET)           00108   
         DFHMDF LENGTH=1,POS=(14,59),ATTRB=(ASKIP,NORM)                 00109   
S1HPN3F  DFHMDF LENGTH=10,POS=(14,65),ATTRB=(ASKIP,NORM,FSET)           00110   
S1HAC1G  DFHMDF LENGTH=1,POS=(15,5),ATTRB=(UNPROT,NORM,FSET)            00111   
         DFHMDF LENGTH=1,POS=(15,7),ATTRB=(ASKIP,NORM)                  00112   
S1HPN1G  DFHMDF LENGTH=10,POS=(15,13),ATTRB=(ASKIP,NORM,FSET)           00113   
S1HAC2G  DFHMDF LENGTH=1,POS=(15,31),ATTRB=(UNPROT,NORM,FSET)           00114   
         DFHMDF LENGTH=1,POS=(15,33),ATTRB=(ASKIP,NORM)                 00115   
S1HPN2G  DFHMDF LENGTH=10,POS=(15,39),ATTRB=(ASKIP,NORM,FSET)           00116   
S1HAC3G  DFHMDF LENGTH=1,POS=(15,57),ATTRB=(UNPROT,NORM,FSET)           00117   
         DFHMDF LENGTH=1,POS=(15,59),ATTRB=(ASKIP,NORM)                 00118   
S1HPN3G  DFHMDF LENGTH=10,POS=(15,65),ATTRB=(ASKIP,NORM,FSET)           00119   
S1HAC1H  DFHMDF LENGTH=1,POS=(16,5),ATTRB=(UNPROT,NORM,FSET)            00120   
         DFHMDF LENGTH=1,POS=(16,7),ATTRB=(ASKIP,NORM)                  00121   
S1HPN1H  DFHMDF LENGTH=10,POS=(16,13),ATTRB=(ASKIP,NORM,FSET)           00122   
S1HAC2H  DFHMDF LENGTH=1,POS=(16,31),ATTRB=(UNPROT,NORM,FSET)           00123   
         DFHMDF LENGTH=1,POS=(16,33),ATTRB=(ASKIP,NORM)                 00124   
S1HPN2H  DFHMDF LENGTH=10,POS=(16,39),ATTRB=(ASKIP,NORM,FSET)           00125   
S1HAC3H  DFHMDF LENGTH=1,POS=(16,57),ATTRB=(UNPROT,NORM,FSET)           00126   
         DFHMDF LENGTH=1,POS=(16,59),ATTRB=(ASKIP,NORM)                 00127   
S1HPN3H  DFHMDF LENGTH=10,POS=(16,65),ATTRB=(ASKIP,NORM,FSET)           00128   
S1HAC1I  DFHMDF LENGTH=1,POS=(17,5),ATTRB=(UNPROT,NORM,FSET)            00129   
         DFHMDF LENGTH=1,POS=(17,7),ATTRB=(ASKIP,NORM)                  00130   
S1HPN1I  DFHMDF LENGTH=10,POS=(17,13),ATTRB=(ASKIP,NORM,FSET)           00131   
S1HAC2I  DFHMDF LENGTH=1,POS=(17,31),ATTRB=(UNPROT,NORM,FSET)           00132   
         DFHMDF LENGTH=1,POS=(17,33),ATTRB=(ASKIP,NORM)                 00133   
S1HPN2I  DFHMDF LENGTH=10,POS=(17,39),ATTRB=(ASKIP,NORM,FSET)           00134   
S1HAC3I  DFHMDF LENGTH=1,POS=(17,57),ATTRB=(UNPROT,NORM,FSET)           00135   
         DFHMDF LENGTH=1,POS=(17,59),ATTRB=(ASKIP,NORM)                 00136   
S1HPN3I  DFHMDF LENGTH=10,POS=(17,65),ATTRB=(ASKIP,NORM,FSET)           00137   
S1HAC1J  DFHMDF LENGTH=1,POS=(18,5),ATTRB=(UNPROT,NORM,FSET)            00138   
         DFHMDF LENGTH=1,POS=(18,7),ATTRB=(ASKIP,NORM)                  00139   
S1HPN1J  DFHMDF LENGTH=10,POS=(18,13),ATTRB=(ASKIP,NORM,FSET)           00140   
S1HAC2J  DFHMDF LENGTH=1,POS=(18,31),ATTRB=(UNPROT,NORM,FSET)           00141   
         DFHMDF LENGTH=1,POS=(18,33),ATTRB=(ASKIP,NORM)                 00142   
S1HPN2J  DFHMDF LENGTH=10,POS=(18,39),ATTRB=(ASKIP,NORM,FSET)           00143   
S1HAC3J  DFHMDF LENGTH=1,POS=(18,57),ATTRB=(UNPROT,NORM,FSET)           00144   
         DFHMDF LENGTH=1,POS=(18,59),ATTRB=(ASKIP,NORM)                 00145   
S1HPN3J  DFHMDF LENGTH=10,POS=(18,65),ATTRB=(ASKIP,NORM,FSET)           00146   
S1HAC1K  DFHMDF LENGTH=1,POS=(19,5),ATTRB=(UNPROT,NORM,FSET)            00147   
         DFHMDF LENGTH=1,POS=(19,7),ATTRB=(ASKIP,NORM)                  00148   
S1HPN1K  DFHMDF LENGTH=10,POS=(19,13),ATTRB=(ASKIP,NORM,FSET)           00149   
S1HAC2K  DFHMDF LENGTH=1,POS=(19,31),ATTRB=(UNPROT,NORM,FSET)           00150   
         DFHMDF LENGTH=1,POS=(19,33),ATTRB=(ASKIP,NORM)                 00151   
S1HPN2K  DFHMDF LENGTH=10,POS=(19,39),ATTRB=(ASKIP,NORM,FSET)           00152   
S1HAC3K  DFHMDF LENGTH=1,POS=(19,57),ATTRB=(UNPROT,NORM,FSET)           00153   
         DFHMDF LENGTH=1,POS=(19,59),ATTRB=(ASKIP,NORM)                 00154   
S1HPN3K  DFHMDF LENGTH=10,POS=(19,65),ATTRB=(ASKIP,NORM,FSET)           00155   
S1HAC1L  DFHMDF LENGTH=1,POS=(20,5),ATTRB=(UNPROT,NORM,FSET)            00156   
         DFHMDF LENGTH=1,POS=(20,7),ATTRB=(ASKIP,NORM)                  00157   
S1HPN1L  DFHMDF LENGTH=10,POS=(20,13),ATTRB=(ASKIP,NORM,FSET)           00158   
S1HAC2L  DFHMDF LENGTH=1,POS=(20,31),ATTRB=(UNPROT,NORM,FSET)           00159   
         DFHMDF LENGTH=1,POS=(20,33),ATTRB=(ASKIP,NORM)                 00160   
S1HPN2L  DFHMDF LENGTH=10,POS=(20,39),ATTRB=(ASKIP,NORM,FSET)           00161   
S1HAC3L  DFHMDF LENGTH=1,POS=(20,57),ATTRB=(UNPROT,NORM,FSET)           00162   
         DFHMDF LENGTH=1,POS=(20,59),ATTRB=(ASKIP,NORM)                 00163   
S1HPN3L  DFHMDF LENGTH=10,POS=(20,65),ATTRB=(ASKIP,NORM,FSET)           00164   
S1HAC1M  DFHMDF LENGTH=1,POS=(21,5),ATTRB=(UNPROT,NORM,FSET)            00165   
         DFHMDF LENGTH=1,POS=(21,7),ATTRB=(ASKIP,NORM)                  00166   
S1HPN1M  DFHMDF LENGTH=10,POS=(21,13),ATTRB=(ASKIP,NORM,FSET)           00167   
S1HAC2M  DFHMDF LENGTH=1,POS=(21,31),ATTRB=(UNPROT,NORM,FSET)           00168   
         DFHMDF LENGTH=1,POS=(21,33),ATTRB=(ASKIP,NORM)                 00169   
S1HPN2M  DFHMDF LENGTH=10,POS=(21,39),ATTRB=(ASKIP,NORM,FSET)           00170   
S1HAC3M  DFHMDF LENGTH=1,POS=(21,57),ATTRB=(UNPROT,NORM,FSET)           00171   
         DFHMDF LENGTH=1,POS=(21,59),ATTRB=(ASKIP,NORM)                 00172   
S1HPN3M  DFHMDF LENGTH=10,POS=(21,65),ATTRB=(ASKIP,NORM,FSET)           00173   
S1HAC1N  DFHMDF LENGTH=1,POS=(22,5),ATTRB=(UNPROT,NORM,FSET)            00174   
         DFHMDF LENGTH=1,POS=(22,7),ATTRB=(ASKIP,NORM)                  00175   
S1HPN1N  DFHMDF LENGTH=10,POS=(22,13),ATTRB=(ASKIP,NORM,FSET)           00176   
S1HAC2N  DFHMDF LENGTH=1,POS=(22,31),ATTRB=(UNPROT,NORM,FSET)           00177   
         DFHMDF LENGTH=1,POS=(22,33),ATTRB=(ASKIP,NORM)                 00178   
S1HPN2N  DFHMDF LENGTH=10,POS=(22,39),ATTRB=(ASKIP,NORM,FSET)           00179   
S1HAC3N  DFHMDF LENGTH=1,POS=(22,57),ATTRB=(UNPROT,NORM,FSET)           00180   
         DFHMDF LENGTH=1,POS=(22,59),ATTRB=(ASKIP,NORM)                 00181   
S1HPN3N  DFHMDF LENGTH=10,POS=(22,65),ATTRB=(ASKIP,NORM,FSET)           00182   
ERRMSG   DFHMDF LENGTH=79,POS=(24,1),ATTRB=(PROT,BRT)                   00183   
         DFHMSD TYPE=FINAL                                              00184   
         END                                                            00185   
/*                                                                      00186   
