GA1MSET  DFHMSD TYPE=MAP,MODE=INOUT,LANG=COBOL,CTRL=FREEKB,DATA=FIELD,TX00001   
               IOAPFX=YES                                               00002   
GA1MI01  DFHMDI SIZE=(24,80)                                            00003   
FUNCTON  DFHMDF LENGTH=0004,POS=(1,1),ATTRB=(PROT,NORM,FSET),INITIAL='GX00004   
               A1M'                                                     00005   
TTLELNE  DFHMDF LENGTH=40,POS=(1,13),ATTRB=(ASKIP,NORM,FSET)            00006   
         DFHMDF LENGTH=0003,POS=(1,61),ATTRB=(ASKIP,NORM),INITIAL='DEL' 00007   
         DFHMDF LENGTH=0008,POS=(1,65),ATTRB=(ASKIP,NORM),INITIAL='SCREX00008   
               EN #'                                                    00009   
SCRNIDN  DFHMDF LENGTH=0006,POS=(1,74),ATTRB=(ASKIP,NORM,FSET),INITIAL=X00010   
               '001M00'                                                 00011   
         DFHMDF LENGTH=0017,POS=(2,25),ATTRB=(ASKIP,NORM),INITIAL='COSMX00012   
               ETIC SURGICAL'                                           00013   
IDLINE   DFHMDF LENGTH=79,POS=(3,1),ATTRB=(PROT,NORM,FSET)              00014   
         DFHMDF LENGTH=0021,POS=(4,1),ATTRB=(ASKIP,NORM),INITIAL='ALL LX00015   
               EVEL TABULAR ID='                                        00016   
ALTABID  DFHMDF LENGTH=6,POS=(4,23),ATTRB=(ASKIP,NORM,FSET)             00017   
         DFHMDF LENGTH=0030,POS=(4,33),ATTRB=(ASKIP,NORM),INITIAL='ALL X00018   
               LEVEL TABULAR SLOT NUMBER='                              00019   
ALTBSLT  DFHMDF LENGTH=7,POS=(4,64),ATTRB=(ASKIP,NORM,FSET)             00020   
FRMNUID  DFHMDF LENGTH=4,POS=(4,75),ATTRB=(ASKIP,DRK,FSET)              00021   
SELTXT1  DFHMDF LENGTH=0007,POS=(5,1),ATTRB=(ASKIP,BRT),INITIAL='SELECTX00022   
               :'                                                       00023   
SELECT   DFHMDF LENGTH=7,POS=(5,9),ATTRB=(UNPROT,NORM,IC,FSET)          00024   
         DFHMDF LENGTH=1,POS=(5,17),ATTRB=(ASKIP,NORM)                  00025   
SELECTF  DFHMDF LENGTH=0003,POS=(5,32),ATTRB=(PROT,NORM),INITIAL='___'  00026   
SELTXT2  DFHMDF LENGTH=0002,POS=(5,36),ATTRB=(ASKIP,BRT),INITIAL='TO'   00027   
SELECTT  DFHMDF LENGTH=0003,POS=(5,39),ATTRB=(PROT,NORM),INITIAL='___'  00028   
SELTXT3  DFHMDF LENGTH=0002,POS=(5,43),ATTRB=(ASKIP,BRT),INITIAL='OF'   00029   
SELECTO  DFHMDF LENGTH=0003,POS=(5,46),ATTRB=(PROT,NORM),INITIAL='___'  00030   
SELTXT4  DFHMDF LENGTH=0030,POS=(5,50),ATTRB=(ASKIP,BRT),INITIAL='PROCEX00031   
               DURE CODES DISPLAYED     '                               00032   
         DFHMDF LENGTH=0006,POS=(6,7),ATTRB=(ASKIP,NORM),INITIAL='ACTIOX00033   
               N'                                                       00034   
         DFHMDF LENGTH=0009,POS=(6,16),ATTRB=(ASKIP,NORM),INITIAL='PROCX00035   
               EDURE'                                                   00036   
         DFHMDF LENGTH=0011,POS=(6,28),ATTRB=(ASKIP,NORM),INITIAL='COMBX00037   
               INATION'                                                 00038   
         DFHMDF LENGTH=0006,POS=(6,44),ATTRB=(ASKIP,NORM),INITIAL='ACTIX00039   
               ON'                                                      00040   
         DFHMDF LENGTH=0009,POS=(6,53),ATTRB=(ASKIP,NORM),INITIAL='PROCX00041   
               EDURE'                                                   00042   
         DFHMDF LENGTH=0011,POS=(6,65),ATTRB=(ASKIP,NORM),INITIAL='COMBX00043   
               INATION'                                                 00044   
         DFHMDF LENGTH=0004,POS=(7,8),ATTRB=(ASKIP,NORM),INITIAL='CODE' 00045   
         DFHMDF LENGTH=0004,POS=(7,31),ATTRB=(ASKIP,NORM),INITIAL='CODEX00046   
               '                                                        00047   
         DFHMDF LENGTH=0004,POS=(7,45),ATTRB=(ASKIP,NORM),INITIAL='CODEX00048   
               '                                                        00049   
         DFHMDF LENGTH=0004,POS=(7,68),ATTRB=(ASKIP,NORM),INITIAL='CODEX00050   
               '                                                        00051   
S1MAC1A  DFHMDF LENGTH=1,POS=(8,9),ATTRB=(UNPROT,NORM,FSET)             00052   
         DFHMDF LENGTH=1,POS=(8,11),ATTRB=(ASKIP,NORM)                  00053   
S1MPA1A  DFHMDF LENGTH=7,POS=(8,17),ATTRB=(ASKIP,NORM,FSET)             00054   
S1MCF1A  DFHMDF LENGTH=3,POS=(8,32),ATTRB=(ASKIP,NORM,FSET)             00055   
S1MAC2A  DFHMDF LENGTH=1,POS=(8,46),ATTRB=(UNPROT,NORM,FSET)            00056   
         DFHMDF LENGTH=1,POS=(8,48),ATTRB=(ASKIP,NORM)                  00057   
S1MPA2A  DFHMDF LENGTH=7,POS=(8,54),ATTRB=(ASKIP,NORM,FSET)             00058   
S1MCF2A  DFHMDF LENGTH=3,POS=(8,69),ATTRB=(ASKIP,NORM,FSET)             00059   
S1MAC1B  DFHMDF LENGTH=1,POS=(9,9),ATTRB=(UNPROT,NORM,FSET)             00060   
         DFHMDF LENGTH=1,POS=(9,11),ATTRB=(ASKIP,NORM)                  00061   
S1MPA1B  DFHMDF LENGTH=7,POS=(9,17),ATTRB=(ASKIP,NORM,FSET)             00062   
S1MCF1B  DFHMDF LENGTH=3,POS=(9,32),ATTRB=(ASKIP,NORM,FSET)             00063   
S1MAC2B  DFHMDF LENGTH=1,POS=(9,46),ATTRB=(UNPROT,NORM,FSET)            00064   
         DFHMDF LENGTH=1,POS=(9,48),ATTRB=(ASKIP,NORM)                  00065   
S1MPA2B  DFHMDF LENGTH=7,POS=(9,54),ATTRB=(ASKIP,NORM,FSET)             00066   
S1MCF2B  DFHMDF LENGTH=3,POS=(9,69),ATTRB=(ASKIP,NORM,FSET)             00067   
S1MAC1C  DFHMDF LENGTH=1,POS=(10,9),ATTRB=(UNPROT,NORM,FSET)            00068   
         DFHMDF LENGTH=1,POS=(10,11),ATTRB=(ASKIP,NORM)                 00069   
S1MPA1C  DFHMDF LENGTH=7,POS=(10,17),ATTRB=(ASKIP,NORM,FSET)            00070   
S1MCF1C  DFHMDF LENGTH=3,POS=(10,32),ATTRB=(ASKIP,NORM,FSET)            00071   
S1MAC2C  DFHMDF LENGTH=1,POS=(10,46),ATTRB=(UNPROT,NORM,FSET)           00072   
         DFHMDF LENGTH=1,POS=(10,48),ATTRB=(ASKIP,NORM)                 00073   
S1MPA2C  DFHMDF LENGTH=7,POS=(10,54),ATTRB=(ASKIP,NORM,FSET)            00074   
S1MCF2C  DFHMDF LENGTH=3,POS=(10,69),ATTRB=(ASKIP,NORM,FSET)            00075   
S1MAC1D  DFHMDF LENGTH=1,POS=(11,9),ATTRB=(UNPROT,NORM,FSET)            00076   
         DFHMDF LENGTH=1,POS=(11,11),ATTRB=(ASKIP,NORM)                 00077   
S1MPA1D  DFHMDF LENGTH=7,POS=(11,17),ATTRB=(ASKIP,NORM,FSET)            00078   
S1MCF1D  DFHMDF LENGTH=3,POS=(11,32),ATTRB=(ASKIP,NORM,FSET)            00079   
S1MAC2D  DFHMDF LENGTH=1,POS=(11,46),ATTRB=(UNPROT,NORM,FSET)           00080   
         DFHMDF LENGTH=1,POS=(11,48),ATTRB=(ASKIP,NORM)                 00081   
S1MPA2D  DFHMDF LENGTH=7,POS=(11,54),ATTRB=(ASKIP,NORM,FSET)            00082   
S1MCF2D  DFHMDF LENGTH=3,POS=(11,69),ATTRB=(ASKIP,NORM,FSET)            00083   
S1MAC1E  DFHMDF LENGTH=1,POS=(12,9),ATTRB=(UNPROT,NORM,FSET)            00084   
         DFHMDF LENGTH=1,POS=(12,11),ATTRB=(ASKIP,NORM)                 00085   
S1MPA1E  DFHMDF LENGTH=7,POS=(12,17),ATTRB=(ASKIP,NORM,FSET)            00086   
S1MCF1E  DFHMDF LENGTH=3,POS=(12,32),ATTRB=(ASKIP,NORM,FSET)            00087   
S1MAC2E  DFHMDF LENGTH=1,POS=(12,46),ATTRB=(UNPROT,NORM,FSET)           00088   
         DFHMDF LENGTH=1,POS=(12,48),ATTRB=(ASKIP,NORM)                 00089   
S1MPA2E  DFHMDF LENGTH=7,POS=(12,54),ATTRB=(ASKIP,NORM,FSET)            00090   
S1MCF2E  DFHMDF LENGTH=3,POS=(12,69),ATTRB=(ASKIP,NORM,FSET)            00091   
S1MAC1F  DFHMDF LENGTH=1,POS=(13,9),ATTRB=(UNPROT,NORM,FSET)            00092   
         DFHMDF LENGTH=1,POS=(13,11),ATTRB=(ASKIP,NORM)                 00093   
S1MPA1F  DFHMDF LENGTH=7,POS=(13,17),ATTRB=(ASKIP,NORM,FSET)            00094   
S1MCF1F  DFHMDF LENGTH=3,POS=(13,32),ATTRB=(ASKIP,NORM,FSET)            00095   
S1MAC2F  DFHMDF LENGTH=1,POS=(13,46),ATTRB=(UNPROT,NORM,FSET)           00096   
         DFHMDF LENGTH=1,POS=(13,48),ATTRB=(ASKIP,NORM)                 00097   
S1MPA2F  DFHMDF LENGTH=7,POS=(13,54),ATTRB=(ASKIP,NORM,FSET)            00098   
S1MCF2F  DFHMDF LENGTH=3,POS=(13,69),ATTRB=(ASKIP,NORM,FSET)            00099   
S1MAC1G  DFHMDF LENGTH=1,POS=(14,9),ATTRB=(UNPROT,NORM,FSET)            00100   
         DFHMDF LENGTH=1,POS=(14,11),ATTRB=(ASKIP,NORM)                 00101   
S1MPA1G  DFHMDF LENGTH=7,POS=(14,17),ATTRB=(ASKIP,NORM,FSET)            00102   
S1MCF1G  DFHMDF LENGTH=3,POS=(14,32),ATTRB=(ASKIP,NORM,FSET)            00103   
S1MAC2G  DFHMDF LENGTH=1,POS=(14,46),ATTRB=(UNPROT,NORM,FSET)           00104   
         DFHMDF LENGTH=1,POS=(14,48),ATTRB=(ASKIP,NORM)                 00105   
S1MPA2G  DFHMDF LENGTH=7,POS=(14,54),ATTRB=(ASKIP,NORM,FSET)            00106   
S1MCF2G  DFHMDF LENGTH=3,POS=(14,69),ATTRB=(ASKIP,NORM,FSET)            00107   
S1MAC1H  DFHMDF LENGTH=1,POS=(15,9),ATTRB=(UNPROT,NORM,FSET)            00108   
         DFHMDF LENGTH=1,POS=(15,11),ATTRB=(ASKIP,NORM)                 00109   
S1MPA1H  DFHMDF LENGTH=7,POS=(15,17),ATTRB=(ASKIP,NORM,FSET)            00110   
S1MCF1H  DFHMDF LENGTH=3,POS=(15,32),ATTRB=(ASKIP,NORM,FSET)            00111   
S1MAC2H  DFHMDF LENGTH=1,POS=(15,46),ATTRB=(UNPROT,NORM,FSET)           00112   
         DFHMDF LENGTH=1,POS=(15,48),ATTRB=(ASKIP,NORM)                 00113   
S1MPA2H  DFHMDF LENGTH=7,POS=(15,54),ATTRB=(ASKIP,NORM,FSET)            00114   
S1MCF2H  DFHMDF LENGTH=3,POS=(15,69),ATTRB=(ASKIP,NORM,FSET)            00115   
S1MAC1I  DFHMDF LENGTH=1,POS=(16,9),ATTRB=(UNPROT,NORM,FSET)            00116   
         DFHMDF LENGTH=1,POS=(16,11),ATTRB=(ASKIP,NORM)                 00117   
S1MPA1I  DFHMDF LENGTH=7,POS=(16,17),ATTRB=(ASKIP,NORM,FSET)            00118   
S1MCF1I  DFHMDF LENGTH=3,POS=(16,32),ATTRB=(ASKIP,NORM,FSET)            00119   
S1MAC2I  DFHMDF LENGTH=1,POS=(16,46),ATTRB=(UNPROT,NORM,FSET)           00120   
         DFHMDF LENGTH=1,POS=(16,48),ATTRB=(ASKIP,NORM)                 00121   
S1MPA2I  DFHMDF LENGTH=7,POS=(16,54),ATTRB=(ASKIP,NORM,FSET)            00122   
S1MCF2I  DFHMDF LENGTH=3,POS=(16,69),ATTRB=(ASKIP,NORM,FSET)            00123   
S1MAC1J  DFHMDF LENGTH=1,POS=(17,9),ATTRB=(UNPROT,NORM,FSET)            00124   
         DFHMDF LENGTH=1,POS=(17,11),ATTRB=(ASKIP,NORM)                 00125   
S1MPA1J  DFHMDF LENGTH=7,POS=(17,17),ATTRB=(ASKIP,NORM,FSET)            00126   
S1MCF1J  DFHMDF LENGTH=3,POS=(17,32),ATTRB=(ASKIP,NORM,FSET)            00127   
S1MAC2J  DFHMDF LENGTH=1,POS=(17,46),ATTRB=(UNPROT,NORM,FSET)           00128   
         DFHMDF LENGTH=1,POS=(17,48),ATTRB=(ASKIP,NORM)                 00129   
S1MPA2J  DFHMDF LENGTH=7,POS=(17,54),ATTRB=(ASKIP,NORM,FSET)            00130   
S1MCF2J  DFHMDF LENGTH=3,POS=(17,69),ATTRB=(ASKIP,NORM,FSET)            00131   
S1MAC1K  DFHMDF LENGTH=1,POS=(18,9),ATTRB=(UNPROT,NORM,FSET)            00132   
         DFHMDF LENGTH=1,POS=(18,11),ATTRB=(ASKIP,NORM)                 00133   
S1MPA1K  DFHMDF LENGTH=7,POS=(18,17),ATTRB=(ASKIP,NORM,FSET)            00134   
S1MCF1K  DFHMDF LENGTH=3,POS=(18,32),ATTRB=(ASKIP,NORM,FSET)            00135   
S1MAC2K  DFHMDF LENGTH=1,POS=(18,46),ATTRB=(UNPROT,NORM,FSET)           00136   
         DFHMDF LENGTH=1,POS=(18,48),ATTRB=(ASKIP,NORM)                 00137   
S1MPA2K  DFHMDF LENGTH=7,POS=(18,54),ATTRB=(ASKIP,NORM,FSET)            00138   
S1MCF2K  DFHMDF LENGTH=3,POS=(18,69),ATTRB=(ASKIP,NORM,FSET)            00139   
S1MAC1L  DFHMDF LENGTH=1,POS=(19,9),ATTRB=(UNPROT,NORM,FSET)            00140   
         DFHMDF LENGTH=1,POS=(19,11),ATTRB=(ASKIP,NORM)                 00141   
S1MPA1L  DFHMDF LENGTH=7,POS=(19,17),ATTRB=(ASKIP,NORM,FSET)            00142   
S1MCF1L  DFHMDF LENGTH=3,POS=(19,32),ATTRB=(ASKIP,NORM,FSET)            00143   
S1MAC2L  DFHMDF LENGTH=1,POS=(19,46),ATTRB=(UNPROT,NORM,FSET)           00144   
         DFHMDF LENGTH=1,POS=(19,48),ATTRB=(ASKIP,NORM)                 00145   
S1MPA2L  DFHMDF LENGTH=7,POS=(19,54),ATTRB=(ASKIP,NORM,FSET)            00146   
S1MCF2L  DFHMDF LENGTH=3,POS=(19,69),ATTRB=(ASKIP,NORM,FSET)            00147   
S1MAC1M  DFHMDF LENGTH=1,POS=(20,9),ATTRB=(UNPROT,NORM,FSET)            00148   
         DFHMDF LENGTH=1,POS=(20,11),ATTRB=(ASKIP,NORM)                 00149   
S1MPA1M  DFHMDF LENGTH=7,POS=(20,17),ATTRB=(ASKIP,NORM,FSET)            00150   
S1MCF1M  DFHMDF LENGTH=3,POS=(20,32),ATTRB=(ASKIP,NORM,FSET)            00151   
S1MAC2M  DFHMDF LENGTH=1,POS=(20,46),ATTRB=(UNPROT,NORM,FSET)           00152   
         DFHMDF LENGTH=1,POS=(20,48),ATTRB=(ASKIP,NORM)                 00153   
S1MPA2M  DFHMDF LENGTH=7,POS=(20,54),ATTRB=(ASKIP,NORM,FSET)            00154   
S1MCF2M  DFHMDF LENGTH=3,POS=(20,69),ATTRB=(ASKIP,NORM,FSET)            00155   
S1MAC1N  DFHMDF LENGTH=1,POS=(21,9),ATTRB=(UNPROT,NORM,FSET)            00156   
         DFHMDF LENGTH=1,POS=(21,11),ATTRB=(ASKIP,NORM)                 00157   
S1MPA1N  DFHMDF LENGTH=7,POS=(21,17),ATTRB=(ASKIP,NORM,FSET)            00158   
S1MCF1N  DFHMDF LENGTH=3,POS=(21,32),ATTRB=(ASKIP,NORM,FSET)            00159   
S1MAC2N  DFHMDF LENGTH=1,POS=(21,46),ATTRB=(UNPROT,NORM,FSET)           00160   
         DFHMDF LENGTH=1,POS=(21,48),ATTRB=(ASKIP,NORM)                 00161   
S1MPA2N  DFHMDF LENGTH=7,POS=(21,54),ATTRB=(ASKIP,NORM,FSET)            00162   
S1MCF2N  DFHMDF LENGTH=3,POS=(21,69),ATTRB=(ASKIP,NORM,FSET)            00163   
S1MAC1O  DFHMDF LENGTH=1,POS=(22,9),ATTRB=(UNPROT,NORM,FSET)            00164   
         DFHMDF LENGTH=1,POS=(22,11),ATTRB=(ASKIP,NORM)                 00165   
S1MPA1O  DFHMDF LENGTH=7,POS=(22,17),ATTRB=(ASKIP,NORM,FSET)            00166   
S1MCF1O  DFHMDF LENGTH=3,POS=(22,32),ATTRB=(ASKIP,NORM,FSET)            00167   
S1MAC2O  DFHMDF LENGTH=1,POS=(22,46),ATTRB=(UNPROT,NORM,FSET)           00168   
         DFHMDF LENGTH=1,POS=(22,48),ATTRB=(ASKIP,NORM)                 00169   
S1MPA2O  DFHMDF LENGTH=7,POS=(22,54),ATTRB=(ASKIP,NORM,FSET)            00170   
S1MCF2O  DFHMDF LENGTH=3,POS=(22,69),ATTRB=(ASKIP,NORM,FSET)            00171   
SELTXT5  DFHMDF LENGTH=0079,POS=(23,1),ATTRB=(ASKIP,NORM),INITIAL='PAGIX00172   
               NG:   PF7(BACKWARD) PF8(FORWARD) PF10(BOTTOM) PF11(TOP) X00173   
                                  '                                     00174   
ERRMSG   DFHMDF LENGTH=79,POS=(24,1),ATTRB=(PROT,BRT)                   00175   
         DFHMSD TYPE=FINAL                                              00176   
         END                                                            00177   
/*                                                                      00178   
