GA1SSET  DFHMSD TYPE=MAP,MODE=INOUT,LANG=COBOL,CTRL=FREEKB,DATA=FIELD,TX00001   
               IOAPFX=YES                                               00002   
GA1SI01  DFHMDI SIZE=(24,80)                                            00003   
FUNCTON  DFHMDF LENGTH=0004,POS=(1,1),ATTRB=(PROT,NORM,FSET),INITIAL='GX00004   
               A1S'                                                     00005   
TTLELNE  DFHMDF LENGTH=46,POS=(1,10),ATTRB=(ASKIP,NORM,FSET)            00006   
         DFHMDF LENGTH=0003,POS=(1,61),ATTRB=(ASKIP,NORM),INITIAL='DEL' 00007   
         DFHMDF LENGTH=0008,POS=(1,65),ATTRB=(ASKIP,NORM),INITIAL='SCREX00008   
               EN #'                                                    00009   
SCRNIDN  DFHMDF LENGTH=0006,POS=(1,74),ATTRB=(ASKIP,NORM,FSET),INITIAL=X00010   
               '001I00'                                                 00011   
         DFHMDF LENGTH=0039,POS=(2,13),ATTRB=(ASKIP,NORM),INITIAL='PROVX00012   
               IDER-GROUP BY PROVIDER SPECIALTIES '                     00013   
IDLINE   DFHMDF LENGTH=79,POS=(3,1),ATTRB=(ASKIP,NORM,FSET)             00014   
         DFHMDF LENGTH=0015,POS=(4,1),ATTRB=(ASKIP,NORM),INITIAL='ALL LX00015   
               VL TAB ID='                                              00016   
ALTABID  DFHMDF LENGTH=6,POS=(4,17),ATTRB=(ASKIP,NORM,FSET)             00017   
         DFHMDF LENGTH=0006,POS=(4,25),ATTRB=(ASKIP,NORM),INITIAL='SLT X00018   
               #='                                                      00019   
ALTBSLT  DFHMDF LENGTH=7,POS=(4,32),ATTRB=(ASKIP,NORM,FSET)             00020   
         DFHMDF LENGTH=0016,POS=(4,41),ATTRB=(ASKIP,NORM),INITIAL='INTEX00021   
               RNAL TAB ID='                                            00022   
INTABID  DFHMDF LENGTH=6,POS=(4,58),ATTRB=(ASKIP,NORM,FSET)             00023   
         DFHMDF LENGTH=0006,POS=(4,66),ATTRB=(ASKIP,NORM),INITIAL='SLT X00024   
               #='                                                      00025   
INTBSLT  DFHMDF LENGTH=7,POS=(4,73),ATTRB=(ASKIP,NORM,FSET)             00026   
         DFHMDF LENGTH=0027,POS=(5,1),ATTRB=(ASKIP,NORM),INITIAL='INCLUX00027   
               DE/EXCLUDE BY PROVIDER'                                  00028   
INCEXC   DFHMDF LENGTH=1,POS=(5,30),ATTRB=(ASKIP,NORM,FSET)             00029   
ADDELIN  DFHMDF LENGTH=1,POS=(5,41),ATTRB=(ASKIP,DRK,FSET)              00030   
ALTBFNC  DFHMDF LENGTH=4,POS=(5,49),ATTRB=(ASKIP,DRK,FSET)              00031   
OENTCTR  DFHMDF LENGTH=7,POS=(5,61),ATTRB=(ASKIP,DRK,FSET)              00032   
FRMNUID  DFHMDF LENGTH=4,POS=(5,75),ATTRB=(ASKIP,DRK,FSET)              00033   
         DFHMDF LENGTH=0006,POS=(7,4),ATTRB=(ASKIP,NORM),INITIAL='ACTIOX00034   
               N'                                                       00035   
         DFHMDF LENGTH=0013,POS=(7,12),ATTRB=(ASKIP,NORM),INITIAL='PROVX00036   
               IDER SPEC'                                               00037   
         DFHMDF LENGTH=0006,POS=(7,30),ATTRB=(ASKIP,NORM),INITIAL='ACTIX00038   
               ON'                                                      00039   
         DFHMDF LENGTH=0013,POS=(7,38),ATTRB=(ASKIP,NORM),INITIAL='PROVX00040   
               IDER SPEC'                                               00041   
         DFHMDF LENGTH=0006,POS=(7,56),ATTRB=(ASKIP,NORM),INITIAL='ACTIX00042   
               ON'                                                      00043   
         DFHMDF LENGTH=0013,POS=(7,64),ATTRB=(ASKIP,NORM),INITIAL='PROVX00044   
               IDER SPEC'                                               00045   
         DFHMDF LENGTH=0004,POS=(8,5),ATTRB=(ASKIP,NORM),INITIAL='CODE' 00046   
         DFHMDF LENGTH=0008,POS=(8,15),ATTRB=(ASKIP,NORM),INITIAL='ARGUX00047   
               MENT'                                                    00048   
         DFHMDF LENGTH=0004,POS=(8,31),ATTRB=(ASKIP,NORM),INITIAL='CODEX00049   
               '                                                        00050   
         DFHMDF LENGTH=0008,POS=(8,41),ATTRB=(ASKIP,NORM),INITIAL='ARGUX00051   
               MENT'                                                    00052   
         DFHMDF LENGTH=0004,POS=(8,57),ATTRB=(ASKIP,NORM),INITIAL='CODEX00053   
               '                                                        00054   
         DFHMDF LENGTH=0008,POS=(8,67),ATTRB=(ASKIP,NORM),INITIAL='ARGUX00055   
               MENT'                                                    00056   
S1IAC1A  DFHMDF LENGTH=1,POS=(9,6),ATTRB=(UNPROT,NORM,IC,FSET)          00057   
         DFHMDF LENGTH=1,POS=(9,8),ATTRB=(ASKIP,NORM)                   00058   
S1IPT1A  DFHMDF LENGTH=3,POS=(9,18),ATTRB=(ASKIP,NORM,FSET)             00059   
S1IAC2A  DFHMDF LENGTH=1,POS=(9,32),ATTRB=(UNPROT,NORM,FSET)            00060   
         DFHMDF LENGTH=1,POS=(9,34),ATTRB=(ASKIP,NORM)                  00061   
S1IPT2A  DFHMDF LENGTH=3,POS=(9,44),ATTRB=(ASKIP,NORM,FSET)             00062   
S1IAC3A  DFHMDF LENGTH=1,POS=(9,58),ATTRB=(UNPROT,NORM,FSET)            00063   
         DFHMDF LENGTH=1,POS=(9,60),ATTRB=(ASKIP,NORM)                  00064   
S1IPT3A  DFHMDF LENGTH=3,POS=(9,70),ATTRB=(ASKIP,NORM,FSET)             00065   
S1IAC1B  DFHMDF LENGTH=1,POS=(10,6),ATTRB=(UNPROT,NORM,FSET)            00066   
         DFHMDF LENGTH=1,POS=(10,8),ATTRB=(ASKIP,NORM)                  00067   
S1IPT1B  DFHMDF LENGTH=3,POS=(10,18),ATTRB=(ASKIP,NORM,FSET)            00068   
S1IAC2B  DFHMDF LENGTH=1,POS=(10,32),ATTRB=(UNPROT,NORM,FSET)           00069   
         DFHMDF LENGTH=1,POS=(10,34),ATTRB=(ASKIP,NORM)                 00070   
S1IPT2B  DFHMDF LENGTH=3,POS=(10,44),ATTRB=(ASKIP,NORM,FSET)            00071   
S1IAC3B  DFHMDF LENGTH=1,POS=(10,58),ATTRB=(UNPROT,NORM,FSET)           00072   
         DFHMDF LENGTH=1,POS=(10,60),ATTRB=(ASKIP,NORM)                 00073   
S1IPT3B  DFHMDF LENGTH=3,POS=(10,70),ATTRB=(ASKIP,NORM,FSET)            00074   
S1IAC1C  DFHMDF LENGTH=1,POS=(11,6),ATTRB=(UNPROT,NORM,FSET)            00075   
         DFHMDF LENGTH=1,POS=(11,8),ATTRB=(ASKIP,NORM)                  00076   
S1IPT1C  DFHMDF LENGTH=3,POS=(11,18),ATTRB=(ASKIP,NORM,FSET)            00077   
S1IAC2C  DFHMDF LENGTH=1,POS=(11,32),ATTRB=(UNPROT,NORM,FSET)           00078   
         DFHMDF LENGTH=1,POS=(11,34),ATTRB=(ASKIP,NORM)                 00079   
S1IPT2C  DFHMDF LENGTH=3,POS=(11,44),ATTRB=(ASKIP,NORM,FSET)            00080   
S1IAC3C  DFHMDF LENGTH=1,POS=(11,58),ATTRB=(UNPROT,NORM,FSET)           00081   
         DFHMDF LENGTH=1,POS=(11,60),ATTRB=(ASKIP,NORM)                 00082   
S1IPT3C  DFHMDF LENGTH=3,POS=(11,70),ATTRB=(ASKIP,NORM,FSET)            00083   
S1IAC1D  DFHMDF LENGTH=1,POS=(12,6),ATTRB=(UNPROT,NORM,FSET)            00084   
         DFHMDF LENGTH=1,POS=(12,8),ATTRB=(ASKIP,NORM)                  00085   
S1IPT1D  DFHMDF LENGTH=3,POS=(12,18),ATTRB=(ASKIP,NORM,FSET)            00086   
S1IAC2D  DFHMDF LENGTH=1,POS=(12,32),ATTRB=(UNPROT,NORM,FSET)           00087   
         DFHMDF LENGTH=1,POS=(12,34),ATTRB=(ASKIP,NORM)                 00088   
S1IPT2D  DFHMDF LENGTH=3,POS=(12,44),ATTRB=(ASKIP,NORM,FSET)            00089   
S1IAC3D  DFHMDF LENGTH=1,POS=(12,58),ATTRB=(UNPROT,NORM,FSET)           00090   
         DFHMDF LENGTH=1,POS=(12,60),ATTRB=(ASKIP,NORM)                 00091   
S1IPT3D  DFHMDF LENGTH=3,POS=(12,70),ATTRB=(ASKIP,NORM,FSET)            00092   
S1IAC1E  DFHMDF LENGTH=1,POS=(13,6),ATTRB=(UNPROT,NORM,FSET)            00093   
         DFHMDF LENGTH=1,POS=(13,8),ATTRB=(ASKIP,NORM)                  00094   
S1IPT1E  DFHMDF LENGTH=3,POS=(13,18),ATTRB=(ASKIP,NORM,FSET)            00095   
S1IAC2E  DFHMDF LENGTH=1,POS=(13,32),ATTRB=(UNPROT,NORM,FSET)           00096   
         DFHMDF LENGTH=1,POS=(13,34),ATTRB=(ASKIP,NORM)                 00097   
S1IPT2E  DFHMDF LENGTH=3,POS=(13,44),ATTRB=(ASKIP,NORM,FSET)            00098   
S1IAC3E  DFHMDF LENGTH=1,POS=(13,58),ATTRB=(UNPROT,NORM,FSET)           00099   
         DFHMDF LENGTH=1,POS=(13,60),ATTRB=(ASKIP,NORM)                 00100   
S1IPT3E  DFHMDF LENGTH=3,POS=(13,70),ATTRB=(ASKIP,NORM,FSET)            00101   
S1IAC1F  DFHMDF LENGTH=1,POS=(14,6),ATTRB=(UNPROT,NORM,FSET)            00102   
         DFHMDF LENGTH=1,POS=(14,8),ATTRB=(ASKIP,NORM)                  00103   
S1IPT1F  DFHMDF LENGTH=3,POS=(14,18),ATTRB=(ASKIP,NORM,FSET)            00104   
S1IAC2F  DFHMDF LENGTH=1,POS=(14,32),ATTRB=(UNPROT,NORM,FSET)           00105   
         DFHMDF LENGTH=1,POS=(14,34),ATTRB=(ASKIP,NORM)                 00106   
S1IPT2F  DFHMDF LENGTH=3,POS=(14,44),ATTRB=(ASKIP,NORM,FSET)            00107   
S1IAC3F  DFHMDF LENGTH=1,POS=(14,58),ATTRB=(UNPROT,NORM,FSET)           00108   
         DFHMDF LENGTH=1,POS=(14,60),ATTRB=(ASKIP,NORM)                 00109   
S1IPT3F  DFHMDF LENGTH=3,POS=(14,70),ATTRB=(ASKIP,NORM,FSET)            00110   
S1IAC1G  DFHMDF LENGTH=1,POS=(15,6),ATTRB=(UNPROT,NORM,FSET)            00111   
         DFHMDF LENGTH=1,POS=(15,8),ATTRB=(ASKIP,NORM)                  00112   
S1IPT1G  DFHMDF LENGTH=3,POS=(15,18),ATTRB=(ASKIP,NORM,FSET)            00113   
S1IAC2G  DFHMDF LENGTH=1,POS=(15,32),ATTRB=(UNPROT,NORM,FSET)           00114   
         DFHMDF LENGTH=1,POS=(15,34),ATTRB=(ASKIP,NORM)                 00115   
S1IPT2G  DFHMDF LENGTH=3,POS=(15,44),ATTRB=(ASKIP,NORM,FSET)            00116   
S1IAC3G  DFHMDF LENGTH=1,POS=(15,58),ATTRB=(UNPROT,NORM,FSET)           00117   
         DFHMDF LENGTH=1,POS=(15,60),ATTRB=(ASKIP,NORM)                 00118   
S1IPT3G  DFHMDF LENGTH=3,POS=(15,70),ATTRB=(ASKIP,NORM,FSET)            00119   
S1IAC1H  DFHMDF LENGTH=1,POS=(16,6),ATTRB=(UNPROT,NORM,FSET)            00120   
         DFHMDF LENGTH=1,POS=(16,8),ATTRB=(ASKIP,NORM)                  00121   
S1IPT1H  DFHMDF LENGTH=3,POS=(16,18),ATTRB=(ASKIP,NORM,FSET)            00122   
S1IAC2H  DFHMDF LENGTH=1,POS=(16,32),ATTRB=(UNPROT,NORM,FSET)           00123   
         DFHMDF LENGTH=1,POS=(16,34),ATTRB=(ASKIP,NORM)                 00124   
S1IPT2H  DFHMDF LENGTH=3,POS=(16,44),ATTRB=(ASKIP,NORM,FSET)            00125   
S1IAC3H  DFHMDF LENGTH=1,POS=(16,58),ATTRB=(UNPROT,NORM,FSET)           00126   
         DFHMDF LENGTH=1,POS=(16,60),ATTRB=(ASKIP,NORM)                 00127   
S1IPT3H  DFHMDF LENGTH=3,POS=(16,70),ATTRB=(ASKIP,NORM,FSET)            00128   
S1IAC1I  DFHMDF LENGTH=1,POS=(17,6),ATTRB=(UNPROT,NORM,FSET)            00129   
         DFHMDF LENGTH=1,POS=(17,8),ATTRB=(ASKIP,NORM)                  00130   
S1IPT1I  DFHMDF LENGTH=3,POS=(17,18),ATTRB=(ASKIP,NORM,FSET)            00131   
S1IAC2I  DFHMDF LENGTH=1,POS=(17,32),ATTRB=(UNPROT,NORM,FSET)           00132   
         DFHMDF LENGTH=1,POS=(17,34),ATTRB=(ASKIP,NORM)                 00133   
S1IPT2I  DFHMDF LENGTH=3,POS=(17,44),ATTRB=(ASKIP,NORM,FSET)            00134   
S1IAC3I  DFHMDF LENGTH=1,POS=(17,58),ATTRB=(UNPROT,NORM,FSET)           00135   
         DFHMDF LENGTH=1,POS=(17,60),ATTRB=(ASKIP,NORM)                 00136   
S1IPT3I  DFHMDF LENGTH=3,POS=(17,70),ATTRB=(ASKIP,NORM,FSET)            00137   
S1IAC1J  DFHMDF LENGTH=1,POS=(18,6),ATTRB=(UNPROT,NORM,FSET)            00138   
         DFHMDF LENGTH=1,POS=(18,8),ATTRB=(ASKIP,NORM)                  00139   
S1IPT1J  DFHMDF LENGTH=3,POS=(18,18),ATTRB=(ASKIP,NORM,FSET)            00140   
S1IAC2J  DFHMDF LENGTH=1,POS=(18,32),ATTRB=(UNPROT,NORM,FSET)           00141   
         DFHMDF LENGTH=1,POS=(18,34),ATTRB=(ASKIP,NORM)                 00142   
S1IPT2J  DFHMDF LENGTH=3,POS=(18,44),ATTRB=(ASKIP,NORM,FSET)            00143   
S1IAC3J  DFHMDF LENGTH=1,POS=(18,58),ATTRB=(UNPROT,NORM,FSET)           00144   
         DFHMDF LENGTH=1,POS=(18,60),ATTRB=(ASKIP,NORM)                 00145   
S1IPT3J  DFHMDF LENGTH=3,POS=(18,70),ATTRB=(ASKIP,NORM,FSET)            00146   
S1IAC1K  DFHMDF LENGTH=1,POS=(19,6),ATTRB=(UNPROT,NORM,FSET)            00147   
         DFHMDF LENGTH=1,POS=(19,8),ATTRB=(ASKIP,NORM)                  00148   
S1IPT1K  DFHMDF LENGTH=3,POS=(19,18),ATTRB=(ASKIP,NORM,FSET)            00149   
S1IAC2K  DFHMDF LENGTH=1,POS=(19,32),ATTRB=(UNPROT,NORM,FSET)           00150   
         DFHMDF LENGTH=1,POS=(19,34),ATTRB=(ASKIP,NORM)                 00151   
S1IPT2K  DFHMDF LENGTH=3,POS=(19,44),ATTRB=(ASKIP,NORM,FSET)            00152   
S1IAC3K  DFHMDF LENGTH=1,POS=(19,58),ATTRB=(UNPROT,NORM,FSET)           00153   
         DFHMDF LENGTH=1,POS=(19,60),ATTRB=(ASKIP,NORM)                 00154   
S1IPT3K  DFHMDF LENGTH=3,POS=(19,70),ATTRB=(ASKIP,NORM,FSET)            00155   
S1IAC1L  DFHMDF LENGTH=1,POS=(20,6),ATTRB=(UNPROT,NORM,FSET)            00156   
         DFHMDF LENGTH=1,POS=(20,8),ATTRB=(ASKIP,NORM)                  00157   
S1IPT1L  DFHMDF LENGTH=3,POS=(20,18),ATTRB=(ASKIP,NORM,FSET)            00158   
S1IAC2L  DFHMDF LENGTH=1,POS=(20,32),ATTRB=(UNPROT,NORM,FSET)           00159   
         DFHMDF LENGTH=1,POS=(20,34),ATTRB=(ASKIP,NORM)                 00160   
S1IPT2L  DFHMDF LENGTH=3,POS=(20,44),ATTRB=(ASKIP,NORM,FSET)            00161   
S1IAC3L  DFHMDF LENGTH=1,POS=(20,58),ATTRB=(UNPROT,NORM,FSET)           00162   
         DFHMDF LENGTH=1,POS=(20,60),ATTRB=(ASKIP,NORM)                 00163   
S1IPT3L  DFHMDF LENGTH=3,POS=(20,70),ATTRB=(ASKIP,NORM,FSET)            00164   
S1IAC1M  DFHMDF LENGTH=1,POS=(21,6),ATTRB=(UNPROT,NORM,FSET)            00165   
         DFHMDF LENGTH=1,POS=(21,8),ATTRB=(ASKIP,NORM)                  00166   
S1IPT1M  DFHMDF LENGTH=3,POS=(21,18),ATTRB=(ASKIP,NORM,FSET)            00167   
S1IAC2M  DFHMDF LENGTH=1,POS=(21,32),ATTRB=(UNPROT,NORM,FSET)           00168   
         DFHMDF LENGTH=1,POS=(21,34),ATTRB=(ASKIP,NORM)                 00169   
S1IPT2M  DFHMDF LENGTH=3,POS=(21,44),ATTRB=(ASKIP,NORM,FSET)            00170   
S1IAC3M  DFHMDF LENGTH=1,POS=(21,58),ATTRB=(UNPROT,NORM,FSET)           00171   
         DFHMDF LENGTH=1,POS=(21,60),ATTRB=(ASKIP,NORM)                 00172   
S1IPT3M  DFHMDF LENGTH=3,POS=(21,70),ATTRB=(ASKIP,NORM,FSET)            00173   
S1IAC1N  DFHMDF LENGTH=1,POS=(22,6),ATTRB=(UNPROT,NORM,FSET)            00174   
         DFHMDF LENGTH=1,POS=(22,8),ATTRB=(ASKIP,NORM)                  00175   
S1IPT1N  DFHMDF LENGTH=3,POS=(22,18),ATTRB=(ASKIP,NORM,FSET)            00176   
S1IAC2N  DFHMDF LENGTH=1,POS=(22,32),ATTRB=(UNPROT,NORM,FSET)           00177   
         DFHMDF LENGTH=1,POS=(22,34),ATTRB=(ASKIP,NORM)                 00178   
S1IPT2N  DFHMDF LENGTH=3,POS=(22,44),ATTRB=(ASKIP,NORM,FSET)            00179   
S1IAC3N  DFHMDF LENGTH=1,POS=(22,58),ATTRB=(UNPROT,NORM,FSET)           00180   
         DFHMDF LENGTH=1,POS=(22,60),ATTRB=(ASKIP,NORM)                 00181   
S1IPT3N  DFHMDF LENGTH=3,POS=(22,70),ATTRB=(ASKIP,NORM,FSET)            00182   
ERRMSG   DFHMDF LENGTH=79,POS=(24,1),ATTRB=(PROT,BRT)                   00183   
         DFHMSD TYPE=FINAL                                              00184   
         END                                                            00185   
/*                                                                      00186   
