GA1TSET  DFHMSD TYPE=MAP,MODE=INOUT,LANG=COBOL,CTRL=FREEKB,DATA=FIELD,TX00001   
               IOAPFX=YES                                               00002   
GA1TI01  DFHMDI SIZE=(24,80)                                            00003   
FUNCTON  DFHMDF LENGTH=0004,POS=(1,1),ATTRB=(PROT,NORM,FSET),INITIAL='GX00004   
               A1T'                                                     00005   
TTLELNE  DFHMDF LENGTH=46,POS=(1,10),ATTRB=(ASKIP,NORM,FSET)            00006   
FUNCLIT  DFHMDF LENGTH=3,POS=(1,61),ATTRB=(ASKIP,NORM,FSET)             00007   
         DFHMDF LENGTH=0008,POS=(1,65),ATTRB=(ASKIP,NORM),INITIAL='SCREX00008   
               EN #'                                                    00009   
SCRNIDN  DFHMDF LENGTH=0006,POS=(1,74),ATTRB=(ASKIP,NORM,FSET),INITIAL=X00010   
               '0A1T00'                                                 00011   
         DFHMDF LENGTH=0041,POS=(2,15),ATTRB=(ASKIP,NORM),INITIAL='RELAX00012   
               TED DIAGNOSIS RANGE(S) AND/OR LIST(S)'                   00013   
IDLINE   DFHMDF LENGTH=79,POS=(4,1),ATTRB=(ASKIP,NORM,FSET)             00014   
         DFHMDF LENGTH=0011,POS=(5,1),ATTRB=(ASKIP,NORM),INITIAL='CON TX00015   
               AB ID:'                                                  00016   
ALTABID  DFHMDF LENGTH=6,POS=(5,13),ATTRB=(ASKIP,NORM,FSET)             00017   
         DFHMDF LENGTH=0008,POS=(5,21),ATTRB=(ASKIP,NORM),INITIAL='SLOTX00018   
                NO:'                                                    00019   
ALTBSLT  DFHMDF LENGTH=7,POS=(5,30),ATTRB=(ASKIP,NORM,FSET)             00020   
         DFHMDF LENGTH=0011,POS=(5,43),ATTRB=(ASKIP,NORM),INITIAL='INT X00021   
               TAB ID:'                                                 00022   
INTABID  DFHMDF LENGTH=6,POS=(5,55),ATTRB=(ASKIP,NORM,FSET)             00023   
         DFHMDF LENGTH=0008,POS=(5,63),ATTRB=(ASKIP,NORM),INITIAL='SLOTX00024   
                NO:'                                                    00025   
INTBSLT  DFHMDF LENGTH=7,POS=(5,72),ATTRB=(ASKIP,NORM,FSET)             00026   
         DFHMDF LENGTH=0035,POS=(6,1),ATTRB=(ASKIP,NORM),INITIAL='INCLUX00027   
               DE OR EXCLUDE BY DIAGNOSIS(S):'                          00028   
INCEXC   DFHMDF LENGTH=1,POS=(6,37),ATTRB=(ASKIP,NORM,FSET)             00029   
ADDELIN  DFHMDF LENGTH=1,POS=(6,39),ATTRB=(ASKIP,DRK,FSET)              00030   
ALTBFNC  DFHMDF LENGTH=4,POS=(6,41),ATTRB=(ASKIP,DRK,FSET)              00031   
OENTCTR  DFHMDF LENGTH=7,POS=(6,47),ATTRB=(ASKIP,DRK,FSET)              00032   
FRMNUID  DFHMDF LENGTH=4,POS=(6,56),ATTRB=(ASKIP,DRK,FSET)              00033   
         DFHMDF LENGTH=0006,POS=(8,2),ATTRB=(ASKIP,NORM),INITIAL='ACTIOX00034   
               N'                                                       00035   
         DFHMDF LENGTH=0009,POS=(8,20),ATTRB=(ASKIP,NORM),INITIAL='DIAGX00036   
               NOSIS'                                                   00037   
         DFHMDF LENGTH=0006,POS=(8,40),ATTRB=(ASKIP,NORM),INITIAL='ACTIX00038   
               ON'                                                      00039   
         DFHMDF LENGTH=0009,POS=(8,58),ATTRB=(ASKIP,NORM),INITIAL='DIAGX00040   
               NOSIS'                                                   00041   
         DFHMDF LENGTH=0004,POS=(9,3),ATTRB=(ASKIP,NORM),INITIAL='CODE' 00042   
         DFHMDF LENGTH=0004,POS=(9,11),ATTRB=(ASKIP,NORM),INITIAL='FROMX00043   
               '                                                        00044   
         DFHMDF LENGTH=0002,POS=(9,31),ATTRB=(ASKIP,NORM),INITIAL='TO'  00045   
         DFHMDF LENGTH=0004,POS=(9,41),ATTRB=(ASKIP,NORM),INITIAL='CODEX00046   
               '                                                        00047   
         DFHMDF LENGTH=0004,POS=(9,49),ATTRB=(ASKIP,NORM),INITIAL='FROMX00048   
               '                                                        00049   
         DFHMDF LENGTH=0002,POS=(9,69),ATTRB=(ASKIP,NORM),INITIAL='TO'  00050   
IRDACA1  DFHMDF LENGTH=1,POS=(11,4),ATTRB=(UNPROT,NORM,IC,FSET)         00051   
         DFHMDF LENGTH=1,POS=(11,6),ATTRB=(ASKIP,NORM)                  00052   
IRDFRA1  DFHMDF LENGTH=10,POS=(11,9),ATTRB=(ASKIP,NORM,FSET)            00053   
         DFHMDF LENGTH=1,POS=(11,20),ATTRB=(ASKIP,NORM)                 00054   
IRDTOA1  DFHMDF LENGTH=10,POS=(11,26),ATTRB=(ASKIP,NORM,FSET)           00055   
         DFHMDF LENGTH=1,POS=(11,37),ATTRB=(ASKIP,NORM)                 00056   
IRDACB1  DFHMDF LENGTH=1,POS=(11,42),ATTRB=(UNPROT,NORM,FSET)           00057   
         DFHMDF LENGTH=1,POS=(11,44),ATTRB=(ASKIP,NORM)                 00058   
IRDFRB1  DFHMDF LENGTH=10,POS=(11,47),ATTRB=(ASKIP,NORM,FSET)           00059   
         DFHMDF LENGTH=1,POS=(11,58),ATTRB=(ASKIP,NORM)                 00060   
IRDTOB1  DFHMDF LENGTH=10,POS=(11,64),ATTRB=(ASKIP,NORM,FSET)           00061   
         DFHMDF LENGTH=1,POS=(11,75),ATTRB=(ASKIP,NORM)                 00062   
IRDACA2  DFHMDF LENGTH=1,POS=(12,4),ATTRB=(UNPROT,NORM,IC,FSET)         00063   
         DFHMDF LENGTH=1,POS=(12,6),ATTRB=(ASKIP,NORM)                  00064   
IRDFRA2  DFHMDF LENGTH=10,POS=(12,9),ATTRB=(ASKIP,NORM,FSET)            00065   
         DFHMDF LENGTH=1,POS=(12,20),ATTRB=(ASKIP,NORM)                 00066   
IRDTOA2  DFHMDF LENGTH=10,POS=(12,26),ATTRB=(ASKIP,NORM,FSET)           00067   
         DFHMDF LENGTH=1,POS=(12,37),ATTRB=(ASKIP,NORM)                 00068   
IRDACB2  DFHMDF LENGTH=1,POS=(12,42),ATTRB=(UNPROT,NORM,FSET)           00069   
         DFHMDF LENGTH=1,POS=(12,44),ATTRB=(ASKIP,NORM)                 00070   
IRDFRB2  DFHMDF LENGTH=10,POS=(12,47),ATTRB=(ASKIP,NORM,FSET)           00071   
         DFHMDF LENGTH=1,POS=(12,58),ATTRB=(ASKIP,NORM)                 00072   
IRDTOB2  DFHMDF LENGTH=10,POS=(12,64),ATTRB=(ASKIP,NORM,FSET)           00073   
         DFHMDF LENGTH=1,POS=(12,75),ATTRB=(ASKIP,NORM)                 00074   
IRDACA3  DFHMDF LENGTH=1,POS=(13,4),ATTRB=(UNPROT,NORM,IC,FSET)         00075   
         DFHMDF LENGTH=1,POS=(13,6),ATTRB=(ASKIP,NORM)                  00076   
IRDFRA3  DFHMDF LENGTH=10,POS=(13,9),ATTRB=(ASKIP,NORM,FSET)            00077   
         DFHMDF LENGTH=1,POS=(13,20),ATTRB=(ASKIP,NORM)                 00078   
IRDTOA3  DFHMDF LENGTH=10,POS=(13,26),ATTRB=(ASKIP,NORM,FSET)           00079   
         DFHMDF LENGTH=1,POS=(13,37),ATTRB=(ASKIP,NORM)                 00080   
IRDACB3  DFHMDF LENGTH=1,POS=(13,42),ATTRB=(UNPROT,NORM,FSET)           00081   
         DFHMDF LENGTH=1,POS=(13,44),ATTRB=(ASKIP,NORM)                 00082   
IRDFRB3  DFHMDF LENGTH=10,POS=(13,47),ATTRB=(ASKIP,NORM,FSET)           00083   
         DFHMDF LENGTH=1,POS=(13,58),ATTRB=(ASKIP,NORM)                 00084   
IRDTOB3  DFHMDF LENGTH=10,POS=(13,64),ATTRB=(ASKIP,NORM,FSET)           00085   
         DFHMDF LENGTH=1,POS=(13,75),ATTRB=(ASKIP,NORM)                 00086   
IRDACA4  DFHMDF LENGTH=1,POS=(14,4),ATTRB=(UNPROT,NORM,IC,FSET)         00087   
         DFHMDF LENGTH=1,POS=(14,6),ATTRB=(ASKIP,NORM)                  00088   
IRDFRA4  DFHMDF LENGTH=10,POS=(14,9),ATTRB=(ASKIP,NORM,FSET)            00089   
         DFHMDF LENGTH=1,POS=(14,20),ATTRB=(ASKIP,NORM)                 00090   
IRDTOA4  DFHMDF LENGTH=10,POS=(14,26),ATTRB=(ASKIP,NORM,FSET)           00091   
         DFHMDF LENGTH=1,POS=(14,37),ATTRB=(ASKIP,NORM)                 00092   
IRDACB4  DFHMDF LENGTH=1,POS=(14,42),ATTRB=(UNPROT,NORM,FSET)           00093   
         DFHMDF LENGTH=1,POS=(14,44),ATTRB=(ASKIP,NORM)                 00094   
IRDFRB4  DFHMDF LENGTH=10,POS=(14,47),ATTRB=(ASKIP,NORM,FSET)           00095   
         DFHMDF LENGTH=1,POS=(14,58),ATTRB=(ASKIP,NORM)                 00096   
IRDTOB4  DFHMDF LENGTH=10,POS=(14,64),ATTRB=(ASKIP,NORM,FSET)           00097   
         DFHMDF LENGTH=1,POS=(14,75),ATTRB=(ASKIP,NORM)                 00098   
IRDACA5  DFHMDF LENGTH=1,POS=(15,4),ATTRB=(UNPROT,NORM,IC,FSET)         00099   
         DFHMDF LENGTH=1,POS=(15,6),ATTRB=(ASKIP,NORM)                  00100   
IRDFRA5  DFHMDF LENGTH=10,POS=(15,9),ATTRB=(ASKIP,NORM,FSET)            00101   
         DFHMDF LENGTH=1,POS=(15,20),ATTRB=(ASKIP,NORM)                 00102   
IRDTOA5  DFHMDF LENGTH=10,POS=(15,26),ATTRB=(ASKIP,NORM,FSET)           00103   
         DFHMDF LENGTH=1,POS=(15,37),ATTRB=(ASKIP,NORM)                 00104   
IRDACB5  DFHMDF LENGTH=1,POS=(15,42),ATTRB=(UNPROT,NORM,FSET)           00105   
         DFHMDF LENGTH=1,POS=(15,44),ATTRB=(ASKIP,NORM)                 00106   
IRDFRB5  DFHMDF LENGTH=10,POS=(15,47),ATTRB=(ASKIP,NORM,FSET)           00107   
         DFHMDF LENGTH=1,POS=(15,58),ATTRB=(ASKIP,NORM)                 00108   
IRDTOB5  DFHMDF LENGTH=10,POS=(15,64),ATTRB=(ASKIP,NORM,FSET)           00109   
         DFHMDF LENGTH=1,POS=(15,75),ATTRB=(ASKIP,NORM)                 00110   
IRDACA6  DFHMDF LENGTH=1,POS=(16,4),ATTRB=(UNPROT,NORM,IC,FSET)         00111   
         DFHMDF LENGTH=1,POS=(16,6),ATTRB=(ASKIP,NORM)                  00112   
IRDFRA6  DFHMDF LENGTH=10,POS=(16,9),ATTRB=(ASKIP,NORM,FSET)            00113   
         DFHMDF LENGTH=1,POS=(16,20),ATTRB=(ASKIP,NORM)                 00114   
IRDTOA6  DFHMDF LENGTH=10,POS=(16,26),ATTRB=(ASKIP,NORM,FSET)           00115   
         DFHMDF LENGTH=1,POS=(16,37),ATTRB=(ASKIP,NORM)                 00116   
IRDACB6  DFHMDF LENGTH=1,POS=(16,42),ATTRB=(UNPROT,NORM,FSET)           00117   
         DFHMDF LENGTH=1,POS=(16,44),ATTRB=(ASKIP,NORM)                 00118   
IRDFRB6  DFHMDF LENGTH=10,POS=(16,47),ATTRB=(ASKIP,NORM,FSET)           00119   
         DFHMDF LENGTH=1,POS=(16,58),ATTRB=(ASKIP,NORM)                 00120   
IRDTOB6  DFHMDF LENGTH=10,POS=(16,64),ATTRB=(ASKIP,NORM,FSET)           00121   
         DFHMDF LENGTH=1,POS=(16,75),ATTRB=(ASKIP,NORM)                 00122   
IRDACA7  DFHMDF LENGTH=1,POS=(17,4),ATTRB=(UNPROT,NORM,IC,FSET)         00123   
         DFHMDF LENGTH=1,POS=(17,6),ATTRB=(ASKIP,NORM)                  00124   
IRDFRA7  DFHMDF LENGTH=10,POS=(17,9),ATTRB=(ASKIP,NORM,FSET)            00125   
         DFHMDF LENGTH=1,POS=(17,20),ATTRB=(ASKIP,NORM)                 00126   
IRDTOA7  DFHMDF LENGTH=10,POS=(17,26),ATTRB=(ASKIP,NORM,FSET)           00127   
         DFHMDF LENGTH=1,POS=(17,37),ATTRB=(ASKIP,NORM)                 00128   
IRDACB7  DFHMDF LENGTH=1,POS=(17,42),ATTRB=(UNPROT,NORM,FSET)           00129   
         DFHMDF LENGTH=1,POS=(17,44),ATTRB=(ASKIP,NORM)                 00130   
IRDFRB7  DFHMDF LENGTH=10,POS=(17,47),ATTRB=(ASKIP,NORM,FSET)           00131   
         DFHMDF LENGTH=1,POS=(17,58),ATTRB=(ASKIP,NORM)                 00132   
IRDTOB7  DFHMDF LENGTH=10,POS=(17,64),ATTRB=(ASKIP,NORM,FSET)           00133   
         DFHMDF LENGTH=1,POS=(17,75),ATTRB=(ASKIP,NORM)                 00134   
IRDACA8  DFHMDF LENGTH=1,POS=(18,4),ATTRB=(UNPROT,NORM,IC,FSET)         00135   
         DFHMDF LENGTH=1,POS=(18,6),ATTRB=(ASKIP,NORM)                  00136   
IRDFRA8  DFHMDF LENGTH=10,POS=(18,9),ATTRB=(ASKIP,NORM,FSET)            00137   
         DFHMDF LENGTH=1,POS=(18,20),ATTRB=(ASKIP,NORM)                 00138   
IRDTOA8  DFHMDF LENGTH=10,POS=(18,26),ATTRB=(ASKIP,NORM,FSET)           00139   
         DFHMDF LENGTH=1,POS=(18,37),ATTRB=(ASKIP,NORM)                 00140   
IRDACB8  DFHMDF LENGTH=1,POS=(18,42),ATTRB=(UNPROT,NORM,FSET)           00141   
         DFHMDF LENGTH=1,POS=(18,44),ATTRB=(ASKIP,NORM)                 00142   
IRDFRB8  DFHMDF LENGTH=10,POS=(18,47),ATTRB=(ASKIP,NORM,FSET)           00143   
         DFHMDF LENGTH=1,POS=(18,58),ATTRB=(ASKIP,NORM)                 00144   
IRDTOB8  DFHMDF LENGTH=10,POS=(18,64),ATTRB=(ASKIP,NORM,FSET)           00145   
         DFHMDF LENGTH=1,POS=(18,75),ATTRB=(ASKIP,NORM)                 00146   
IRDACA9  DFHMDF LENGTH=1,POS=(19,4),ATTRB=(UNPROT,NORM,IC,FSET)         00147   
         DFHMDF LENGTH=1,POS=(19,6),ATTRB=(ASKIP,NORM)                  00148   
IRDFRA9  DFHMDF LENGTH=10,POS=(19,9),ATTRB=(ASKIP,NORM,FSET)            00149   
         DFHMDF LENGTH=1,POS=(19,20),ATTRB=(ASKIP,NORM)                 00150   
IRDTOA9  DFHMDF LENGTH=10,POS=(19,26),ATTRB=(ASKIP,NORM,FSET)           00151   
         DFHMDF LENGTH=1,POS=(19,37),ATTRB=(ASKIP,NORM)                 00152   
IRDACB9  DFHMDF LENGTH=1,POS=(19,42),ATTRB=(UNPROT,NORM,FSET)           00153   
         DFHMDF LENGTH=1,POS=(19,44),ATTRB=(ASKIP,NORM)                 00154   
IRDFRB9  DFHMDF LENGTH=10,POS=(19,47),ATTRB=(ASKIP,NORM,FSET)           00155   
         DFHMDF LENGTH=1,POS=(19,58),ATTRB=(ASKIP,NORM)                 00156   
IRDTOB9  DFHMDF LENGTH=10,POS=(19,64),ATTRB=(ASKIP,NORM,FSET)           00157   
         DFHMDF LENGTH=1,POS=(19,75),ATTRB=(ASKIP,NORM)                 00158   
IRDACAA  DFHMDF LENGTH=1,POS=(20,4),ATTRB=(UNPROT,NORM,IC,FSET)         00159   
         DFHMDF LENGTH=1,POS=(20,6),ATTRB=(ASKIP,NORM)                  00160   
IRDFRAA  DFHMDF LENGTH=10,POS=(20,9),ATTRB=(ASKIP,NORM,FSET)            00161   
         DFHMDF LENGTH=1,POS=(20,20),ATTRB=(ASKIP,NORM)                 00162   
IRDTOAA  DFHMDF LENGTH=10,POS=(20,26),ATTRB=(ASKIP,NORM,FSET)           00163   
         DFHMDF LENGTH=1,POS=(20,37),ATTRB=(ASKIP,NORM)                 00164   
IRDACBA  DFHMDF LENGTH=1,POS=(20,42),ATTRB=(UNPROT,NORM,FSET)           00165   
         DFHMDF LENGTH=1,POS=(20,44),ATTRB=(ASKIP,NORM)                 00166   
IRDFRBA  DFHMDF LENGTH=10,POS=(20,47),ATTRB=(ASKIP,NORM,FSET)           00167   
         DFHMDF LENGTH=1,POS=(20,58),ATTRB=(ASKIP,NORM)                 00168   
IRDTOBA  DFHMDF LENGTH=10,POS=(20,64),ATTRB=(ASKIP,NORM,FSET)           00169   
         DFHMDF LENGTH=1,POS=(20,75),ATTRB=(ASKIP,NORM)                 00170   
IRDACAB  DFHMDF LENGTH=1,POS=(21,4),ATTRB=(UNPROT,NORM,IC,FSET)         00171   
         DFHMDF LENGTH=1,POS=(21,6),ATTRB=(ASKIP,NORM)                  00172   
IRDFRAB  DFHMDF LENGTH=10,POS=(21,9),ATTRB=(ASKIP,NORM,FSET)            00173   
         DFHMDF LENGTH=1,POS=(21,20),ATTRB=(ASKIP,NORM)                 00174   
IRDTOAB  DFHMDF LENGTH=10,POS=(21,26),ATTRB=(ASKIP,NORM,FSET)           00175   
         DFHMDF LENGTH=1,POS=(21,37),ATTRB=(ASKIP,NORM)                 00176   
IRDACBB  DFHMDF LENGTH=1,POS=(21,42),ATTRB=(UNPROT,NORM,FSET)           00177   
         DFHMDF LENGTH=1,POS=(21,44),ATTRB=(ASKIP,NORM)                 00178   
IRDFRBB  DFHMDF LENGTH=10,POS=(21,47),ATTRB=(ASKIP,NORM,FSET)           00179   
         DFHMDF LENGTH=1,POS=(21,58),ATTRB=(ASKIP,NORM)                 00180   
IRDTOBB  DFHMDF LENGTH=10,POS=(21,64),ATTRB=(ASKIP,NORM,FSET)           00181   
         DFHMDF LENGTH=1,POS=(21,75),ATTRB=(ASKIP,NORM)                 00182   
IRDACAC  DFHMDF LENGTH=1,POS=(22,4),ATTRB=(UNPROT,NORM,IC,FSET)         00183   
         DFHMDF LENGTH=1,POS=(22,6),ATTRB=(ASKIP,NORM)                  00184   
IRDFRAC  DFHMDF LENGTH=10,POS=(22,9),ATTRB=(ASKIP,NORM,FSET)            00185   
         DFHMDF LENGTH=1,POS=(22,20),ATTRB=(ASKIP,NORM)                 00186   
IRDTOAC  DFHMDF LENGTH=10,POS=(22,26),ATTRB=(ASKIP,NORM,FSET)           00187   
         DFHMDF LENGTH=1,POS=(22,37),ATTRB=(ASKIP,NORM)                 00188   
IRDACBC  DFHMDF LENGTH=1,POS=(22,42),ATTRB=(UNPROT,NORM,FSET)           00189   
         DFHMDF LENGTH=1,POS=(22,44),ATTRB=(ASKIP,NORM)                 00190   
IRDFRBC  DFHMDF LENGTH=10,POS=(22,47),ATTRB=(ASKIP,NORM,FSET)           00191   
         DFHMDF LENGTH=1,POS=(22,58),ATTRB=(ASKIP,NORM)                 00192   
IRDTOBC  DFHMDF LENGTH=10,POS=(22,64),ATTRB=(ASKIP,NORM,FSET)           00193   
         DFHMDF LENGTH=1,POS=(22,75),ATTRB=(ASKIP,NORM)                 00194   
ERRMSG   DFHMDF LENGTH=79,POS=(24,1),ATTRB=(PROT,BRT)                   00195   
         DFHMSD TYPE=FINAL                                              00196   
         END                                                            00197   
/*                                                                      00198   
