GA1WSET  DFHMSD TYPE=MAP,MODE=INOUT,LANG=COBOL,CTRL=FREEKB,DATA=FIELD,TX00001   
               IOAPFX=YES                                               00002   
GA1WI01  DFHMDI SIZE=(24,80)                                            00003   
FUNCTON  DFHMDF LENGTH=0004,POS=(1,1),ATTRB=(PROT,NORM,FSET),INITIAL='GX00004   
               A1W'                                                     00005   
TTLELNE  DFHMDF LENGTH=46,POS=(1,10),ATTRB=(ASKIP,NORM,FSET)            00006   
FUNCLIT  DFHMDF LENGTH=3,POS=(1,61),ATTRB=(ASKIP,NORM,FSET)             00007   
         DFHMDF LENGTH=0008,POS=(1,65),ATTRB=(ASKIP,NORM),INITIAL='SCREX00008   
               EN #'                                                    00009   
SCRNIDN  DFHMDF LENGTH=0006,POS=(1,74),ATTRB=(ASKIP,NORM,FSET),INITIAL=X00010   
               '0A1W00'                                                 00011   
         DFHMDF LENGTH=0047,POS=(2,15),ATTRB=(ASKIP,NORM),INITIAL='RELAX00012   
               TED PROVISIONS / ALTERNATE PROVISIONS      '             00013   
IDLINE   DFHMDF LENGTH=79,POS=(4,1),ATTRB=(ASKIP,NORM,FSET)             00014   
         DFHMDF LENGTH=0011,POS=(5,1),ATTRB=(ASKIP,NORM),INITIAL='CON TX00015   
               AB ID:'                                                  00016   
ALTABID  DFHMDF LENGTH=6,POS=(5,13),ATTRB=(ASKIP,NORM,FSET)             00017   
         DFHMDF LENGTH=0008,POS=(5,21),ATTRB=(ASKIP,NORM),INITIAL='SLOTX00018   
                NO:'                                                    00019   
ALTBSLT  DFHMDF LENGTH=7,POS=(5,30),ATTRB=(ASKIP,NORM,FSET)             00020   
         DFHMDF LENGTH=0011,POS=(5,43),ATTRB=(ASKIP,NORM),INITIAL='INT X00021   
               TAB ID:'                                                 00022   
INTABID  DFHMDF LENGTH=6,POS=(5,55),ATTRB=(ASKIP,NORM,FSET)             00023   
         DFHMDF LENGTH=0008,POS=(5,63),ATTRB=(ASKIP,NORM),INITIAL='SLOTX00024   
                NO:'                                                    00025   
INTBSLT  DFHMDF LENGTH=7,POS=(5,72),ATTRB=(ASKIP,NORM,FSET)             00026   
         DFHMDF LENGTH=0033,POS=(6,1),ATTRB=(ASKIP,NORM),INITIAL='INCLUX00027   
               DE OR EXCLUDE BY PROVISIONS:'                            00028   
INCEXC   DFHMDF LENGTH=1,POS=(6,35),ATTRB=(ASKIP,NORM,FSET)             00029   
ADDELIN  DFHMDF LENGTH=1,POS=(6,38),ATTRB=(ASKIP,DRK,FSET)              00030   
ALTBFNC  DFHMDF LENGTH=4,POS=(6,40),ATTRB=(ASKIP,DRK,FSET)              00031   
OENTCTR  DFHMDF LENGTH=7,POS=(6,46),ATTRB=(ASKIP,DRK,FSET)              00032   
FRMNUID  DFHMDF LENGTH=4,POS=(6,55),ATTRB=(ASKIP,DRK,FSET)              00033   
         DFHMDF LENGTH=0006,POS=(8,2),ATTRB=(ASKIP,NORM),INITIAL='ACTIOX00034   
               N'                                                       00035   
         DFHMDF LENGTH=0010,POS=(8,11),ATTRB=(ASKIP,NORM),INITIAL='PROVX00036   
               ISIONS'                                                  00037   
         DFHMDF LENGTH=0006,POS=(8,28),ATTRB=(ASKIP,NORM),INITIAL='ACTIX00038   
               ON'                                                      00039   
         DFHMDF LENGTH=0010,POS=(8,37),ATTRB=(ASKIP,NORM),INITIAL='PROVX00040   
               ISIONS'                                                  00041   
         DFHMDF LENGTH=0006,POS=(8,55),ATTRB=(ASKIP,NORM),INITIAL='ACTIX00042   
               ON'                                                      00043   
         DFHMDF LENGTH=0010,POS=(8,64),ATTRB=(ASKIP,NORM),INITIAL='PROVX00044   
               ISIONS'                                                  00045   
         DFHMDF LENGTH=0004,POS=(9,3),ATTRB=(ASKIP,NORM),INITIAL='CODE' 00046   
         DFHMDF LENGTH=0007,POS=(9,9),ATTRB=(ASKIP,NORM),INITIAL='RELATX00047   
               ED'                                                      00048   
         DFHMDF LENGTH=0005,POS=(9,19),ATTRB=(ASKIP,NORM),INITIAL='ALTEX00049   
               R'                                                       00050   
         DFHMDF LENGTH=0004,POS=(9,29),ATTRB=(ASKIP,NORM),INITIAL='CODEX00051   
               '                                                        00052   
         DFHMDF LENGTH=0007,POS=(9,35),ATTRB=(ASKIP,NORM),INITIAL='RELAX00053   
               TED'                                                     00054   
         DFHMDF LENGTH=0005,POS=(9,45),ATTRB=(ASKIP,NORM),INITIAL='ALTEX00055   
               R'                                                       00056   
         DFHMDF LENGTH=0004,POS=(9,56),ATTRB=(ASKIP,NORM),INITIAL='CODEX00057   
               '                                                        00058   
         DFHMDF LENGTH=0007,POS=(9,62),ATTRB=(ASKIP,NORM),INITIAL='RELAX00059   
               TED'                                                     00060   
         DFHMDF LENGTH=0005,POS=(9,72),ATTRB=(ASKIP,NORM),INITIAL='ALTEX00061   
               R'                                                       00062   
IRPACA1  DFHMDF LENGTH=1,POS=(11,4),ATTRB=(UNPROT,NORM,IC,FSET)         00063   
         DFHMDF LENGTH=1,POS=(11,6),ATTRB=(ASKIP,NORM)                  00064   
IRPVRA1  DFHMDF LENGTH=6,POS=(11,10),ATTRB=(ASKIP,NORM,FSET)            00065   
IRPVAA1  DFHMDF LENGTH=6,POS=(11,18),ATTRB=(ASKIP,NORM,FSET)            00066   
         DFHMDF LENGTH=1,POS=(11,25),ATTRB=(ASKIP,NORM)                 00067   
IRPACB1  DFHMDF LENGTH=1,POS=(11,30),ATTRB=(UNPROT,NORM,FSET)           00068   
         DFHMDF LENGTH=1,POS=(11,32),ATTRB=(ASKIP,NORM)                 00069   
IRPVRB1  DFHMDF LENGTH=6,POS=(11,36),ATTRB=(ASKIP,NORM,FSET)            00070   
IRPVAB1  DFHMDF LENGTH=6,POS=(11,44),ATTRB=(ASKIP,NORM,FSET)            00071   
         DFHMDF LENGTH=1,POS=(11,51),ATTRB=(ASKIP,NORM)                 00072   
IRPACC1  DFHMDF LENGTH=1,POS=(11,57),ATTRB=(UNPROT,NORM,FSET)           00073   
         DFHMDF LENGTH=1,POS=(11,59),ATTRB=(ASKIP,NORM)                 00074   
IRPVRC1  DFHMDF LENGTH=6,POS=(11,63),ATTRB=(ASKIP,NORM,FSET)            00075   
IRPVAC1  DFHMDF LENGTH=6,POS=(11,71),ATTRB=(ASKIP,NORM,FSET)            00076   
         DFHMDF LENGTH=1,POS=(11,78),ATTRB=(ASKIP,NORM)                 00077   
IRPACA2  DFHMDF LENGTH=1,POS=(12,4),ATTRB=(UNPROT,NORM,FSET)            00078   
         DFHMDF LENGTH=1,POS=(12,6),ATTRB=(ASKIP,NORM)                  00079   
IRPVRA2  DFHMDF LENGTH=6,POS=(12,10),ATTRB=(ASKIP,NORM,FSET)            00080   
IRPVAA2  DFHMDF LENGTH=6,POS=(12,18),ATTRB=(ASKIP,NORM,FSET)            00081   
         DFHMDF LENGTH=1,POS=(12,25),ATTRB=(ASKIP,NORM)                 00082   
IRPACB2  DFHMDF LENGTH=1,POS=(12,30),ATTRB=(UNPROT,NORM,FSET)           00083   
         DFHMDF LENGTH=1,POS=(12,32),ATTRB=(ASKIP,NORM)                 00084   
IRPVRB2  DFHMDF LENGTH=6,POS=(12,36),ATTRB=(ASKIP,NORM,FSET)            00085   
IRPVAB2  DFHMDF LENGTH=6,POS=(12,44),ATTRB=(ASKIP,NORM,FSET)            00086   
         DFHMDF LENGTH=1,POS=(12,51),ATTRB=(ASKIP,NORM)                 00087   
IRPACC2  DFHMDF LENGTH=1,POS=(12,57),ATTRB=(UNPROT,NORM,FSET)           00088   
         DFHMDF LENGTH=1,POS=(12,59),ATTRB=(ASKIP,NORM)                 00089   
IRPVRC2  DFHMDF LENGTH=6,POS=(12,63),ATTRB=(ASKIP,NORM,FSET)            00090   
IRPVAC2  DFHMDF LENGTH=6,POS=(12,71),ATTRB=(ASKIP,NORM,FSET)            00091   
         DFHMDF LENGTH=1,POS=(12,78),ATTRB=(ASKIP,NORM)                 00092   
IRPACA3  DFHMDF LENGTH=1,POS=(13,4),ATTRB=(UNPROT,NORM,FSET)            00093   
         DFHMDF LENGTH=1,POS=(13,6),ATTRB=(ASKIP,NORM)                  00094   
IRPVRA3  DFHMDF LENGTH=6,POS=(13,10),ATTRB=(ASKIP,NORM,FSET)            00095   
IRPVAA3  DFHMDF LENGTH=6,POS=(13,18),ATTRB=(ASKIP,NORM,FSET)            00096   
         DFHMDF LENGTH=1,POS=(13,25),ATTRB=(ASKIP,NORM)                 00097   
IRPACB3  DFHMDF LENGTH=1,POS=(13,30),ATTRB=(UNPROT,NORM,FSET)           00098   
         DFHMDF LENGTH=1,POS=(13,32),ATTRB=(ASKIP,NORM)                 00099   
IRPVRB3  DFHMDF LENGTH=6,POS=(13,36),ATTRB=(ASKIP,NORM,FSET)            00100   
IRPVAB3  DFHMDF LENGTH=6,POS=(13,44),ATTRB=(ASKIP,NORM,FSET)            00101   
         DFHMDF LENGTH=1,POS=(13,51),ATTRB=(ASKIP,NORM)                 00102   
IRPACC3  DFHMDF LENGTH=1,POS=(13,57),ATTRB=(UNPROT,NORM,FSET)           00103   
         DFHMDF LENGTH=1,POS=(13,59),ATTRB=(ASKIP,NORM)                 00104   
IRPVRC3  DFHMDF LENGTH=6,POS=(13,63),ATTRB=(ASKIP,NORM,FSET)            00105   
IRPVAC3  DFHMDF LENGTH=6,POS=(13,71),ATTRB=(ASKIP,NORM,FSET)            00106   
         DFHMDF LENGTH=1,POS=(13,78),ATTRB=(ASKIP,NORM)                 00107   
IRPACA4  DFHMDF LENGTH=1,POS=(14,4),ATTRB=(UNPROT,NORM,FSET)            00108   
         DFHMDF LENGTH=1,POS=(14,6),ATTRB=(ASKIP,NORM)                  00109   
IRPVRA4  DFHMDF LENGTH=6,POS=(14,10),ATTRB=(ASKIP,NORM,FSET)            00110   
IRPVAA4  DFHMDF LENGTH=6,POS=(14,18),ATTRB=(ASKIP,NORM,FSET)            00111   
         DFHMDF LENGTH=1,POS=(14,25),ATTRB=(ASKIP,NORM)                 00112   
IRPACB4  DFHMDF LENGTH=1,POS=(14,30),ATTRB=(UNPROT,NORM,FSET)           00113   
         DFHMDF LENGTH=1,POS=(14,32),ATTRB=(ASKIP,NORM)                 00114   
IRPVRB4  DFHMDF LENGTH=6,POS=(14,36),ATTRB=(ASKIP,NORM,FSET)            00115   
IRPVAB4  DFHMDF LENGTH=6,POS=(14,44),ATTRB=(ASKIP,NORM,FSET)            00116   
         DFHMDF LENGTH=1,POS=(14,51),ATTRB=(ASKIP,NORM)                 00117   
IRPACC4  DFHMDF LENGTH=1,POS=(14,57),ATTRB=(UNPROT,NORM,FSET)           00118   
         DFHMDF LENGTH=1,POS=(14,59),ATTRB=(ASKIP,NORM)                 00119   
IRPVRC4  DFHMDF LENGTH=6,POS=(14,63),ATTRB=(ASKIP,NORM,FSET)            00120   
IRPVAC4  DFHMDF LENGTH=6,POS=(14,71),ATTRB=(ASKIP,NORM,FSET)            00121   
         DFHMDF LENGTH=1,POS=(14,78),ATTRB=(ASKIP,NORM)                 00122   
IRPACA5  DFHMDF LENGTH=1,POS=(15,4),ATTRB=(UNPROT,NORM,FSET)            00123   
         DFHMDF LENGTH=1,POS=(15,6),ATTRB=(ASKIP,NORM)                  00124   
IRPVRA5  DFHMDF LENGTH=6,POS=(15,10),ATTRB=(ASKIP,NORM,FSET)            00125   
IRPVAA5  DFHMDF LENGTH=6,POS=(15,18),ATTRB=(ASKIP,NORM,FSET)            00126   
         DFHMDF LENGTH=1,POS=(15,25),ATTRB=(ASKIP,NORM)                 00127   
IRPACB5  DFHMDF LENGTH=1,POS=(15,30),ATTRB=(UNPROT,NORM,FSET)           00128   
         DFHMDF LENGTH=1,POS=(15,32),ATTRB=(ASKIP,NORM)                 00129   
IRPVRB5  DFHMDF LENGTH=6,POS=(15,36),ATTRB=(ASKIP,NORM,FSET)            00130   
IRPVAB5  DFHMDF LENGTH=6,POS=(15,44),ATTRB=(ASKIP,NORM,FSET)            00131   
         DFHMDF LENGTH=1,POS=(15,51),ATTRB=(ASKIP,NORM)                 00132   
IRPACC5  DFHMDF LENGTH=1,POS=(15,57),ATTRB=(UNPROT,NORM,FSET)           00133   
         DFHMDF LENGTH=1,POS=(15,59),ATTRB=(ASKIP,NORM)                 00134   
IRPVRC5  DFHMDF LENGTH=6,POS=(15,63),ATTRB=(ASKIP,NORM,FSET)            00135   
IRPVAC5  DFHMDF LENGTH=6,POS=(15,71),ATTRB=(ASKIP,NORM,FSET)            00136   
         DFHMDF LENGTH=1,POS=(15,78),ATTRB=(ASKIP,NORM)                 00137   
IRPACA6  DFHMDF LENGTH=1,POS=(16,4),ATTRB=(UNPROT,NORM,FSET)            00138   
         DFHMDF LENGTH=1,POS=(16,6),ATTRB=(ASKIP,NORM)                  00139   
IRPVRA6  DFHMDF LENGTH=6,POS=(16,10),ATTRB=(ASKIP,NORM,FSET)            00140   
IRPVAA6  DFHMDF LENGTH=6,POS=(16,18),ATTRB=(ASKIP,NORM,FSET)            00141   
         DFHMDF LENGTH=1,POS=(16,25),ATTRB=(ASKIP,NORM)                 00142   
IRPACB6  DFHMDF LENGTH=1,POS=(16,30),ATTRB=(UNPROT,NORM,FSET)           00143   
         DFHMDF LENGTH=1,POS=(16,32),ATTRB=(ASKIP,NORM)                 00144   
IRPVRB6  DFHMDF LENGTH=6,POS=(16,36),ATTRB=(ASKIP,NORM,FSET)            00145   
IRPVAB6  DFHMDF LENGTH=6,POS=(16,44),ATTRB=(ASKIP,NORM,FSET)            00146   
         DFHMDF LENGTH=1,POS=(16,51),ATTRB=(ASKIP,NORM)                 00147   
IRPACC6  DFHMDF LENGTH=1,POS=(16,57),ATTRB=(UNPROT,NORM,FSET)           00148   
         DFHMDF LENGTH=1,POS=(16,59),ATTRB=(ASKIP,NORM)                 00149   
IRPVRC6  DFHMDF LENGTH=6,POS=(16,63),ATTRB=(ASKIP,NORM,FSET)            00150   
IRPVAC6  DFHMDF LENGTH=6,POS=(16,71),ATTRB=(ASKIP,NORM,FSET)            00151   
         DFHMDF LENGTH=1,POS=(16,78),ATTRB=(ASKIP,NORM)                 00152   
IRPACA7  DFHMDF LENGTH=1,POS=(17,4),ATTRB=(UNPROT,NORM,FSET)            00153   
         DFHMDF LENGTH=1,POS=(17,6),ATTRB=(ASKIP,NORM)                  00154   
IRPVRA7  DFHMDF LENGTH=6,POS=(17,10),ATTRB=(ASKIP,NORM,FSET)            00155   
IRPVAA7  DFHMDF LENGTH=6,POS=(17,18),ATTRB=(ASKIP,NORM,FSET)            00156   
         DFHMDF LENGTH=1,POS=(17,25),ATTRB=(ASKIP,NORM)                 00157   
IRPACB7  DFHMDF LENGTH=1,POS=(17,30),ATTRB=(UNPROT,NORM,FSET)           00158   
         DFHMDF LENGTH=1,POS=(17,32),ATTRB=(ASKIP,NORM)                 00159   
IRPVRB7  DFHMDF LENGTH=6,POS=(17,36),ATTRB=(ASKIP,NORM,FSET)            00160   
IRPVAB7  DFHMDF LENGTH=6,POS=(17,44),ATTRB=(ASKIP,NORM,FSET)            00161   
         DFHMDF LENGTH=1,POS=(17,51),ATTRB=(ASKIP,NORM)                 00162   
IRPACC7  DFHMDF LENGTH=1,POS=(17,57),ATTRB=(UNPROT,NORM,FSET)           00163   
         DFHMDF LENGTH=1,POS=(17,59),ATTRB=(ASKIP,NORM)                 00164   
IRPVRC7  DFHMDF LENGTH=6,POS=(17,63),ATTRB=(ASKIP,NORM,FSET)            00165   
IRPVAC7  DFHMDF LENGTH=6,POS=(17,71),ATTRB=(ASKIP,NORM,FSET)            00166   
         DFHMDF LENGTH=1,POS=(17,78),ATTRB=(ASKIP,NORM)                 00167   
IRPACA8  DFHMDF LENGTH=1,POS=(18,4),ATTRB=(UNPROT,NORM,FSET)            00168   
         DFHMDF LENGTH=1,POS=(18,6),ATTRB=(ASKIP,NORM)                  00169   
IRPVRA8  DFHMDF LENGTH=6,POS=(18,10),ATTRB=(ASKIP,NORM,FSET)            00170   
IRPVAA8  DFHMDF LENGTH=6,POS=(18,18),ATTRB=(ASKIP,NORM,FSET)            00171   
         DFHMDF LENGTH=1,POS=(18,25),ATTRB=(ASKIP,NORM)                 00172   
IRPACB8  DFHMDF LENGTH=1,POS=(18,30),ATTRB=(UNPROT,NORM,FSET)           00173   
         DFHMDF LENGTH=1,POS=(18,32),ATTRB=(ASKIP,NORM)                 00174   
IRPVRB8  DFHMDF LENGTH=6,POS=(18,36),ATTRB=(ASKIP,NORM,FSET)            00175   
IRPVAB8  DFHMDF LENGTH=6,POS=(18,44),ATTRB=(ASKIP,NORM,FSET)            00176   
         DFHMDF LENGTH=1,POS=(18,51),ATTRB=(ASKIP,NORM)                 00177   
IRPACC8  DFHMDF LENGTH=1,POS=(18,57),ATTRB=(UNPROT,NORM,FSET)           00178   
         DFHMDF LENGTH=1,POS=(18,59),ATTRB=(ASKIP,NORM)                 00179   
IRPVRC8  DFHMDF LENGTH=6,POS=(18,63),ATTRB=(ASKIP,NORM,FSET)            00180   
IRPVAC8  DFHMDF LENGTH=6,POS=(18,71),ATTRB=(ASKIP,NORM,FSET)            00181   
         DFHMDF LENGTH=1,POS=(18,78),ATTRB=(ASKIP,NORM)                 00182   
IRPACA9  DFHMDF LENGTH=1,POS=(19,4),ATTRB=(UNPROT,NORM,FSET)            00183   
         DFHMDF LENGTH=1,POS=(19,6),ATTRB=(ASKIP,NORM)                  00184   
IRPVRA9  DFHMDF LENGTH=6,POS=(19,10),ATTRB=(ASKIP,NORM,FSET)            00185   
IRPVAA9  DFHMDF LENGTH=6,POS=(19,18),ATTRB=(ASKIP,NORM,FSET)            00186   
         DFHMDF LENGTH=1,POS=(19,25),ATTRB=(ASKIP,NORM)                 00187   
IRPACB9  DFHMDF LENGTH=1,POS=(19,30),ATTRB=(UNPROT,NORM,FSET)           00188   
         DFHMDF LENGTH=1,POS=(19,32),ATTRB=(ASKIP,NORM)                 00189   
IRPVRB9  DFHMDF LENGTH=6,POS=(19,36),ATTRB=(ASKIP,NORM,FSET)            00190   
IRPVAB9  DFHMDF LENGTH=6,POS=(19,44),ATTRB=(ASKIP,NORM,FSET)            00191   
         DFHMDF LENGTH=1,POS=(19,51),ATTRB=(ASKIP,NORM)                 00192   
IRPACC9  DFHMDF LENGTH=1,POS=(19,57),ATTRB=(UNPROT,NORM,FSET)           00193   
         DFHMDF LENGTH=1,POS=(19,59),ATTRB=(ASKIP,NORM)                 00194   
IRPVRC9  DFHMDF LENGTH=6,POS=(19,63),ATTRB=(ASKIP,NORM,FSET)            00195   
IRPVAC9  DFHMDF LENGTH=6,POS=(19,71),ATTRB=(ASKIP,NORM,FSET)            00196   
         DFHMDF LENGTH=1,POS=(19,78),ATTRB=(ASKIP,NORM)                 00197   
IRPACAA  DFHMDF LENGTH=1,POS=(20,4),ATTRB=(UNPROT,NORM,FSET)            00198   
         DFHMDF LENGTH=1,POS=(20,6),ATTRB=(ASKIP,NORM)                  00199   
IRPVRAA  DFHMDF LENGTH=6,POS=(20,10),ATTRB=(ASKIP,NORM,FSET)            00200   
IRPVAAA  DFHMDF LENGTH=6,POS=(20,18),ATTRB=(ASKIP,NORM,FSET)            00201   
         DFHMDF LENGTH=1,POS=(20,25),ATTRB=(ASKIP,NORM)                 00202   
IRPACBA  DFHMDF LENGTH=1,POS=(20,30),ATTRB=(UNPROT,NORM,FSET)           00203   
         DFHMDF LENGTH=1,POS=(20,32),ATTRB=(ASKIP,NORM)                 00204   
IRPVRBA  DFHMDF LENGTH=6,POS=(20,36),ATTRB=(ASKIP,NORM,FSET)            00205   
IRPVABA  DFHMDF LENGTH=6,POS=(20,44),ATTRB=(ASKIP,NORM,FSET)            00206   
         DFHMDF LENGTH=1,POS=(20,51),ATTRB=(ASKIP,NORM)                 00207   
IRPACCA  DFHMDF LENGTH=1,POS=(20,57),ATTRB=(UNPROT,NORM,FSET)           00208   
         DFHMDF LENGTH=1,POS=(20,59),ATTRB=(ASKIP,NORM)                 00209   
IRPVRCA  DFHMDF LENGTH=6,POS=(20,63),ATTRB=(ASKIP,NORM,FSET)            00210   
IRPVACA  DFHMDF LENGTH=6,POS=(20,71),ATTRB=(ASKIP,NORM,FSET)            00211   
         DFHMDF LENGTH=1,POS=(20,78),ATTRB=(ASKIP,NORM)                 00212   
IRPACAB  DFHMDF LENGTH=1,POS=(21,4),ATTRB=(UNPROT,NORM,FSET)            00213   
         DFHMDF LENGTH=1,POS=(21,6),ATTRB=(ASKIP,NORM)                  00214   
IRPVRAB  DFHMDF LENGTH=6,POS=(21,10),ATTRB=(ASKIP,NORM,FSET)            00215   
IRPVAAB  DFHMDF LENGTH=6,POS=(21,18),ATTRB=(ASKIP,NORM,FSET)            00216   
         DFHMDF LENGTH=1,POS=(21,25),ATTRB=(ASKIP,NORM)                 00217   
IRPACBB  DFHMDF LENGTH=1,POS=(21,30),ATTRB=(UNPROT,NORM,FSET)           00218   
         DFHMDF LENGTH=1,POS=(21,32),ATTRB=(ASKIP,NORM)                 00219   
IRPVRBB  DFHMDF LENGTH=6,POS=(21,36),ATTRB=(ASKIP,NORM,FSET)            00220   
IRPVABB  DFHMDF LENGTH=6,POS=(21,44),ATTRB=(ASKIP,NORM,FSET)            00221   
         DFHMDF LENGTH=1,POS=(21,51),ATTRB=(ASKIP,NORM)                 00222   
IRPACCB  DFHMDF LENGTH=1,POS=(21,57),ATTRB=(UNPROT,NORM,FSET)           00223   
         DFHMDF LENGTH=1,POS=(21,59),ATTRB=(ASKIP,NORM)                 00224   
IRPVRCB  DFHMDF LENGTH=6,POS=(21,63),ATTRB=(ASKIP,NORM,FSET)            00225   
IRPVACB  DFHMDF LENGTH=6,POS=(21,71),ATTRB=(ASKIP,NORM,FSET)            00226   
         DFHMDF LENGTH=1,POS=(21,78),ATTRB=(ASKIP,NORM)                 00227   
IRPACAC  DFHMDF LENGTH=1,POS=(22,4),ATTRB=(UNPROT,NORM,FSET)            00228   
         DFHMDF LENGTH=1,POS=(22,6),ATTRB=(ASKIP,NORM)                  00229   
IRPVRAC  DFHMDF LENGTH=6,POS=(22,10),ATTRB=(ASKIP,NORM,FSET)            00230   
IRPVAAC  DFHMDF LENGTH=6,POS=(22,18),ATTRB=(ASKIP,NORM,FSET)            00231   
         DFHMDF LENGTH=1,POS=(22,25),ATTRB=(ASKIP,NORM)                 00232   
IRPACBC  DFHMDF LENGTH=1,POS=(22,30),ATTRB=(UNPROT,NORM,FSET)           00233   
         DFHMDF LENGTH=1,POS=(22,32),ATTRB=(ASKIP,NORM)                 00234   
IRPVRBC  DFHMDF LENGTH=6,POS=(22,36),ATTRB=(ASKIP,NORM,FSET)            00235   
IRPVABC  DFHMDF LENGTH=6,POS=(22,44),ATTRB=(ASKIP,NORM,FSET)            00236   
         DFHMDF LENGTH=1,POS=(22,51),ATTRB=(ASKIP,NORM)                 00237   
IRPACCC  DFHMDF LENGTH=1,POS=(22,57),ATTRB=(UNPROT,NORM,FSET)           00238   
         DFHMDF LENGTH=1,POS=(22,59),ATTRB=(ASKIP,NORM)                 00239   
IRPVRCC  DFHMDF LENGTH=6,POS=(22,63),ATTRB=(ASKIP,NORM,FSET)            00240   
IRPVACC  DFHMDF LENGTH=6,POS=(22,71),ATTRB=(ASKIP,NORM,FSET)            00241   
         DFHMDF LENGTH=1,POS=(22,78),ATTRB=(ASKIP,NORM)                 00242   
ERRMSG   DFHMDF LENGTH=79,POS=(24,1),ATTRB=(PROT,BRT)                   00243   
         DFHMSD TYPE=FINAL                                              00244   
         END                                                            00245   
/*                                                                      00246   
