GA2HSET  DFHMSD TYPE=MAP,MODE=INOUT,LANG=COBOL,CTRL=FREEKB,DATA=FIELD,TX00001   
               IOAPFX=YES                                               00002   
GA2HI01  DFHMDI SIZE=(24,80)                                            00003   
FUNCTON  DFHMDF LENGTH=0004,POS=(1,1),ATTRB=(PROT,NORM,FSET),INITIAL='GX00004   
               A2H'                                                     00005   
TTLELNE  DFHMDF LENGTH=46,POS=(1,10),ATTRB=(ASKIP,NORM,FSET)            00006   
ADDLIT   DFHMDF LENGTH=0003,POS=(1,61),ATTRB=(ASKIP,NORM),INITIAL='ADD' 00007   
         DFHMDF LENGTH=0008,POS=(1,65),ATTRB=(ASKIP,NORM),INITIAL='SCREX00008   
               EN #'                                                    00009   
SCRNIDN  DFHMDF LENGTH=0006,POS=(1,74),ATTRB=(ASKIP,NORM,FSET),INITIAL=X00010   
               '002H00'                                                 00011   
         DFHMDF LENGTH=0034,POS=(2,16),ATTRB=(ASKIP,NORM),INITIAL='PROVX00012   
               IDER-GROUP BY PROVIDER NUMBERS'                          00013   
IDLINE   DFHMDF LENGTH=79,POS=(3,1),ATTRB=(ASKIP,NORM,FSET)             00014   
         DFHMDF LENGTH=0015,POS=(4,1),ATTRB=(ASKIP,NORM),INITIAL='ALL LX00015   
               VL TAB ID='                                              00016   
ALTABID  DFHMDF LENGTH=6,POS=(4,17),ATTRB=(ASKIP,NORM,FSET)             00017   
         DFHMDF LENGTH=0006,POS=(4,25),ATTRB=(ASKIP,NORM),INITIAL='SLT X00018   
               #='                                                      00019   
ALTBSLT  DFHMDF LENGTH=7,POS=(4,32),ATTRB=(ASKIP,NORM,FSET)             00020   
         DFHMDF LENGTH=0016,POS=(4,41),ATTRB=(ASKIP,NORM),INITIAL='INTEX00021   
               RNAL TAB ID='                                            00022   
INTABID  DFHMDF LENGTH=6,POS=(4,58),ATTRB=(ASKIP,NORM,FSET)             00023   
         DFHMDF LENGTH=0006,POS=(4,66),ATTRB=(ASKIP,NORM),INITIAL='SLT X00024   
               #='                                                      00025   
INTBSLT  DFHMDF LENGTH=7,POS=(4,73),ATTRB=(ASKIP,NORM,FSET)             00026   
         DFHMDF LENGTH=0027,POS=(5,1),ATTRB=(ASKIP,NORM),INITIAL='INCLUX00027   
               DE/EXCLUDE BY PROVIDER'                                  00028   
INCEXC   DFHMDF LENGTH=1,POS=(5,30),ATTRB=(UNPROT,NORM,IC,FSET)         00029   
         DFHMDF LENGTH=1,POS=(5,32),ATTRB=(ASKIP,NORM)                  00030   
INEXDRK  DFHMDF LENGTH=1,POS=(5,34),ATTRB=(ASKIP,DRK,FSET)              00031   
ADDELIN  DFHMDF LENGTH=1,POS=(5,41),ATTRB=(ASKIP,DRK,FSET)              00032   
ALTBFNC  DFHMDF LENGTH=4,POS=(5,49),ATTRB=(ASKIP,DRK,FSET)              00033   
OENTCTR  DFHMDF LENGTH=7,POS=(5,61),ATTRB=(ASKIP,DRK,FSET)              00034   
FRMNUID  DFHMDF LENGTH=4,POS=(5,75),ATTRB=(ASKIP,DRK,FSET)              00035   
         DFHMDF LENGTH=0015,POS=(7,7),ATTRB=(ASKIP,NORM),INITIAL='PROVIX00036   
               DER NUMBER'                                              00037   
         DFHMDF LENGTH=0015,POS=(7,33),ATTRB=(ASKIP,NORM),INITIAL='PROVX00038   
               IDER NUMBER'                                             00039   
         DFHMDF LENGTH=0015,POS=(7,59),ATTRB=(ASKIP,NORM),INITIAL='PROVX00040   
               IDER NUMBER'                                             00041   
         DFHMDF LENGTH=0008,POS=(8,10),ATTRB=(ASKIP,NORM),INITIAL='ARGUX00042   
               MENT'                                                    00043   
         DFHMDF LENGTH=0008,POS=(8,36),ATTRB=(ASKIP,NORM),INITIAL='ARGUX00044   
               MENT'                                                    00045   
         DFHMDF LENGTH=0008,POS=(8,62),ATTRB=(ASKIP,NORM),INITIAL='ARGUX00046   
               MENT'                                                    00047   
S2HPN1A  DFHMDF LENGTH=10,POS=(9,9),ATTRB=(UNPROT,NORM,FSET),JUSTIFY=(RX00048   
               IGHT,ZERO)                                               00049   
         DFHMDF LENGTH=1,POS=(9,20),ATTRB=(ASKIP,NORM)                  00050   
S2HPN2A  DFHMDF LENGTH=10,POS=(9,35),ATTRB=(UNPROT,NORM,FSET),JUSTIFY=(X00051   
               RIGHT,ZERO)                                              00052   
         DFHMDF LENGTH=1,POS=(9,46),ATTRB=(ASKIP,NORM)                  00053   
S2HPN3A  DFHMDF LENGTH=10,POS=(9,61),ATTRB=(UNPROT,NORM,FSET),JUSTIFY=(X00054   
               RIGHT,ZERO)                                              00055   
         DFHMDF LENGTH=1,POS=(9,72),ATTRB=(ASKIP,NORM)                  00056   
S2HPN1B  DFHMDF LENGTH=10,POS=(10,9),ATTRB=(UNPROT,NORM,FSET),JUSTIFY=(X00057   
               RIGHT,ZERO)                                              00058   
         DFHMDF LENGTH=1,POS=(10,20),ATTRB=(ASKIP,NORM)                 00059   
S2HPN2B  DFHMDF LENGTH=10,POS=(10,35),ATTRB=(UNPROT,NORM,FSET),JUSTIFY=X00060   
               (RIGHT,ZERO)                                             00061   
         DFHMDF LENGTH=1,POS=(10,46),ATTRB=(ASKIP,NORM)                 00062   
S2HPN3B  DFHMDF LENGTH=10,POS=(10,61),ATTRB=(UNPROT,NORM,FSET),JUSTIFY=X00063   
               (RIGHT,ZERO)                                             00064   
         DFHMDF LENGTH=1,POS=(10,72),ATTRB=(ASKIP,NORM)                 00065   
S2HPN1C  DFHMDF LENGTH=10,POS=(11,9),ATTRB=(UNPROT,NORM,FSET),JUSTIFY=(X00066   
               RIGHT,ZERO)                                              00067   
         DFHMDF LENGTH=1,POS=(11,20),ATTRB=(ASKIP,NORM)                 00068   
S2HPN2C  DFHMDF LENGTH=10,POS=(11,35),ATTRB=(UNPROT,NORM,FSET),JUSTIFY=X00069   
               (RIGHT,ZERO)                                             00070   
         DFHMDF LENGTH=1,POS=(11,46),ATTRB=(ASKIP,NORM)                 00071   
S2HPN3C  DFHMDF LENGTH=10,POS=(11,61),ATTRB=(UNPROT,NORM,FSET),JUSTIFY=X00072   
               (RIGHT,ZERO)                                             00073   
         DFHMDF LENGTH=1,POS=(11,72),ATTRB=(ASKIP,NORM)                 00074   
S2HPN1D  DFHMDF LENGTH=10,POS=(12,9),ATTRB=(UNPROT,NORM,FSET),JUSTIFY=(X00075   
               RIGHT,ZERO)                                              00076   
         DFHMDF LENGTH=1,POS=(12,20),ATTRB=(ASKIP,NORM)                 00077   
S2HPN2D  DFHMDF LENGTH=10,POS=(12,35),ATTRB=(UNPROT,NORM,FSET),JUSTIFY=X00078   
               (RIGHT,ZERO)                                             00079   
         DFHMDF LENGTH=1,POS=(12,46),ATTRB=(ASKIP,NORM)                 00080   
S2HPN3D  DFHMDF LENGTH=10,POS=(12,61),ATTRB=(UNPROT,NORM,FSET),JUSTIFY=X00081   
               (RIGHT,ZERO)                                             00082   
         DFHMDF LENGTH=1,POS=(12,72),ATTRB=(ASKIP,NORM)                 00083   
S2HPN1E  DFHMDF LENGTH=10,POS=(13,9),ATTRB=(UNPROT,NORM,FSET),JUSTIFY=(X00084   
               RIGHT,ZERO)                                              00085   
         DFHMDF LENGTH=1,POS=(13,20),ATTRB=(ASKIP,NORM)                 00086   
S2HPN2E  DFHMDF LENGTH=10,POS=(13,35),ATTRB=(UNPROT,NORM,FSET),JUSTIFY=X00087   
               (RIGHT,ZERO)                                             00088   
         DFHMDF LENGTH=1,POS=(13,46),ATTRB=(ASKIP,NORM)                 00089   
S2HPN3E  DFHMDF LENGTH=10,POS=(13,61),ATTRB=(UNPROT,NORM,FSET),JUSTIFY=X00090   
               (RIGHT,ZERO)                                             00091   
         DFHMDF LENGTH=1,POS=(13,72),ATTRB=(ASKIP,NORM)                 00092   
S2HPN1F  DFHMDF LENGTH=10,POS=(14,9),ATTRB=(UNPROT,NORM,FSET),JUSTIFY=(X00093   
               RIGHT,ZERO)                                              00094   
         DFHMDF LENGTH=1,POS=(14,20),ATTRB=(ASKIP,NORM)                 00095   
S2HPN2F  DFHMDF LENGTH=10,POS=(14,35),ATTRB=(UNPROT,NORM,FSET),JUSTIFY=X00096   
               (RIGHT,ZERO)                                             00097   
         DFHMDF LENGTH=1,POS=(14,46),ATTRB=(ASKIP,NORM)                 00098   
S2HPN3F  DFHMDF LENGTH=10,POS=(14,61),ATTRB=(UNPROT,NORM,FSET),JUSTIFY=X00099   
               (RIGHT,ZERO)                                             00100   
         DFHMDF LENGTH=1,POS=(14,72),ATTRB=(ASKIP,NORM)                 00101   
S2HPN1G  DFHMDF LENGTH=10,POS=(15,9),ATTRB=(UNPROT,NORM,FSET),JUSTIFY=(X00102   
               RIGHT,ZERO)                                              00103   
         DFHMDF LENGTH=1,POS=(15,20),ATTRB=(ASKIP,NORM)                 00104   
S2HPN2G  DFHMDF LENGTH=10,POS=(15,35),ATTRB=(UNPROT,NORM,FSET),JUSTIFY=X00105   
               (RIGHT,ZERO)                                             00106   
         DFHMDF LENGTH=1,POS=(15,46),ATTRB=(ASKIP,NORM)                 00107   
S2HPN3G  DFHMDF LENGTH=10,POS=(15,61),ATTRB=(UNPROT,NORM,FSET),JUSTIFY=X00108   
               (RIGHT,ZERO)                                             00109   
         DFHMDF LENGTH=1,POS=(15,72),ATTRB=(ASKIP,NORM)                 00110   
S2HPN1H  DFHMDF LENGTH=10,POS=(16,9),ATTRB=(UNPROT,NORM,FSET),JUSTIFY=(X00111   
               RIGHT,ZERO)                                              00112   
         DFHMDF LENGTH=1,POS=(16,20),ATTRB=(ASKIP,NORM)                 00113   
S2HPN2H  DFHMDF LENGTH=10,POS=(16,35),ATTRB=(UNPROT,NORM,FSET),JUSTIFY=X00114   
               (RIGHT,ZERO)                                             00115   
         DFHMDF LENGTH=1,POS=(16,46),ATTRB=(ASKIP,NORM)                 00116   
S2HPN3H  DFHMDF LENGTH=10,POS=(16,61),ATTRB=(UNPROT,NORM,FSET),JUSTIFY=X00117   
               (RIGHT,ZERO)                                             00118   
         DFHMDF LENGTH=1,POS=(16,72),ATTRB=(ASKIP,NORM)                 00119   
S2HPN1I  DFHMDF LENGTH=10,POS=(17,9),ATTRB=(UNPROT,NORM,FSET),JUSTIFY=(X00120   
               RIGHT,ZERO)                                              00121   
         DFHMDF LENGTH=1,POS=(17,20),ATTRB=(ASKIP,NORM)                 00122   
S2HPN2I  DFHMDF LENGTH=10,POS=(17,35),ATTRB=(UNPROT,NORM,FSET),JUSTIFY=X00123   
               (RIGHT,ZERO)                                             00124   
         DFHMDF LENGTH=1,POS=(17,46),ATTRB=(ASKIP,NORM)                 00125   
S2HPN3I  DFHMDF LENGTH=10,POS=(17,61),ATTRB=(UNPROT,NORM,FSET),JUSTIFY=X00126   
               (RIGHT,ZERO)                                             00127   
         DFHMDF LENGTH=1,POS=(17,72),ATTRB=(ASKIP,NORM)                 00128   
S2HPN1J  DFHMDF LENGTH=10,POS=(18,9),ATTRB=(UNPROT,NORM,FSET),JUSTIFY=(X00129   
               RIGHT,ZERO)                                              00130   
         DFHMDF LENGTH=1,POS=(18,20),ATTRB=(ASKIP,NORM)                 00131   
S2HPN2J  DFHMDF LENGTH=10,POS=(18,35),ATTRB=(UNPROT,NORM,FSET),JUSTIFY=X00132   
               (RIGHT,ZERO)                                             00133   
         DFHMDF LENGTH=1,POS=(18,46),ATTRB=(ASKIP,NORM)                 00134   
S2HPN3J  DFHMDF LENGTH=10,POS=(18,61),ATTRB=(UNPROT,NORM,FSET),JUSTIFY=X00135   
               (RIGHT,ZERO)                                             00136   
         DFHMDF LENGTH=1,POS=(18,72),ATTRB=(ASKIP,NORM)                 00137   
S2HPN1K  DFHMDF LENGTH=10,POS=(19,9),ATTRB=(UNPROT,NORM,FSET),JUSTIFY=(X00138   
               RIGHT,ZERO)                                              00139   
         DFHMDF LENGTH=1,POS=(19,20),ATTRB=(ASKIP,NORM)                 00140   
S2HPN2K  DFHMDF LENGTH=10,POS=(19,35),ATTRB=(UNPROT,NORM,FSET),JUSTIFY=X00141   
               (RIGHT,ZERO)                                             00142   
         DFHMDF LENGTH=1,POS=(19,46),ATTRB=(ASKIP,NORM)                 00143   
S2HPN3K  DFHMDF LENGTH=10,POS=(19,61),ATTRB=(UNPROT,NORM,FSET),JUSTIFY=X00144   
               (RIGHT,ZERO)                                             00145   
         DFHMDF LENGTH=1,POS=(19,72),ATTRB=(ASKIP,NORM)                 00146   
S2HPN1L  DFHMDF LENGTH=10,POS=(20,9),ATTRB=(UNPROT,NORM,FSET),JUSTIFY=(X00147   
               RIGHT,ZERO)                                              00148   
         DFHMDF LENGTH=1,POS=(20,20),ATTRB=(ASKIP,NORM)                 00149   
S2HPN2L  DFHMDF LENGTH=10,POS=(20,35),ATTRB=(UNPROT,NORM,FSET),JUSTIFY=X00150   
               (RIGHT,ZERO)                                             00151   
         DFHMDF LENGTH=1,POS=(20,46),ATTRB=(ASKIP,NORM)                 00152   
S2HPN3L  DFHMDF LENGTH=10,POS=(20,61),ATTRB=(UNPROT,NORM,FSET),JUSTIFY=X00153   
               (RIGHT,ZERO)                                             00154   
         DFHMDF LENGTH=1,POS=(20,72),ATTRB=(ASKIP,NORM)                 00155   
S2HPN1M  DFHMDF LENGTH=10,POS=(21,9),ATTRB=(UNPROT,NORM,FSET),JUSTIFY=(X00156   
               RIGHT,ZERO)                                              00157   
         DFHMDF LENGTH=1,POS=(21,20),ATTRB=(ASKIP,NORM)                 00158   
S2HPN2M  DFHMDF LENGTH=10,POS=(21,35),ATTRB=(UNPROT,NORM,FSET),JUSTIFY=X00159   
               (RIGHT,ZERO)                                             00160   
         DFHMDF LENGTH=1,POS=(21,46),ATTRB=(ASKIP,NORM)                 00161   
S2HPN3M  DFHMDF LENGTH=10,POS=(21,61),ATTRB=(UNPROT,NORM,FSET),JUSTIFY=X00162   
               (RIGHT,ZERO)                                             00163   
         DFHMDF LENGTH=1,POS=(21,72),ATTRB=(ASKIP,NORM)                 00164   
S2HPN1N  DFHMDF LENGTH=10,POS=(22,9),ATTRB=(UNPROT,NORM,FSET),JUSTIFY=(X00165   
               RIGHT,ZERO)                                              00166   
         DFHMDF LENGTH=1,POS=(22,20),ATTRB=(ASKIP,NORM)                 00167   
S2HPN2N  DFHMDF LENGTH=10,POS=(22,35),ATTRB=(UNPROT,NORM,FSET),JUSTIFY=X00168   
               (RIGHT,ZERO)                                             00169   
         DFHMDF LENGTH=1,POS=(22,46),ATTRB=(ASKIP,NORM)                 00170   
S2HPN3N  DFHMDF LENGTH=10,POS=(22,61),ATTRB=(UNPROT,NORM,FSET),JUSTIFY=X00171   
               (RIGHT,ZERO)                                             00172   
         DFHMDF LENGTH=1,POS=(22,72),ATTRB=(PROT,NORM)                  00173   
ERRMSG   DFHMDF LENGTH=79,POS=(24,1),ATTRB=(PROT,BRT)                   00174   
         DFHMSD TYPE=FINAL                                              00175   
         END                                                            00176   
/*                                                                      00177   
