GA2NSET  DFHMSD TYPE=MAP,MODE=INOUT,LANG=COBOL,CTRL=FREEKB,DATA=FIELD,TX00001   
               IOAPFX=YES                                               00002   
GA2NI01  DFHMDI SIZE=(24,80)                                            00003   
FUNCTON  DFHMDF LENGTH=0004,POS=(1,1),ATTRB=(PROT,NORM,FSET),INITIAL='GX00004   
               A2N'                                                     00005   
TTLELNE  DFHMDF LENGTH=46,POS=(1,10),ATTRB=(ASKIP,NORM,FSET)            00006   
ADDLIT   DFHMDF LENGTH=0003,POS=(1,61),ATTRB=(ASKIP,NORM),INITIAL='ADD' 00007   
         DFHMDF LENGTH=0008,POS=(1,65),ATTRB=(ASKIP,NORM),INITIAL='SCREX00008   
               EN #'                                                    00009   
SCRNIDN  DFHMDF LENGTH=0006,POS=(1,74),ATTRB=(ASKIP,NORM,FSET),INITIAL=X00010   
               '002N00'                                                 00011   
         DFHMDF LENGTH=0033,POS=(2,15),ATTRB=(ASKIP,NORM),INITIAL='DIAGX00012   
               NOSIS GROUP BY DIAGNOSIS CODE'                           00013   
IDLINE   DFHMDF LENGTH=79,POS=(3,1),ATTRB=(ASKIP,NORM,FSET)             00014   
         DFHMDF LENGTH=0015,POS=(4,1),ATTRB=(ASKIP,NORM),INITIAL='ALL LX00015   
               VL TAB ID='                                              00016   
ALTABID  DFHMDF LENGTH=6,POS=(4,17),ATTRB=(ASKIP,NORM,FSET)             00017   
         DFHMDF LENGTH=0006,POS=(4,25),ATTRB=(ASKIP,NORM),INITIAL='SLT X00018   
               #='                                                      00019   
ALTBSLT  DFHMDF LENGTH=7,POS=(4,32),ATTRB=(ASKIP,NORM,FSET)             00020   
         DFHMDF LENGTH=0016,POS=(4,41),ATTRB=(ASKIP,NORM),INITIAL='INTEX00021   
               RNAL TAB ID='                                            00022   
INTABID  DFHMDF LENGTH=6,POS=(4,58),ATTRB=(ASKIP,NORM,FSET)             00023   
         DFHMDF LENGTH=0006,POS=(4,66),ATTRB=(ASKIP,NORM),INITIAL='SLT X00024   
               #='                                                      00025   
INTBSLT  DFHMDF LENGTH=7,POS=(4,73),ATTRB=(ASKIP,NORM,FSET)             00026   
         DFHMDF LENGTH=0028,POS=(5,1),ATTRB=(ASKIP,NORM),INITIAL='INCLUX00027   
               DE/EXCLUDE BY DIAGNOSIS'                                 00028   
INCEXC   DFHMDF LENGTH=1,POS=(5,31),ATTRB=(UNPROT,NORM,IC,FSET)         00029   
         DFHMDF LENGTH=1,POS=(5,33),ATTRB=(ASKIP,NORM)                  00030   
INEXDRK  DFHMDF LENGTH=1,POS=(5,35),ATTRB=(ASKIP,DRK,FSET)              00031   
ADDELIN  DFHMDF LENGTH=1,POS=(5,41),ATTRB=(ASKIP,DRK,FSET)              00032   
ALTBFNC  DFHMDF LENGTH=4,POS=(5,49),ATTRB=(ASKIP,DRK,FSET)              00033   
OENTCTR  DFHMDF LENGTH=7,POS=(5,61),ATTRB=(ASKIP,DRK,FSET)              00034   
FRMNUID  DFHMDF LENGTH=4,POS=(5,75),ATTRB=(ASKIP,DRK,FSET)              00035   
         DFHMDF LENGTH=0009,POS=(7,11),ATTRB=(ASKIP,NORM),INITIAL='DIAGX00036   
               NOSIS'                                                   00037   
         DFHMDF LENGTH=0009,POS=(7,37),ATTRB=(ASKIP,NORM),INITIAL='DIAGX00038   
               NOSIS'                                                   00039   
         DFHMDF LENGTH=0009,POS=(7,63),ATTRB=(ASKIP,NORM),INITIAL='DIAGX00040   
               NOSIS'                                                   00041   
         DFHMDF LENGTH=0004,POS=(8,13),ATTRB=(ASKIP,NORM),INITIAL='CODEX00042   
               '                                                        00043   
         DFHMDF LENGTH=0004,POS=(8,39),ATTRB=(ASKIP,NORM),INITIAL='CODEX00044   
               '                                                        00045   
         DFHMDF LENGTH=0004,POS=(8,65),ATTRB=(ASKIP,NORM),INITIAL='CODEX00046   
               '                                                        00047   
S2GPA1A  DFHMDF LENGTH=10,POS=(9,10),ATTRB=(UNPROT,NORM,FSET),JUSTIFY=(X00048   
               LEFT,BLANK)                                              00049   
         DFHMDF LENGTH=1,POS=(9,21),ATTRB=(ASKIP,NORM)                  00050   
S2GPA2A  DFHMDF LENGTH=10,POS=(9,36),ATTRB=(UNPROT,NORM,FSET),JUSTIFY=(X00051   
               LEFT,BLANK)                                              00052   
         DFHMDF LENGTH=1,POS=(9,47),ATTRB=(ASKIP,NORM)                  00053   
S2GPA3A  DFHMDF LENGTH=10,POS=(9,62),ATTRB=(UNPROT,NORM,FSET),JUSTIFY=(X00054   
               LEFT,BLANK)                                              00055   
         DFHMDF LENGTH=1,POS=(9,73),ATTRB=(ASKIP,NORM)                  00056   
S2GPA1B  DFHMDF LENGTH=10,POS=(10,10),ATTRB=(UNPROT,NORM,FSET),JUSTIFY=X00057   
               (LEFT,BLANK)                                             00058   
         DFHMDF LENGTH=1,POS=(10,21),ATTRB=(ASKIP,NORM)                 00059   
S2GPA2B  DFHMDF LENGTH=10,POS=(10,36),ATTRB=(UNPROT,NORM,FSET),JUSTIFY=X00060   
               (LEFT,BLANK)                                             00061   
         DFHMDF LENGTH=1,POS=(10,47),ATTRB=(ASKIP,NORM)                 00062   
S2GPA3B  DFHMDF LENGTH=10,POS=(10,62),ATTRB=(UNPROT,NORM,FSET),JUSTIFY=X00063   
               (LEFT,BLANK)                                             00064   
         DFHMDF LENGTH=1,POS=(10,73),ATTRB=(ASKIP,NORM)                 00065   
S2GPA1C  DFHMDF LENGTH=10,POS=(11,10),ATTRB=(UNPROT,NORM,FSET),JUSTIFY=X00066   
               (LEFT,BLANK)                                             00067   
         DFHMDF LENGTH=1,POS=(11,21),ATTRB=(ASKIP,NORM)                 00068   
S2GPA2C  DFHMDF LENGTH=10,POS=(11,36),ATTRB=(UNPROT,NORM,FSET),JUSTIFY=X00069   
               (LEFT,BLANK)                                             00070   
         DFHMDF LENGTH=1,POS=(11,47),ATTRB=(ASKIP,NORM)                 00071   
S2GPA3C  DFHMDF LENGTH=10,POS=(11,62),ATTRB=(UNPROT,NORM,FSET),JUSTIFY=X00072   
               (LEFT,BLANK)                                             00073   
         DFHMDF LENGTH=1,POS=(11,73),ATTRB=(ASKIP,NORM)                 00074   
S2GPA1D  DFHMDF LENGTH=10,POS=(12,10),ATTRB=(UNPROT,NORM,FSET),JUSTIFY=X00075   
               (LEFT,BLANK)                                             00076   
         DFHMDF LENGTH=1,POS=(12,21),ATTRB=(ASKIP,NORM)                 00077   
S2GPA2D  DFHMDF LENGTH=10,POS=(12,36),ATTRB=(UNPROT,NORM,FSET),JUSTIFY=X00078   
               (LEFT,BLANK)                                             00079   
         DFHMDF LENGTH=1,POS=(12,47),ATTRB=(ASKIP,NORM)                 00080   
S2GPA3D  DFHMDF LENGTH=10,POS=(12,62),ATTRB=(UNPROT,NORM,FSET),JUSTIFY=X00081   
               (LEFT,BLANK)                                             00082   
         DFHMDF LENGTH=1,POS=(12,73),ATTRB=(ASKIP,NORM)                 00083   
S2GPA1E  DFHMDF LENGTH=10,POS=(13,10),ATTRB=(UNPROT,NORM,FSET),JUSTIFY=X00084   
               (LEFT,BLANK)                                             00085   
         DFHMDF LENGTH=1,POS=(13,21),ATTRB=(ASKIP,NORM)                 00086   
S2GPA2E  DFHMDF LENGTH=10,POS=(13,36),ATTRB=(UNPROT,NORM,FSET),JUSTIFY=X00087   
               (LEFT,BLANK)                                             00088   
         DFHMDF LENGTH=1,POS=(13,47),ATTRB=(ASKIP,NORM)                 00089   
S2GPA3E  DFHMDF LENGTH=10,POS=(13,62),ATTRB=(UNPROT,NORM,FSET),JUSTIFY=X00090   
               (LEFT,BLANK)                                             00091   
         DFHMDF LENGTH=1,POS=(13,73),ATTRB=(ASKIP,NORM)                 00092   
S2GPA1F  DFHMDF LENGTH=10,POS=(14,10),ATTRB=(UNPROT,NORM,FSET),JUSTIFY=X00093   
               (LEFT,BLANK)                                             00094   
         DFHMDF LENGTH=1,POS=(14,21),ATTRB=(ASKIP,NORM)                 00095   
S2GPA2F  DFHMDF LENGTH=10,POS=(14,36),ATTRB=(UNPROT,NORM,FSET),JUSTIFY=X00096   
               (LEFT,BLANK)                                             00097   
         DFHMDF LENGTH=1,POS=(14,47),ATTRB=(ASKIP,NORM)                 00098   
S2GPA3F  DFHMDF LENGTH=10,POS=(14,62),ATTRB=(UNPROT,NORM,FSET),JUSTIFY=X00099   
               (LEFT,BLANK)                                             00100   
         DFHMDF LENGTH=1,POS=(14,73),ATTRB=(ASKIP,NORM)                 00101   
S2GPA1G  DFHMDF LENGTH=10,POS=(15,10),ATTRB=(UNPROT,NORM,FSET),JUSTIFY=X00102   
               (LEFT,BLANK)                                             00103   
         DFHMDF LENGTH=1,POS=(15,21),ATTRB=(ASKIP,NORM)                 00104   
S2GPA2G  DFHMDF LENGTH=10,POS=(15,36),ATTRB=(UNPROT,NORM,FSET),JUSTIFY=X00105   
               (LEFT,BLANK)                                             00106   
         DFHMDF LENGTH=1,POS=(15,47),ATTRB=(ASKIP,NORM)                 00107   
S2GPA3G  DFHMDF LENGTH=10,POS=(15,62),ATTRB=(UNPROT,NORM,FSET),JUSTIFY=X00108   
               (LEFT,BLANK)                                             00109   
         DFHMDF LENGTH=1,POS=(15,73),ATTRB=(ASKIP,NORM)                 00110   
S2GPA1H  DFHMDF LENGTH=10,POS=(16,10),ATTRB=(UNPROT,NORM,FSET),JUSTIFY=X00111   
               (LEFT,BLANK)                                             00112   
         DFHMDF LENGTH=1,POS=(16,21),ATTRB=(ASKIP,NORM)                 00113   
S2GPA2H  DFHMDF LENGTH=10,POS=(16,36),ATTRB=(UNPROT,NORM,FSET),JUSTIFY=X00114   
               (LEFT,BLANK)                                             00115   
         DFHMDF LENGTH=1,POS=(16,47),ATTRB=(ASKIP,NORM)                 00116   
S2GPA3H  DFHMDF LENGTH=10,POS=(16,62),ATTRB=(UNPROT,NORM,FSET),JUSTIFY=X00117   
               (LEFT,BLANK)                                             00118   
         DFHMDF LENGTH=1,POS=(16,73),ATTRB=(ASKIP,NORM)                 00119   
S2GPA1I  DFHMDF LENGTH=10,POS=(17,10),ATTRB=(UNPROT,NORM,FSET),JUSTIFY=X00120   
               (LEFT,BLANK)                                             00121   
         DFHMDF LENGTH=1,POS=(17,21),ATTRB=(ASKIP,NORM)                 00122   
S2GPA2I  DFHMDF LENGTH=10,POS=(17,36),ATTRB=(UNPROT,NORM,FSET),JUSTIFY=X00123   
               (LEFT,BLANK)                                             00124   
         DFHMDF LENGTH=1,POS=(17,47),ATTRB=(ASKIP,NORM)                 00125   
S2GPA3I  DFHMDF LENGTH=10,POS=(17,62),ATTRB=(UNPROT,NORM,FSET),JUSTIFY=X00126   
               (LEFT,BLANK)                                             00127   
         DFHMDF LENGTH=1,POS=(17,73),ATTRB=(ASKIP,NORM)                 00128   
S2GPA1J  DFHMDF LENGTH=10,POS=(18,10),ATTRB=(UNPROT,NORM,FSET),JUSTIFY=X00129   
               (LEFT,BLANK)                                             00130   
         DFHMDF LENGTH=1,POS=(18,21),ATTRB=(ASKIP,NORM)                 00131   
S2GPA2J  DFHMDF LENGTH=10,POS=(18,36),ATTRB=(UNPROT,NORM,FSET),JUSTIFY=X00132   
               (LEFT,BLANK)                                             00133   
         DFHMDF LENGTH=1,POS=(18,47),ATTRB=(ASKIP,NORM)                 00134   
S2GPA3J  DFHMDF LENGTH=10,POS=(18,62),ATTRB=(UNPROT,NORM,FSET),JUSTIFY=X00135   
               (LEFT,BLANK)                                             00136   
         DFHMDF LENGTH=1,POS=(18,73),ATTRB=(ASKIP,NORM)                 00137   
S2GPA1K  DFHMDF LENGTH=10,POS=(19,10),ATTRB=(UNPROT,NORM,FSET),JUSTIFY=X00138   
               (LEFT,BLANK)                                             00139   
         DFHMDF LENGTH=1,POS=(19,21),ATTRB=(ASKIP,NORM)                 00140   
S2GPA2K  DFHMDF LENGTH=10,POS=(19,36),ATTRB=(UNPROT,NORM,FSET),JUSTIFY=X00141   
               (LEFT,BLANK)                                             00142   
         DFHMDF LENGTH=1,POS=(19,47),ATTRB=(ASKIP,NORM)                 00143   
S2GPA3K  DFHMDF LENGTH=10,POS=(19,62),ATTRB=(UNPROT,NORM,FSET),JUSTIFY=X00144   
               (LEFT,BLANK)                                             00145   
         DFHMDF LENGTH=1,POS=(19,73),ATTRB=(ASKIP,NORM)                 00146   
S2GPA1L  DFHMDF LENGTH=10,POS=(20,10),ATTRB=(UNPROT,NORM,FSET),JUSTIFY=X00147   
               (LEFT,BLANK)                                             00148   
         DFHMDF LENGTH=1,POS=(20,21),ATTRB=(ASKIP,NORM)                 00149   
S2GPA2L  DFHMDF LENGTH=10,POS=(20,36),ATTRB=(UNPROT,NORM,FSET),JUSTIFY=X00150   
               (LEFT,BLANK)                                             00151   
         DFHMDF LENGTH=1,POS=(20,47),ATTRB=(ASKIP,NORM)                 00152   
S2GPA3L  DFHMDF LENGTH=10,POS=(20,62),ATTRB=(UNPROT,NORM,FSET),JUSTIFY=X00153   
               (LEFT,BLANK)                                             00154   
         DFHMDF LENGTH=1,POS=(20,73),ATTRB=(ASKIP,NORM)                 00155   
S2GPA1M  DFHMDF LENGTH=10,POS=(21,10),ATTRB=(UNPROT,NORM,FSET),JUSTIFY=X00156   
               (LEFT,BLANK)                                             00157   
         DFHMDF LENGTH=1,POS=(21,21),ATTRB=(ASKIP,NORM)                 00158   
S2GPA2M  DFHMDF LENGTH=10,POS=(21,36),ATTRB=(UNPROT,NORM,FSET),JUSTIFY=X00159   
               (LEFT,BLANK)                                             00160   
         DFHMDF LENGTH=1,POS=(21,47),ATTRB=(ASKIP,NORM)                 00161   
S2GPA3M  DFHMDF LENGTH=10,POS=(21,62),ATTRB=(UNPROT,NORM,FSET),JUSTIFY=X00162   
               (LEFT,BLANK)                                             00163   
         DFHMDF LENGTH=1,POS=(21,73),ATTRB=(ASKIP,NORM)                 00164   
S2GPA1N  DFHMDF LENGTH=10,POS=(22,10),ATTRB=(UNPROT,NORM,FSET),JUSTIFY=X00165   
               (LEFT,BLANK)                                             00166   
         DFHMDF LENGTH=1,POS=(22,21),ATTRB=(ASKIP,NORM)                 00167   
S2GPA2N  DFHMDF LENGTH=10,POS=(22,36),ATTRB=(UNPROT,NORM,FSET),JUSTIFY=X00168   
               (LEFT,BLANK)                                             00169   
         DFHMDF LENGTH=1,POS=(22,47),ATTRB=(ASKIP,NORM)                 00170   
S2GPA3N  DFHMDF LENGTH=10,POS=(22,62),ATTRB=(UNPROT,NORM,FSET),JUSTIFY=X00171   
               (LEFT,BLANK)                                             00172   
         DFHMDF LENGTH=1,POS=(22,73),ATTRB=(PROT,NORM)                  00173   
ERRMSG   DFHMDF LENGTH=79,POS=(24,1),ATTRB=(PROT,BRT)                   00174   
         DFHMSD TYPE=FINAL                                              00175   
         END                                                            00176   
/*                                                                      00177   
