GBIESET  DFHMSD TYPE=MAP,MODE=INOUT,LANG=COBOL,CTRL=FREEKB,DATA=FIELD,TX00001   
               IOAPFX=YES                                               00002   
GBIEI01  DFHMDI SIZE=(24,80)                                            00003   
IEFUNC   DFHMDF LENGTH=0004,POS=(1,1),ATTRB=(PROT,NORM,FSET),INITIAL='GX00004   
               BIE'                                                     00005   
         DFHMDF LENGTH=0012,POS=(1,61),ATTRB=(ASKIP,NORM),INITIAL='INQ X00006   
               SCREEN #'                                                00007   
IESCRID  DFHMDF LENGTH=0006,POS=(1,74),ATTRB=(ASKIP,NORM,FSET),INITIAL=X00008   
               '00IE0I'                                                 00009   
         DFHMDF LENGTH=0033,POS=(2,8),ATTRB=(ASKIP,BRT),INITIAL='BENEFIX00010   
               T HIGHLIGHTS - SELECT GROUP'                             00011   
         DFHMDF LENGTH=0015,POS=(2,42),ATTRB=(ASKIP,BRT),INITIAL='SPECIX00012   
               FIC RECORD'                                              00013   
         DFHMDF LENGTH=0021,POS=(3,1),ATTRB=(ASKIP,DRK),INITIAL='GBIEPGX00014   
               M WORK FIELDS->'                                         00015   
IELNCNT  DFHMDF LENGTH=0002,POS=(3,23),ATTRB=(PROT,DRK,FSET),INITIAL='0X00016   
               0'                                                       00017   
IEGROUP  DFHMDF LENGTH=0009,POS=(3,40),ATTRB=(PROT,DRK,FSET),INITIAL='0X00018   
               00000000'                                                00019   
IESEC    DFHMDF LENGTH=0005,POS=(3,50),ATTRB=(PROT,DRK,FSET),INITIAL='0X00020   
               0000'                                                    00021   
IEPNAME  DFHMDF LENGTH=5,POS=(3,66),ATTRB=(ASKIP,NORM)                  00022   
IEPAGE   DFHMDF LENGTH=3,POS=(3,76),ATTRB=(ASKIP,BRT,FSET)              00023   
IECNKEY  DFHMDF LENGTH=25,POS=(4,1),ATTRB=(PROT,DRK,FSET)               00024   
IECNKED  DFHMDF LENGTH=6,POS=(4,30),ATTRB=(PROT,DRK,NUM,FSET)           00025   
IESUB    DFHMDF LENGTH=9,POS=(4,40),ATTRB=(PROT,DRK,FSET)               00026   
IESVDT   DFHMDF LENGTH=0007,POS=(4,50),ATTRB=(PROT,DRK,FSET),INITIAL='0X00027   
               000000'                                                  00028   
IERETC   DFHMDF LENGTH=2,POS=(4,60),ATTRB=(PROT,DRK,FSET)               00029   
         DFHMDF LENGTH=0012,POS=(5,1),ATTRB=(ASKIP,BRT),INITIAL='GRPSPEX00030   
               C ID=>'                                                  00031   
         DFHMDF LENGTH=0005,POS=(5,14),ATTRB=(ASKIP,BRT),INITIAL='PLAN:X00032   
               '                                                        00033   
IEPLNX   DFHMDF LENGTH=3,POS=(5,20),ATTRB=(PROT,NORM,FSET),JUSTIFY=(RIGX00034   
               HT,ZERO)                                                 00035   
         DFHMDF LENGTH=0004,POS=(5,24),ATTRB=(ASKIP,BRT),INITIAL='GRP:' 00036   
IEGRPX   DFHMDF LENGTH=9,POS=(5,29),ATTRB=(PROT,NORM,FSET),JUSTIFY=(RIGX00037   
               HT,ZERO)                                                 00038   
         DFHMDF LENGTH=0004,POS=(5,39),ATTRB=(ASKIP,BRT),INITIAL='SEC:' 00039   
IESECX   DFHMDF LENGTH=5,POS=(5,44),ATTRB=(PROT,NORM,FSET),JUSTIFY=(RIGX00040   
               HT,ZERO)                                                 00041   
         DFHMDF LENGTH=0004,POS=(5,50),ATTRB=(ASKIP,BRT),INITIAL='PKG:' 00042   
IEPKGX   DFHMDF LENGTH=3,POS=(5,55),ATTRB=(PROT,NORM,FSET),JUSTIFY=(RIGX00043   
               HT,ZERO)                                                 00044   
         DFHMDF LENGTH=0003,POS=(5,59),ATTRB=(ASKIP,NORM),INITIAL='FR:' 00045   
IEFRX    DFHMDF LENGTH=2,POS=(5,63),ATTRB=(PROT,NORM,FSET)              00046   
         DFHMDF LENGTH=0005,POS=(5,66),ATTRB=(ASKIP,NORM),INITIAL='EFDTX00047   
               :'                                                       00048   
IEEDTX   DFHMDF LENGTH=6,POS=(5,72),ATTRB=(PROT,NORM,FSET),JUSTIFY=(RIGX00049   
               HT,ZERO)                                                 00050   
         DFHMDF LENGTH=1,POS=(5,79),ATTRB=(ASKIP,NORM)                  00051   
         DFHMDF LENGTH=0026,POS=(7,1),ATTRB=(ASKIP,BRT),INITIAL='SELECTX00052   
                GROUP SPEC LINE NO:'                                    00053   
IELNNO   DFHMDF LENGTH=2,POS=(7,28),ATTRB=(UNPROT,NORM,FSET),JUSTIFY=(RX00054   
               IGHT,ZERO)                                               00055   
         DFHMDF LENGTH=1,POS=(7,31),ATTRB=(ASKIP,NORM)                  00056   
         DFHMDF LENGTH=0002,POS=(9,2),ATTRB=(ASKIP,BRT),INITIAL='LN'    00057   
         DFHMDF LENGTH=0002,POS=(9,6),ATTRB=(ASKIP,NORM),INITIAL='FR'   00058   
         DFHMDF LENGTH=0005,POS=(9,10),ATTRB=(ASKIP,NORM),INITIAL='EFFDX00059   
               T'                                                       00060   
         DFHMDF LENGTH=0008,POS=(9,16),ATTRB=(ASKIP,NORM),INITIAL='TERMX00061   
                 DT'                                                    00062   
         DFHMDF LENGTH=0002,POS=(9,29),ATTRB=(ASKIP,BRT),INITIAL='LN'   00063   
         DFHMDF LENGTH=0002,POS=(9,33),ATTRB=(ASKIP,NORM),INITIAL='FR'  00064   
         DFHMDF LENGTH=0005,POS=(9,37),ATTRB=(ASKIP,NORM),INITIAL='EFFDX00065   
               T'                                                       00066   
         DFHMDF LENGTH=0008,POS=(9,43),ATTRB=(ASKIP,NORM),INITIAL='TERMX00067   
                 DT'                                                    00068   
         DFHMDF LENGTH=0002,POS=(9,56),ATTRB=(ASKIP,BRT),INITIAL='LN'   00069   
         DFHMDF LENGTH=0002,POS=(9,60),ATTRB=(ASKIP,NORM),INITIAL='FR'  00070   
         DFHMDF LENGTH=0005,POS=(9,64),ATTRB=(ASKIP,NORM),INITIAL='EFFDX00071   
               T'                                                       00072   
         DFHMDF LENGTH=0008,POS=(9,70),ATTRB=(ASKIP,NORM),INITIAL='TERMX00073   
                 DT'                                                    00074   
IELN01   DFHMDF LENGTH=2,POS=(10,2),ATTRB=(ASKIP,BRT,FSET)              00075   
IEFR01   DFHMDF LENGTH=2,POS=(10,6),ATTRB=(ASKIP,NORM,FSET)             00076   
IEEDT01  DFHMDF LENGTH=6,POS=(10,9),ATTRB=(ASKIP,NORM,FSET)             00077   
IETDT01  DFHMDF LENGTH=8,POS=(10,16),ATTRB=(ASKIP,NORM,FSET)            00078   
IELN02   DFHMDF LENGTH=2,POS=(10,29),ATTRB=(ASKIP,BRT,FSET)             00079   
IEFR02   DFHMDF LENGTH=2,POS=(10,33),ATTRB=(ASKIP,NORM,FSET)            00080   
IEEDT02  DFHMDF LENGTH=6,POS=(10,36),ATTRB=(ASKIP,NORM,FSET)            00081   
IETDT02  DFHMDF LENGTH=8,POS=(10,43),ATTRB=(ASKIP,NORM,FSET)            00082   
IELN03   DFHMDF LENGTH=2,POS=(10,56),ATTRB=(ASKIP,BRT,FSET)             00083   
IEFR03   DFHMDF LENGTH=2,POS=(10,60),ATTRB=(ASKIP,NORM,FSET)            00084   
IEEDT03  DFHMDF LENGTH=6,POS=(10,63),ATTRB=(ASKIP,NORM,FSET)            00085   
IETDT03  DFHMDF LENGTH=8,POS=(10,70),ATTRB=(ASKIP,NORM,FSET)            00086   
IELN04   DFHMDF LENGTH=2,POS=(11,2),ATTRB=(ASKIP,BRT,FSET)              00087   
IEFR04   DFHMDF LENGTH=2,POS=(11,6),ATTRB=(ASKIP,NORM,FSET)             00088   
IEEDT04  DFHMDF LENGTH=6,POS=(11,9),ATTRB=(ASKIP,NORM,FSET)             00089   
IETDT04  DFHMDF LENGTH=8,POS=(11,16),ATTRB=(ASKIP,NORM,FSET)            00090   
IELN05   DFHMDF LENGTH=2,POS=(11,29),ATTRB=(ASKIP,BRT,FSET)             00091   
IEFR05   DFHMDF LENGTH=2,POS=(11,33),ATTRB=(ASKIP,NORM,FSET)            00092   
IEEDT05  DFHMDF LENGTH=6,POS=(11,36),ATTRB=(ASKIP,NORM,FSET)            00093   
IETDT05  DFHMDF LENGTH=8,POS=(11,43),ATTRB=(ASKIP,NORM,FSET)            00094   
IELN06   DFHMDF LENGTH=2,POS=(11,56),ATTRB=(ASKIP,BRT,FSET)             00095   
IEFR06   DFHMDF LENGTH=2,POS=(11,60),ATTRB=(ASKIP,NORM,FSET)            00096   
IEEDT06  DFHMDF LENGTH=6,POS=(11,63),ATTRB=(ASKIP,NORM,FSET)            00097   
IETDT06  DFHMDF LENGTH=8,POS=(11,70),ATTRB=(ASKIP,NORM,FSET)            00098   
IELN07   DFHMDF LENGTH=2,POS=(12,2),ATTRB=(ASKIP,BRT,FSET)              00099   
IEFR07   DFHMDF LENGTH=2,POS=(12,6),ATTRB=(ASKIP,NORM,FSET)             00100   
IEEDT07  DFHMDF LENGTH=6,POS=(12,9),ATTRB=(ASKIP,NORM,FSET)             00101   
IETDT07  DFHMDF LENGTH=8,POS=(12,16),ATTRB=(ASKIP,NORM,FSET)            00102   
IELN08   DFHMDF LENGTH=2,POS=(12,29),ATTRB=(ASKIP,BRT,FSET)             00103   
IEFR08   DFHMDF LENGTH=2,POS=(12,33),ATTRB=(ASKIP,NORM,FSET)            00104   
IEEDT08  DFHMDF LENGTH=6,POS=(12,36),ATTRB=(ASKIP,NORM,FSET)            00105   
IETDT08  DFHMDF LENGTH=8,POS=(12,43),ATTRB=(ASKIP,NORM,FSET)            00106   
IELN09   DFHMDF LENGTH=2,POS=(12,56),ATTRB=(ASKIP,BRT,FSET)             00107   
IEFR09   DFHMDF LENGTH=2,POS=(12,60),ATTRB=(ASKIP,NORM,FSET)            00108   
IEEDT09  DFHMDF LENGTH=6,POS=(12,63),ATTRB=(ASKIP,NORM,FSET)            00109   
IETDT09  DFHMDF LENGTH=8,POS=(12,70),ATTRB=(ASKIP,NORM,FSET)            00110   
IELN10   DFHMDF LENGTH=2,POS=(13,2),ATTRB=(ASKIP,BRT,FSET)              00111   
IEFR10   DFHMDF LENGTH=2,POS=(13,6),ATTRB=(ASKIP,NORM,FSET)             00112   
IEEDT10  DFHMDF LENGTH=6,POS=(13,9),ATTRB=(ASKIP,NORM,FSET)             00113   
IETDT10  DFHMDF LENGTH=8,POS=(13,16),ATTRB=(ASKIP,NORM,FSET)            00114   
IELN11   DFHMDF LENGTH=2,POS=(13,29),ATTRB=(ASKIP,BRT,FSET)             00115   
IEFR11   DFHMDF LENGTH=2,POS=(13,33),ATTRB=(ASKIP,NORM,FSET)            00116   
IEEDT11  DFHMDF LENGTH=6,POS=(13,36),ATTRB=(ASKIP,NORM,FSET)            00117   
IETDT11  DFHMDF LENGTH=8,POS=(13,43),ATTRB=(ASKIP,NORM,FSET)            00118   
IELN12   DFHMDF LENGTH=2,POS=(13,56),ATTRB=(ASKIP,BRT,FSET)             00119   
IEFR12   DFHMDF LENGTH=2,POS=(13,60),ATTRB=(ASKIP,NORM,FSET)            00120   
IEEDT12  DFHMDF LENGTH=6,POS=(13,63),ATTRB=(ASKIP,NORM,FSET)            00121   
IETDT12  DFHMDF LENGTH=8,POS=(13,70),ATTRB=(ASKIP,NORM,FSET)            00122   
IELN13   DFHMDF LENGTH=2,POS=(14,2),ATTRB=(ASKIP,BRT,FSET)              00123   
IEFR13   DFHMDF LENGTH=2,POS=(14,6),ATTRB=(ASKIP,NORM,FSET)             00124   
IEEDT13  DFHMDF LENGTH=6,POS=(14,9),ATTRB=(ASKIP,NORM,FSET)             00125   
IETDT13  DFHMDF LENGTH=8,POS=(14,16),ATTRB=(ASKIP,NORM,FSET)            00126   
IELN14   DFHMDF LENGTH=2,POS=(14,29),ATTRB=(ASKIP,BRT,FSET)             00127   
IEFR14   DFHMDF LENGTH=2,POS=(14,33),ATTRB=(ASKIP,NORM,FSET)            00128   
IEEDT14  DFHMDF LENGTH=6,POS=(14,36),ATTRB=(ASKIP,NORM,FSET)            00129   
IETDT14  DFHMDF LENGTH=8,POS=(14,43),ATTRB=(ASKIP,NORM,FSET)            00130   
IELN15   DFHMDF LENGTH=2,POS=(14,56),ATTRB=(ASKIP,BRT,FSET)             00131   
IEFR15   DFHMDF LENGTH=2,POS=(14,60),ATTRB=(ASKIP,NORM,FSET)            00132   
IEEDT15  DFHMDF LENGTH=6,POS=(14,63),ATTRB=(ASKIP,NORM,FSET)            00133   
IETDT15  DFHMDF LENGTH=8,POS=(14,70),ATTRB=(ASKIP,NORM,FSET)            00134   
IELN16   DFHMDF LENGTH=2,POS=(15,2),ATTRB=(ASKIP,BRT,FSET)              00135   
IEFR16   DFHMDF LENGTH=2,POS=(15,6),ATTRB=(ASKIP,NORM,FSET)             00136   
IEEDT16  DFHMDF LENGTH=6,POS=(15,9),ATTRB=(ASKIP,NORM,FSET)             00137   
IETDT16  DFHMDF LENGTH=8,POS=(15,16),ATTRB=(ASKIP,NORM,FSET)            00138   
IELN17   DFHMDF LENGTH=2,POS=(15,29),ATTRB=(ASKIP,BRT,FSET)             00139   
IEFR17   DFHMDF LENGTH=2,POS=(15,33),ATTRB=(ASKIP,NORM,FSET)            00140   
IEEDT17  DFHMDF LENGTH=6,POS=(15,36),ATTRB=(ASKIP,NORM,FSET)            00141   
IETDT17  DFHMDF LENGTH=8,POS=(15,43),ATTRB=(ASKIP,NORM,FSET)            00142   
IELN18   DFHMDF LENGTH=2,POS=(15,56),ATTRB=(ASKIP,BRT,FSET)             00143   
IEFR18   DFHMDF LENGTH=2,POS=(15,60),ATTRB=(ASKIP,NORM,FSET)            00144   
IEEDT18  DFHMDF LENGTH=6,POS=(15,63),ATTRB=(ASKIP,NORM,FSET)            00145   
IETDT18  DFHMDF LENGTH=8,POS=(15,70),ATTRB=(ASKIP,NORM,FSET)            00146   
IELN19   DFHMDF LENGTH=2,POS=(16,2),ATTRB=(ASKIP,BRT,FSET)              00147   
IEFR19   DFHMDF LENGTH=2,POS=(16,6),ATTRB=(ASKIP,NORM,FSET)             00148   
IEEDT19  DFHMDF LENGTH=6,POS=(16,9),ATTRB=(ASKIP,NORM,FSET)             00149   
IETDT19  DFHMDF LENGTH=8,POS=(16,16),ATTRB=(ASKIP,NORM,FSET)            00150   
IELN20   DFHMDF LENGTH=2,POS=(16,29),ATTRB=(ASKIP,BRT,FSET)             00151   
IEFR20   DFHMDF LENGTH=2,POS=(16,33),ATTRB=(ASKIP,NORM,FSET)            00152   
IEEDT20  DFHMDF LENGTH=6,POS=(16,36),ATTRB=(ASKIP,NORM,FSET)            00153   
IETDT20  DFHMDF LENGTH=8,POS=(16,43),ATTRB=(ASKIP,NORM,FSET)            00154   
IELN21   DFHMDF LENGTH=2,POS=(16,56),ATTRB=(ASKIP,BRT,FSET)             00155   
IEFR21   DFHMDF LENGTH=2,POS=(16,60),ATTRB=(ASKIP,NORM,FSET)            00156   
IEEDT21  DFHMDF LENGTH=6,POS=(16,63),ATTRB=(ASKIP,NORM,FSET)            00157   
IETDT21  DFHMDF LENGTH=8,POS=(16,70),ATTRB=(ASKIP,NORM,FSET)            00158   
IELN22   DFHMDF LENGTH=2,POS=(17,2),ATTRB=(ASKIP,BRT,FSET)              00159   
IEFR22   DFHMDF LENGTH=2,POS=(17,6),ATTRB=(ASKIP,NORM,FSET)             00160   
IEEDT22  DFHMDF LENGTH=6,POS=(17,9),ATTRB=(ASKIP,NORM,FSET)             00161   
IETDT22  DFHMDF LENGTH=8,POS=(17,16),ATTRB=(ASKIP,NORM,FSET)            00162   
IELN23   DFHMDF LENGTH=2,POS=(17,29),ATTRB=(ASKIP,BRT,FSET)             00163   
IEFR23   DFHMDF LENGTH=2,POS=(17,33),ATTRB=(ASKIP,NORM,FSET)            00164   
IEEDT23  DFHMDF LENGTH=6,POS=(17,36),ATTRB=(ASKIP,NORM,FSET)            00165   
IETDT23  DFHMDF LENGTH=8,POS=(17,43),ATTRB=(ASKIP,NORM,FSET)            00166   
IELN24   DFHMDF LENGTH=2,POS=(17,56),ATTRB=(ASKIP,BRT,FSET)             00167   
IEFR24   DFHMDF LENGTH=2,POS=(17,60),ATTRB=(ASKIP,NORM,FSET)            00168   
IEEDT24  DFHMDF LENGTH=6,POS=(17,63),ATTRB=(ASKIP,NORM,FSET)            00169   
IETDT24  DFHMDF LENGTH=8,POS=(17,70),ATTRB=(ASKIP,NORM,FSET)            00170   
IELN25   DFHMDF LENGTH=2,POS=(18,2),ATTRB=(ASKIP,BRT,FSET)              00171   
IEFR25   DFHMDF LENGTH=2,POS=(18,6),ATTRB=(ASKIP,NORM,FSET)             00172   
IEEDT25  DFHMDF LENGTH=6,POS=(18,9),ATTRB=(ASKIP,NORM,FSET)             00173   
IETDT25  DFHMDF LENGTH=8,POS=(18,16),ATTRB=(ASKIP,NORM,FSET)            00174   
IELN26   DFHMDF LENGTH=2,POS=(18,29),ATTRB=(ASKIP,BRT,FSET)             00175   
IEFR26   DFHMDF LENGTH=2,POS=(18,33),ATTRB=(ASKIP,NORM,FSET)            00176   
IEEDT26  DFHMDF LENGTH=6,POS=(18,36),ATTRB=(ASKIP,NORM,FSET)            00177   
IETDT26  DFHMDF LENGTH=8,POS=(18,43),ATTRB=(ASKIP,NORM,FSET)            00178   
IELN27   DFHMDF LENGTH=2,POS=(18,56),ATTRB=(ASKIP,BRT,FSET)             00179   
IEFR27   DFHMDF LENGTH=2,POS=(18,60),ATTRB=(ASKIP,NORM,FSET)            00180   
IEEDT27  DFHMDF LENGTH=6,POS=(18,63),ATTRB=(ASKIP,NORM,FSET)            00181   
IETDT27  DFHMDF LENGTH=8,POS=(18,70),ATTRB=(ASKIP,NORM,FSET)            00182   
IELN28   DFHMDF LENGTH=2,POS=(19,2),ATTRB=(ASKIP,BRT,FSET)              00183   
IEFR28   DFHMDF LENGTH=2,POS=(19,6),ATTRB=(ASKIP,NORM,FSET)             00184   
IEEDT28  DFHMDF LENGTH=6,POS=(19,9),ATTRB=(ASKIP,NORM,FSET)             00185   
IETDT28  DFHMDF LENGTH=8,POS=(19,16),ATTRB=(ASKIP,NORM,FSET)            00186   
IELN29   DFHMDF LENGTH=2,POS=(19,29),ATTRB=(ASKIP,BRT,FSET)             00187   
IEFR29   DFHMDF LENGTH=2,POS=(19,33),ATTRB=(ASKIP,NORM,FSET)            00188   
IEEDT29  DFHMDF LENGTH=6,POS=(19,36),ATTRB=(ASKIP,NORM,FSET)            00189   
IETDT29  DFHMDF LENGTH=8,POS=(19,43),ATTRB=(ASKIP,NORM,FSET)            00190   
IELN30   DFHMDF LENGTH=2,POS=(19,56),ATTRB=(ASKIP,BRT,FSET)             00191   
IEFR30   DFHMDF LENGTH=2,POS=(19,60),ATTRB=(ASKIP,NORM,FSET)            00192   
IEEDT30  DFHMDF LENGTH=6,POS=(19,63),ATTRB=(ASKIP,NORM,FSET)            00193   
IETDT30  DFHMDF LENGTH=8,POS=(19,70),ATTRB=(ASKIP,NORM,FSET)            00194   
         DFHMDF LENGTH=0040,POS=(20,19),ATTRB=(ASKIP,NORM),INITIAL='PAGX00195   
               ING:  PF7 (BACKWARD)    PF8 (FORWARD)'                   00196   
IEMSG1   DFHMDF LENGTH=79,POS=(21,1),ATTRB=(PROT,BRT)                   00197   
IEMSG2   DFHMDF LENGTH=79,POS=(22,1),ATTRB=(PROT,BRT)                   00198   
IEMSG3   DFHMDF LENGTH=79,POS=(24,1),ATTRB=(PROT,BRT)                   00199   
         DFHMSD TYPE=FINAL                                              00200   
         END                                                            00201   
/*                                                                      00202   
